[Survived] BlockStatement
services/monteCarloEngine.js:8:56
  */
 import { INSTRUMENT_PARAMS as CENTRAL_PARAMS, RISK_FREE_RATE, toMonthlyRate } from './instrumentConstants.js';
 const INSTRUMENT_PARAMS = {};
-for (const [key, p] of Object.entries(CENTRAL_PARAMS)) {
-    INSTRUMENT_PARAMS[key] = { mean: p.nominalRate / 100, stdDev: p.volatility };
-}
+for (const [key, p] of Object.entries(CENTRAL_PARAMS)) {}
 /**
  * Halton low-discrepancy sequence generator.

[Survived] ArithmeticOperator
services/monteCarloEngine.js:9:38
 import { INSTRUMENT_PARAMS as CENTRAL_PARAMS, RISK_FREE_RATE, toMonthlyRate } from './instrumentConstants.js';
 const INSTRUMENT_PARAMS = {};
 for (const [key, p] of Object.entries(CENTRAL_PARAMS)) {
-    INSTRUMENT_PARAMS[key] = { mean: p.nominalRate / 100, stdDev: p.volatility };
+    INSTRUMENT_PARAMS[key] = { mean: p.nominalRate * 100, stdDev: p.volatility };
 }
 /**

[Survived] BlockStatement
services/monteCarloEngine.js:14:30
 /**
  * Halton low-discrepancy sequence generator.
  */
-function halton(index, base) {
-    let result = 0;
-    let f = 1 / base;
-    let i = index;
-    while (i > 0) {
-        result += f * (i % base);
-        i = Math.floor(i / base);
-        f /= base;
-    }
-    return result;
-}
+function halton(index, base) {}
 /**
  * Box-Muller transform — generates a normally distributed random number.

[Survived] ArithmeticOperator
services/monteCarloEngine.js:16:13
  */
 function halton(index, base) {
     let result = 0;
-    let f = 1 / base;
+    let f = 1 * base;
     let i = index;
     while (i > 0) {

[Survived] ConditionalExpression
services/monteCarloEngine.js:18:12
     let result = 0;
     let f = 1 / base;
     let i = index;
-    while (i > 0) {
+    while (false) {
         result += f * (i % base);
         i = Math.floor(i / base);

[Timeout] BlockStatement
services/monteCarloEngine.js:18:19
     let result = 0;
     let f = 1 / base;
     let i = index;
-    while (i > 0) {
-        result += f * (i % base);
-        i = Math.floor(i / base);
-        f /= base;
-    }
+    while (i > 0) {}
     return result;
 }

[Survived] ArithmeticOperator
services/monteCarloEngine.js:19:19
     let f = 1 / base;
     let i = index;
     while (i > 0) {
-        result += f * (i % base);
+        result += f / (i % base);
         i = Math.floor(i / base);
         f /= base;

[Survived] ArithmeticOperator
services/monteCarloEngine.js:19:24
     let f = 1 / base;
     let i = index;
     while (i > 0) {
-        result += f * (i % base);
+        result += f * (i * base);
         i = Math.floor(i / base);
         f /= base;

[Timeout] ArithmeticOperator
services/monteCarloEngine.js:20:24
     let i = index;
     while (i > 0) {
         result += f * (i % base);
-        i = Math.floor(i / base);
+        i = Math.floor(i * base);
         f /= base;
     }

[Survived] AssignmentOperator
services/monteCarloEngine.js:21:9
     while (i > 0) {
         result += f * (i % base);
         i = Math.floor(i / base);
-        f /= base;
+        f *= base;
     }
     return result;

[Killed] BlockStatement
services/monteCarloEngine.js:28:28
 /**
  * Box-Muller transform — generates a normally distributed random number.
  */
-function boxMuller(u1, u2) {
-    if (u1 === undefined || u1 <= 0 || u1 >= 1) {
-        u1 = Math.random() || 0.5;
-    }
-    if (u2 === undefined || u2 <= 0 || u2 >= 1) {
-        u2 = Math.random() || 0.5;
-    }
-    u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
-    u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
-    return Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
-}
+function boxMuller(u1, u2) {}
 /**
  * Compute percentile from a sorted array using linear interpolation.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (129.0231ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] EqualityOperator
services/monteCarloEngine.js:29:9
  * Box-Muller transform — generates a normally distributed random number.
  */
 function boxMuller(u1, u2) {
-    if (u1 === undefined || u1 <= 0 || u1 >= 1) {
+    if (u1 !== undefined || u1 <= 0 || u1 >= 1) {
         u1 = Math.random() || 0.5;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (251.1115ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] LogicalOperator
services/monteCarloEngine.js:29:9
  * Box-Muller transform — generates a normally distributed random number.
  */
 function boxMuller(u1, u2) {
-    if (u1 === undefined || u1 <= 0 || u1 >= 1) {
+    if ((u1 === undefined || u1 <= 0) && u1 >= 1) {
         u1 = Math.random() || 0.5;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (222.02ms)

[Survived] ConditionalExpression
services/monteCarloEngine.js:30:14
  */
 function boxMuller(u1, u2) {
     if (u1 === undefined || u1 <= 0 || u1 >= 1) {
-        u1 = Math.random() || 0.5;
+        u1 = false;
     }
     if (u2 === undefined || u2 <= 0 || u2 >= 1) {

[Survived] LogicalOperator
services/monteCarloEngine.js:30:14
  */
 function boxMuller(u1, u2) {
     if (u1 === undefined || u1 <= 0 || u1 >= 1) {
-        u1 = Math.random() || 0.5;
+        u1 = Math.random() && 0.5;
     }
     if (u2 === undefined || u2 <= 0 || u2 >= 1) {

[Killed] LogicalOperator
services/monteCarloEngine.js:32:9
     if (u1 === undefined || u1 <= 0 || u1 >= 1) {
         u1 = Math.random() || 0.5;
     }
-    if (u2 === undefined || u2 <= 0 || u2 >= 1) {
+    if (u2 === undefined && u2 <= 0 || u2 >= 1) {
         u2 = Math.random() || 0.5;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (349.382ms)

[Killed] BlockStatement
services/monteCarloEngine.js:32:49
     if (u1 === undefined || u1 <= 0 || u1 >= 1) {
         u1 = Math.random() || 0.5;
     }
-    if (u2 === undefined || u2 <= 0 || u2 >= 1) {
-        u2 = Math.random() || 0.5;
-    }
+    if (u2 === undefined || u2 <= 0 || u2 >= 1) {}
     u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
     u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (397.4675ms)

[Survived] LogicalOperator
services/monteCarloEngine.js:33:14
         u1 = Math.random() || 0.5;
     }
     if (u2 === undefined || u2 <= 0 || u2 >= 1) {
-        u2 = Math.random() || 0.5;
+        u2 = Math.random() && 0.5;
     }
     u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));

[Survived] ConditionalExpression
services/monteCarloEngine.js:33:14
         u1 = Math.random() || 0.5;
     }
     if (u2 === undefined || u2 <= 0 || u2 >= 1) {
-        u2 = Math.random() || 0.5;
+        u2 = true;
     }
     u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));

[Survived] ArithmeticOperator
services/monteCarloEngine.js:35:39
     if (u2 === undefined || u2 <= 0 || u2 >= 1) {
         u2 = Math.random() || 0.5;
     }
-    u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
+    u1 = Math.max(1e-15, Math.min(u1, 1 + 1e-15));
     u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
     return Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);

[Survived] MethodExpression
services/monteCarloEngine.js:35:10
     if (u2 === undefined || u2 <= 0 || u2 >= 1) {
         u2 = Math.random() || 0.5;
     }
-    u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
+    u1 = Math.min(1e-15, Math.min(u1, 1 - 1e-15));
     u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
     return Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);

[Survived] MethodExpression
services/monteCarloEngine.js:36:10
         u2 = Math.random() || 0.5;
     }
     u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
-    u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
+    u2 = Math.min(1e-15, Math.min(u2, 1 - 1e-15));
     return Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
 }

[Survived] MethodExpression
services/monteCarloEngine.js:36:26
         u2 = Math.random() || 0.5;
     }
     u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
-    u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
+    u2 = Math.max(1e-15, Math.max(u2, 1 - 1e-15));
     return Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
 }

[Killed] UnaryOperator
services/monteCarloEngine.js:37:22
     }
     u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
     u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
-    return Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
+    return Math.sqrt(+2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (358.7419ms)

[Survived] ArithmeticOperator
services/monteCarloEngine.js:37:22
     }
     u1 = Math.max(1e-15, Math.min(u1, 1 - 1e-15));
     u2 = Math.max(1e-15, Math.min(u2, 1 - 1e-15));
-    return Math.sqrt(-2.0 * Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
+    return Math.sqrt(-2.0 / Math.log(u1)) * Math.cos(2.0 * Math.PI * u2);
 }
 /**

[Killed] BlockStatement
services/monteCarloEngine.js:42:35
 /**
  * Compute percentile from a sorted array using linear interpolation.
  */
-function percentile(sortedArr, p) {
-    if (sortedArr.length === 0)
-        return 0;
-    const idx = (p / 100) * (sortedArr.length - 1);
-    const lower = Math.floor(idx);
-    const upper = Math.ceil(idx);
-    if (lower === upper)
-        return sortedArr[lower];
-    return sortedArr[lower] + (sortedArr[upper] - sortedArr[lower]) * (idx - lower);
-}
+function percentile(sortedArr, p) {}
 function buildProjectionHorizon(years) {
     const numericYears = Number(years);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (326.5426ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:43:9
  * Compute percentile from a sorted array using linear interpolation.
  */
 function percentile(sortedArr, p) {
-    if (sortedArr.length === 0)
+    if (sortedArr.length !== 0)
         return 0;
     const idx = (p / 100) * (sortedArr.length - 1);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (340.6404ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:43:9
  * Compute percentile from a sorted array using linear interpolation.
  */
 function percentile(sortedArr, p) {
-    if (sortedArr.length === 0)
+    if (true)
         return 0;
     const idx = (p / 100) * (sortedArr.length - 1);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (386.2661ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:45:18
 function percentile(sortedArr, p) {
     if (sortedArr.length === 0)
         return 0;
-    const idx = (p / 100) * (sortedArr.length - 1);
+    const idx = (p * 100) * (sortedArr.length - 1);
     const lower = Math.floor(idx);
     const upper = Math.ceil(idx);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (335.6286ms)

[Survived] ArithmeticOperator
services/monteCarloEngine.js:45:30
 function percentile(sortedArr, p) {
     if (sortedArr.length === 0)
         return 0;
-    const idx = (p / 100) * (sortedArr.length - 1);
+    const idx = (p / 100) * (sortedArr.length + 1);
     const lower = Math.floor(idx);
     const upper = Math.ceil(idx);

[Survived] ConditionalExpression
services/monteCarloEngine.js:48:9
     const idx = (p / 100) * (sortedArr.length - 1);
     const lower = Math.floor(idx);
     const upper = Math.ceil(idx);
-    if (lower === upper)
+    if (false)
         return sortedArr[lower];
     return sortedArr[lower] + (sortedArr[upper] - sortedArr[lower]) * (idx - lower);

[Survived] EqualityOperator
services/monteCarloEngine.js:48:9
     const idx = (p / 100) * (sortedArr.length - 1);
     const lower = Math.floor(idx);
     const upper = Math.ceil(idx);
-    if (lower === upper)
+    if (lower !== upper)
         return sortedArr[lower];
     return sortedArr[lower] + (sortedArr[upper] - sortedArr[lower]) * (idx - lower);

[Killed] ArithmeticOperator
services/monteCarloEngine.js:50:32
     const upper = Math.ceil(idx);
     if (lower === upper)
         return sortedArr[lower];
-    return sortedArr[lower] + (sortedArr[upper] - sortedArr[lower]) * (idx - lower);
+    return sortedArr[lower] + (sortedArr[upper] + sortedArr[lower]) * (idx - lower);
 }
 function buildProjectionHorizon(years) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (330.8996ms)

[Survived] ArithmeticOperator
services/monteCarloEngine.js:50:72
     const upper = Math.ceil(idx);
     if (lower === upper)
         return sortedArr[lower];
-    return sortedArr[lower] + (sortedArr[upper] - sortedArr[lower]) * (idx - lower);
+    return sortedArr[lower] + (sortedArr[upper] - sortedArr[lower]) * (idx + lower);
 }
 function buildProjectionHorizon(years) {

[Killed] BlockStatement
services/monteCarloEngine.js:52:40
         return sortedArr[lower];
     return sortedArr[lower] + (sortedArr[upper] - sortedArr[lower]) * (idx - lower);
 }
-function buildProjectionHorizon(years) {
-    const numericYears = Number(years);
-    const requestedYears = Number.isFinite(numericYears) && numericYears > 0 ? numericYears : 1;
-    const totalMonths = Math.max(1, Math.round(requestedYears * 12));
-    const checkpointMonths = [];
-    for (let month = 12; month < totalMonths; month += 12) {
-        checkpointMonths.push(month);
-    }
-    if (!checkpointMonths.includes(totalMonths)) {
-        checkpointMonths.push(totalMonths);
-    }
-    return {
-        years: totalMonths / 12,
-        totalMonths,
-        checkpointMonths,
-        yearsArray: checkpointMonths.map(month => Number((month / 12).toFixed(2))),
-    };
-}
+function buildProjectionHorizon(years) {}
 function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {
     if (!monthlyInvestment || monthlyInvestment <= 0 || totalMonths <= 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (5.9669ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.0241ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:54:28
 }
 function buildProjectionHorizon(years) {
     const numericYears = Number(years);
-    const requestedYears = Number.isFinite(numericYears) && numericYears > 0 ? numericYears : 1;
+    const requestedYears = false ? numericYears : 1;
     const totalMonths = Math.max(1, Math.round(requestedYears * 12));
     const checkpointMonths = [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (79.41ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.0792ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:54:61
 }
 function buildProjectionHorizon(years) {
     const numericYears = Number(years);
-    const requestedYears = Number.isFinite(numericYears) && numericYears > 0 ? numericYears : 1;
+    const requestedYears = Number.isFinite(numericYears) && numericYears <= 0 ? numericYears : 1;
     const totalMonths = Math.max(1, Math.round(requestedYears * 12));
     const checkpointMonths = [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (138.1582ms)
✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.0653ms)

✔ sampleLogNorma

[Killed] ArithmeticOperator
services/monteCarloEngine.js:55:48
 function buildProjectionHorizon(years) {
     const numericYears = Number(years);
     const requestedYears = Number.isFinite(numericYears) && numericYears > 0 ? numericYears : 1;
-    const totalMonths = Math.max(1, Math.round(requestedYears * 12));
+    const totalMonths = Math.max(1, Math.round(requestedYears / 12));
     const checkpointMonths = [];
     for (let month = 12; month < totalMonths; month += 12) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (23.3458ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.0747ms)

[Killed] MethodExpression
services/monteCarloEngine.js:55:25
 function buildProjectionHorizon(years) {
     const numericYears = Number(years);
     const requestedYears = Number.isFinite(numericYears) && numericYears > 0 ? numericYears : 1;
-    const totalMonths = Math.max(1, Math.round(requestedYears * 12));
+    const totalMonths = Math.min(1, Math.round(requestedYears * 12));
     const checkpointMonths = [];
     for (let month = 12; month < totalMonths; month += 12) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (30.2784ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.1979ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:57:26
     const requestedYears = Number.isFinite(numericYears) && numericYears > 0 ? numericYears : 1;
     const totalMonths = Math.max(1, Math.round(requestedYears * 12));
     const checkpointMonths = [];
-    for (let month = 12; month < totalMonths; month += 12) {
+    for (let month = 12; false; month += 12) {
         checkpointMonths.push(month);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (364.7801ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.1019ms)
✔ sampleLogNorma

[Killed] EqualityOperator
services/monteCarloEngine.js:57:26
     const requestedYears = Number.isFinite(numericYears) && numericYears > 0 ? numericYears : 1;
     const totalMonths = Math.max(1, Math.round(requestedYears * 12));
     const checkpointMonths = [];
-    for (let month = 12; month < totalMonths; month += 12) {
+    for (let month = 12; month >= totalMonths; month += 12) {
         checkpointMonths.push(month);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (312.1202ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.9578ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:60:9
     for (let month = 12; month < totalMonths; month += 12) {
         checkpointMonths.push(month);
     }
-    if (!checkpointMonths.includes(totalMonths)) {
+    if (false) {
         checkpointMonths.push(totalMonths);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (331.4832ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.0095ms)

[Killed] BlockStatement
services/monteCarloEngine.js:60:50
     for (let month = 12; month < totalMonths; month += 12) {
         checkpointMonths.push(month);
     }
-    if (!checkpointMonths.includes(totalMonths)) {
-        checkpointMonths.push(totalMonths);
-    }
+    if (!checkpointMonths.includes(totalMonths)) {}
     return {
         years: totalMonths / 12,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (296.876ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (2.2063ms)
✔ sampleLogNormal

[Killed] ObjectLiteral
services/monteCarloEngine.js:63:12
     if (!checkpointMonths.includes(totalMonths)) {
         checkpointMonths.push(totalMonths);
     }
-    return {
-        years: totalMonths / 12,
-        totalMonths,
-        checkpointMonths,
-        yearsArray: checkpointMonths.map(month => Number((month / 12).toFixed(2))),
-    };
+    return {};
 }
 function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (5.1295ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.9869ms)
✔ sampleLogNormalM

[Timeout] ArithmeticOperator
services/monteCarloEngine.js:64:16
         checkpointMonths.push(totalMonths);
     }
     return {
-        years: totalMonths / 12,
+        years: totalMonths * 12,
         totalMonths,
         checkpointMonths,

[Survived] ArrowFunction
services/monteCarloEngine.js:67:42
         years: totalMonths / 12,
         totalMonths,
         checkpointMonths,
-        yearsArray: checkpointMonths.map(month => Number((month / 12).toFixed(2))),
+        yearsArray: checkpointMonths.map(() => undefined),
     };
 }

[Survived] ArithmeticOperator
services/monteCarloEngine.js:67:59
         years: totalMonths / 12,
         totalMonths,
         checkpointMonths,
-        yearsArray: checkpointMonths.map(month => Number((month / 12).toFixed(2))),
+        yearsArray: checkpointMonths.map(month => Number((month * 12).toFixed(2))),
     };
 }

[Killed] BlockStatement
services/monteCarloEngine.js:70:68
         yearsArray: checkpointMonths.map(month => Number((month / 12).toFixed(2))),
     };
 }
-function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {
-    if (!monthlyInvestment || monthlyInvestment <= 0 || totalMonths <= 0)
-        return 0;
-    if (Math.abs(monthlyRate) < 1e-12) {
-        return monthlyInvestment * totalMonths;
-    }
-    return monthlyInvestment
-        * ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate)
-        * (1 + monthlyRate);
-}
+function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {}
 /**
  * Helper to sample a single monthly log-normal multiplier (GBM).
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (286.6488ms)

[Survived] EqualityOperator
services/monteCarloEngine.js:71:31
     };
 }
 function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {
-    if (!monthlyInvestment || monthlyInvestment <= 0 || totalMonths <= 0)
+    if (!monthlyInvestment || monthlyInvestment > 0 || totalMonths <= 0)
         return 0;
     if (Math.abs(monthlyRate) < 1e-12) {

[Survived] LogicalOperator
services/monteCarloEngine.js:71:9
     };
 }
 function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {
-    if (!monthlyInvestment || monthlyInvestment <= 0 || totalMonths <= 0)
+    if (!monthlyInvestment && monthlyInvestment <= 0 || totalMonths <= 0)
         return 0;
     if (Math.abs(monthlyRate) < 1e-12) {

[Survived] EqualityOperator
services/monteCarloEngine.js:73:9
 function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {
     if (!monthlyInvestment || monthlyInvestment <= 0 || totalMonths <= 0)
         return 0;
-    if (Math.abs(monthlyRate) < 1e-12) {
+    if (Math.abs(monthlyRate) >= 1e-12) {
         return monthlyInvestment * totalMonths;
     }

[Survived] EqualityOperator
services/monteCarloEngine.js:73:9
 function annuityDueFV(monthlyInvestment, monthlyRate, totalMonths) {
     if (!monthlyInvestment || monthlyInvestment <= 0 || totalMonths <= 0)
         return 0;
-    if (Math.abs(monthlyRate) < 1e-12) {
+    if (Math.abs(monthlyRate) <= 1e-12) {
         return monthlyInvestment * totalMonths;
     }

[Survived] ArithmeticOperator
services/monteCarloEngine.js:74:16
     if (!monthlyInvestment || monthlyInvestment <= 0 || totalMonths <= 0)
         return 0;
     if (Math.abs(monthlyRate) < 1e-12) {
-        return monthlyInvestment * totalMonths;
+        return monthlyInvestment / totalMonths;
     }
     return monthlyInvestment

[Survived] ArithmeticOperator
services/monteCarloEngine.js:76:12
     if (Math.abs(monthlyRate) < 1e-12) {
         return monthlyInvestment * totalMonths;
     }
-    return monthlyInvestment
-        * ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate)
-        * (1 + monthlyRate);
+    return monthlyInvestment * ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate) / (1 + monthlyRate);
 }
 /**

[Survived] ArithmeticOperator
services/monteCarloEngine.js:76:12
     if (Math.abs(monthlyRate) < 1e-12) {
         return monthlyInvestment * totalMonths;
     }
-    return monthlyInvestment
-        * ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate)
+    return monthlyInvestment / ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate)
         * (1 + monthlyRate);
 }
