[Killed] ArithmeticOperator
services/monteCarloEngine.js:77:22
         return monthlyInvestment * totalMonths;
     }
     return monthlyInvestment
-        * ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate)
+        * ((Math.pow(1 - monthlyRate, totalMonths) - 1) / monthlyRate)
         * (1 + monthlyRate);
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (330.3522ms)

[Survived] ArithmeticOperator
services/monteCarloEngine.js:77:13
         return monthlyInvestment * totalMonths;
     }
     return monthlyInvestment
-        * ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate)
+        * ((Math.pow(1 + monthlyRate, totalMonths) + 1) / monthlyRate)
         * (1 + monthlyRate);
 }

[Survived] ArithmeticOperator
services/monteCarloEngine.js:78:12
     }
     return monthlyInvestment
         * ((Math.pow(1 + monthlyRate, totalMonths) - 1) / monthlyRate)
-        * (1 + monthlyRate);
+        * (1 - monthlyRate);
 }
 /**

[Killed] BlockStatement
services/monteCarloEngine.js:83:69
 /**
  * Helper to sample a single monthly log-normal multiplier (GBM).
  */
-export function sampleLogNormalMonthly(annualMean, annualVol, zVal) {
-    const dt = 1 / 12;
-    const drift = (annualMean - 0.5 * annualVol * annualVol) * dt;
-    const vol = annualVol * Math.sqrt(dt);
-    return Math.exp(drift + vol * zVal);
-}
+export function sampleLogNormalMonthly(annualMean, annualVol, zVal) {}
 /**
  * Compute Sequence of Returns Risk.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (281.9853ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:84:16
  * Helper to sample a single monthly log-normal multiplier (GBM).
  */
 export function sampleLogNormalMonthly(annualMean, annualVol, zVal) {
-    const dt = 1 / 12;
+    const dt = 1 * 12;
     const drift = (annualMean - 0.5 * annualVol * annualVol) * dt;
     const vol = annualVol * Math.sqrt(dt);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (335.7824ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:85:33
  */
 export function sampleLogNormalMonthly(annualMean, annualVol, zVal) {
     const dt = 1 / 12;
-    const drift = (annualMean - 0.5 * annualVol * annualVol) * dt;
+    const drift = (annualMean - 0.5 / annualVol * annualVol) * dt;
     const vol = annualVol * Math.sqrt(dt);
     return Math.exp(drift + vol * zVal);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (324.8095ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ArithmeticOperator
services/monteCarloEngine.js:85:19
  */
 export function sampleLogNormalMonthly(annualMean, annualVol, zVal) {
     const dt = 1 / 12;
-    const drift = (annualMean - 0.5 * annualVol * annualVol) * dt;
+    const drift = (annualMean - 0.5 * annualVol * annualVol) / dt;
     const vol = annualVol * Math.sqrt(dt);
     return Math.exp(drift + vol * zVal);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (304.1139ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:86:17
 export function sampleLogNormalMonthly(annualMean, annualVol, zVal) {
     const dt = 1 / 12;
     const drift = (annualMean - 0.5 * annualVol * annualVol) * dt;
-    const vol = annualVol * Math.sqrt(dt);
+    const vol = annualVol / Math.sqrt(dt);
     return Math.exp(drift + vol * zVal);
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (284.2304ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:87:21
     const dt = 1 / 12;
     const drift = (annualMean - 0.5 * annualVol * annualVol) * dt;
     const vol = annualVol * Math.sqrt(dt);
-    return Math.exp(drift + vol * zVal);
+    return Math.exp(drift - vol * zVal);
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (329.6373ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:87:29
     const dt = 1 / 12;
     const drift = (annualMean - 0.5 * annualVol * annualVol) * dt;
     const vol = annualVol * Math.sqrt(dt);
-    return Math.exp(drift + vol * zVal);
+    return Math.exp(drift + vol / zVal);
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (378.9586ms)

[Killed] BlockStatement
services/monteCarloEngine.js:92:93
 /**
  * Compute Sequence of Returns Risk.
  */
-export function computeSequenceRisk(finalValues, simulations, years, monthlyWithdrawal = 0) {
-    if (!finalValues || finalValues.length === 0)
-        return 0;
-    if (monthlyWithdrawal > 0) {
-        const bankruptCount = finalValues.filter(v => v <= 0).length;
-        return parseFloat((bankruptCount / finalValues.length).toFixed(4));
-    }
-    const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
-    if (meanVal <= 0)
-        return 0;
-    const variance = finalValues.reduce((s, v) => s + Math.pow(v - meanVal, 2), 0) / finalValues.length;
-    const stdDev = Math.sqrt(variance);
-    const cv = stdDev / meanVal;
-    return parseFloat(cv.toFixed(4));
-}
+export function computeSequenceRisk(finalValues, simulations, years, monthlyWithdrawal = 0) {}
 /**
  * Compute implied annual volatility and Sharpe ratio proxy.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (375.5072ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:93:9
  * Compute Sequence of Returns Risk.
  */
 export function computeSequenceRisk(finalValues, simulations, years, monthlyWithdrawal = 0) {
-    if (!finalValues || finalValues.length === 0)
+    if (true)
         return 0;
     if (monthlyWithdrawal > 0) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (311.1732ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:93:9
  * Compute Sequence of Returns Risk.
  */
 export function computeSequenceRisk(finalValues, simulations, years, monthlyWithdrawal = 0) {
-    if (!finalValues || finalValues.length === 0)
+    if (false)
         return 0;
     if (monthlyWithdrawal > 0) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (381.31ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:95:9
 export function computeSequenceRisk(finalValues, simulations, years, monthlyWithdrawal = 0) {
     if (!finalValues || finalValues.length === 0)
         return 0;
-    if (monthlyWithdrawal > 0) {
+    if (false) {
         const bankruptCount = finalValues.filter(v => v <= 0).length;
         return parseFloat((bankruptCount / finalValues.length).toFixed(4));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.0386ms)

[Killed] BlockStatement
services/monteCarloEngine.js:95:32
 export function computeSequenceRisk(finalValues, simulations, years, monthlyWithdrawal = 0) {
     if (!finalValues || finalValues.length === 0)
         return 0;
-    if (monthlyWithdrawal > 0) {
-        const bankruptCount = finalValues.filter(v => v <= 0).length;
-        return parseFloat((bankruptCount / finalValues.length).toFixed(4));
-    }
+    if (monthlyWithdrawal > 0) {}
     const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
     if (meanVal <= 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (287.1614ms)

[Killed] MethodExpression
services/monteCarloEngine.js:96:31
     if (!finalValues || finalValues.length === 0)
         return 0;
     if (monthlyWithdrawal > 0) {
-        const bankruptCount = finalValues.filter(v => v <= 0).length;
+        const bankruptCount = finalValues.length;
         return parseFloat((bankruptCount / finalValues.length).toFixed(4));
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (354.5209ms)

[Killed] ArrowFunction
services/monteCarloEngine.js:96:50
     if (!finalValues || finalValues.length === 0)
         return 0;
     if (monthlyWithdrawal > 0) {
-        const bankruptCount = finalValues.filter(v => v <= 0).length;
+        const bankruptCount = finalValues.filter(() => undefined).length;
         return parseFloat((bankruptCount / finalValues.length).toFixed(4));
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (363.2601ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:97:28
         return 0;
     if (monthlyWithdrawal > 0) {
         const bankruptCount = finalValues.filter(v => v <= 0).length;
-        return parseFloat((bankruptCount / finalValues.length).toFixed(4));
+        return parseFloat((bankruptCount * finalValues.length).toFixed(4));
     }
     const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (329.3411ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ArrowFunction
services/monteCarloEngine.js:99:40
         const bankruptCount = finalValues.filter(v => v <= 0).length;
         return parseFloat((bankruptCount / finalValues.length).toFixed(4));
     }
-    const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
+    const meanVal = finalValues.reduce(() => undefined, 0) / finalValues.length;
     if (meanVal <= 0)
         return 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (373.4254ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:99:50
         const bankruptCount = finalValues.filter(v => v <= 0).length;
         return parseFloat((bankruptCount / finalValues.length).toFixed(4));
     }
-    const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
+    const meanVal = finalValues.reduce((a, b) => a - b, 0) / finalValues.length;
     if (meanVal <= 0)
         return 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (297.7144ms)
✔ reverseSIP handles zero rate, reachable targets, a

[Killed] ConditionalExpression
services/monteCarloEngine.js:100:9
         return parseFloat((bankruptCount / finalValues.length).toFixed(4));
     }
     const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
-    if (meanVal <= 0)
+    if (false)
         return 0;
     const variance = finalValues.reduce((s, v) => s + Math.pow(v - meanVal, 2), 0) / finalValues.length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (322.4299ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:100:9
         return parseFloat((bankruptCount / finalValues.length).toFixed(4));
     }
     const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
-    if (meanVal <= 0)
+    if (meanVal > 0)
         return 0;
     const variance = finalValues.reduce((s, v) => s + Math.pow(v - meanVal, 2), 0) / finalValues.length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (359.7852ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:102:64
     const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
     if (meanVal <= 0)
         return 0;
-    const variance = finalValues.reduce((s, v) => s + Math.pow(v - meanVal, 2), 0) / finalValues.length;
+    const variance = finalValues.reduce((s, v) => s + Math.pow(v + meanVal, 2), 0) / finalValues.length;
     const stdDev = Math.sqrt(variance);
     const cv = stdDev / meanVal;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (357.3234ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:102:22
     const meanVal = finalValues.reduce((a, b) => a + b, 0) / finalValues.length;
     if (meanVal <= 0)
         return 0;
-    const variance = finalValues.reduce((s, v) => s + Math.pow(v - meanVal, 2), 0) / finalValues.length;
+    const variance = finalValues.reduce((s, v) => s + Math.pow(v - meanVal, 2), 0) * finalValues.length;
     const stdDev = Math.sqrt(variance);
     const cv = stdDev / meanVal;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (384.7027ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:104:16
         return 0;
     const variance = finalValues.reduce((s, v) => s + Math.pow(v - meanVal, 2), 0) / finalValues.length;
     const stdDev = Math.sqrt(variance);
-    const cv = stdDev / meanVal;
+    const cv = stdDev * meanVal;
     return parseFloat(cv.toFixed(4));
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (371.6857ms)

[Killed] BlockStatement
services/monteCarloEngine.js:110:115
 /**
  * Compute implied annual volatility and Sharpe ratio proxy.
  */
-export function computeRiskMetrics(p50Values, p10Values, years, riskFreeRate = 0.065, postTaxAnnualReturn = 0.08) {
-    if (!p50Values || !p10Values || p50Values.length === 0 || p10Values.length === 0 || years <= 0) {
-        return { impliedVol: 0, sharpeRatio: 0 };
-    }
-    const p50Last = p50Values[p50Values.length - 1];
-    const p10Last = p10Values[p10Values.length - 1];
-    let impliedVol = 0.05; // default fallback
-    if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
-        impliedVol = Math.log(p50Last / p10Last) / (1.28155 * Math.sqrt(years));
-    }
-    const sharpeRatio = impliedVol > 0.0001 ? (postTaxAnnualReturn - riskFreeRate) / impliedVol : 0;
-    return {
-        impliedVol: parseFloat(impliedVol.toFixed(4)),
-        sharpeRatio: parseFloat(sharpeRatio.toFixed(4)),
-    };
-}
+export function computeRiskMetrics(p50Values, p10Values, years, riskFreeRate = 0.065, postTaxAnnualReturn = 0.08) {}
 /**
  * Run Monte Carlo simulation for SIP investment using GBM.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (430.8937ms)

[Killed] LogicalOperator
services/monteCarloEngine.js:111:9
  * Compute implied annual volatility and Sharpe ratio proxy.
  */
 export function computeRiskMetrics(p50Values, p10Values, years, riskFreeRate = 0.065, postTaxAnnualReturn = 0.08) {
-    if (!p50Values || !p10Values || p50Values.length === 0 || p10Values.length === 0 || years <= 0) {
+    if ((!p50Values || !p10Values) && p50Values.length === 0 || p10Values.length === 0 || years <= 0) {
         return { impliedVol: 0, sharpeRatio: 0 };
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (367.1751ms)

[Killed] LogicalOperator
services/monteCarloEngine.js:111:9
  * Compute implied annual volatility and Sharpe ratio proxy.
  */
 export function computeRiskMetrics(p50Values, p10Values, years, riskFreeRate = 0.065, postTaxAnnualReturn = 0.08) {
-    if (!p50Values || !p10Values || p50Values.length === 0 || p10Values.length === 0 || years <= 0) {
+    if ((!p50Values || !p10Values || p50Values.length === 0 || p10Values.length === 0) && years <= 0) {
         return { impliedVol: 0, sharpeRatio: 0 };
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (353.2205ms)

[Killed] ObjectLiteral
services/monteCarloEngine.js:112:16
  */
 export function computeRiskMetrics(p50Values, p10Values, years, riskFreeRate = 0.065, postTaxAnnualReturn = 0.08) {
     if (!p50Values || !p10Values || p50Values.length === 0 || p10Values.length === 0 || years <= 0) {
-        return { impliedVol: 0, sharpeRatio: 0 };
+        return {};
     }
     const p50Last = p50Values[p50Values.length - 1];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (313.2526ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:114:31
     if (!p50Values || !p10Values || p50Values.length === 0 || p10Values.length === 0 || years <= 0) {
         return { impliedVol: 0, sharpeRatio: 0 };
     }
-    const p50Last = p50Values[p50Values.length - 1];
+    const p50Last = p50Values[p50Values.length + 1];
     const p10Last = p10Values[p10Values.length - 1];
     let impliedVol = 0.05; // default fallback
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.8617ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:115:31
         return { impliedVol: 0, sharpeRatio: 0 };
     }
     const p50Last = p50Values[p50Values.length - 1];
-    const p10Last = p10Values[p10Values.length - 1];
+    const p10Last = p10Values[p10Values.length + 1];
     let impliedVol = 0.05; // default fallback
     if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (386.7727ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:117:39
     const p50Last = p50Values[p50Values.length - 1];
     const p10Last = p10Values[p10Values.length - 1];
     let impliedVol = 0.05; // default fallback
-    if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
+    if (p50Last > 0 && p10Last > 0 && true) {
         impliedVol = Math.log(p50Last / p10Last) / (1.28155 * Math.sqrt(years));
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (343.2441ms)

[Killed] LogicalOperator
services/monteCarloEngine.js:117:9
     const p50Last = p50Values[p50Values.length - 1];
     const p10Last = p10Values[p10Values.length - 1];
     let impliedVol = 0.05; // default fallback
-    if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
+    if (p50Last > 0 && p10Last > 0 || p50Last > p10Last) {
         impliedVol = Math.log(p50Last / p10Last) / (1.28155 * Math.sqrt(years));
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (374.3558ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:118:31
     const p10Last = p10Values[p10Values.length - 1];
     let impliedVol = 0.05; // default fallback
     if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
-        impliedVol = Math.log(p50Last / p10Last) / (1.28155 * Math.sqrt(years));
+        impliedVol = Math.log(p50Last * p10Last) / (1.28155 * Math.sqrt(years));
     }
     const sharpeRatio = impliedVol > 0.0001 ? (postTaxAnnualReturn - riskFreeRate) / impliedVol : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (366.7242ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:118:53
     const p10Last = p10Values[p10Values.length - 1];
     let impliedVol = 0.05; // default fallback
     if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
-        impliedVol = Math.log(p50Last / p10Last) / (1.28155 * Math.sqrt(years));
+        impliedVol = Math.log(p50Last / p10Last) / (1.28155 / Math.sqrt(years));
     }
     const sharpeRatio = impliedVol > 0.0001 ? (postTaxAnnualReturn - riskFreeRate) / impliedVol : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (332.3171ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:120:25
     if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
         impliedVol = Math.log(p50Last / p10Last) / (1.28155 * Math.sqrt(years));
     }
-    const sharpeRatio = impliedVol > 0.0001 ? (postTaxAnnualReturn - riskFreeRate) / impliedVol : 0;
+    const sharpeRatio = false ? (postTaxAnnualReturn - riskFreeRate) / impliedVol : 0;
     return {
         impliedVol: parseFloat(impliedVol.toFixed(4)),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (305.7081ms)
