[Killed] ArithmeticOperator
services/monteCarloEngine.js:120:47
     if (p50Last > 0 && p10Last > 0 && p50Last > p10Last) {
         impliedVol = Math.log(p50Last / p10Last) / (1.28155 * Math.sqrt(years));
     }
-    const sharpeRatio = impliedVol > 0.0001 ? (postTaxAnnualReturn - riskFreeRate) / impliedVol : 0;
+    const sharpeRatio = impliedVol > 0.0001 ? (postTaxAnnualReturn - riskFreeRate) * impliedVol : 0;
     return {
         impliedVol: parseFloat(impliedVol.toFixed(4)),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (309.3403ms)

[Killed] BooleanLiteral
services/monteCarloEngine.js:129:155
 /**
  * Run Monte Carlo simulation for SIP investment using GBM.
  */
-export function runMonteCarlo({ monthlyInvestment, postTaxAnnualReturn, annualVolatility, years, simulations = 10000, inflationRate = 0.05, isRealTrack = false, currentSavings = 0, }) {
+export function runMonteCarlo({ monthlyInvestment, postTaxAnnualReturn, annualVolatility, years, simulations = 10000, inflationRate = 0.05, isRealTrack = true, currentSavings = 0, }) {
     const horizon = buildProjectionHorizon(years);
     years = horizon.years;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (246.1092ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.8094ms)

[Survived] LogicalOperator
services/monteCarloEngine.js:132:28
 export function runMonteCarlo({ monthlyInvestment, postTaxAnnualReturn, annualVolatility, years, simulations = 10000, inflationRate = 0.05, isRealTrack = false, currentSavings = 0, }) {
     const horizon = buildProjectionHorizon(years);
     years = horizon.years;
-    const safeInvestment = Number.isFinite(Number(monthlyInvestment)) && Number(monthlyInvestment) > 0
+    const safeInvestment = Number.isFinite(Number(monthlyInvestment)) || Number(monthlyInvestment) > 0
         ? Number(monthlyInvestment)
         : 0;

[Survived] EqualityOperator
services/monteCarloEngine.js:132:74
 export function runMonteCarlo({ monthlyInvestment, postTaxAnnualReturn, annualVolatility, years, simulations = 10000, inflationRate = 0.05, isRealTrack = false, currentSavings = 0, }) {
     const horizon = buildProjectionHorizon(years);
     years = horizon.years;
-    const safeInvestment = Number.isFinite(Number(monthlyInvestment)) && Number(monthlyInvestment) > 0
+    const safeInvestment = Number.isFinite(Number(monthlyInvestment)) && Number(monthlyInvestment) >= 0
         ? Number(monthlyInvestment)
         : 0;

[Survived] EqualityOperator
services/monteCarloEngine.js:135:68
     const safeInvestment = Number.isFinite(Number(monthlyInvestment)) && Number(monthlyInvestment) > 0
         ? Number(monthlyInvestment)
         : 0;
-    const safeSavings = Number.isFinite(Number(currentSavings)) && Number(currentSavings) > 0
+    const safeSavings = Number.isFinite(Number(currentSavings)) && Number(currentSavings) >= 0
         ? Number(currentSavings)
         : 0;

[Survived] LogicalOperator
services/monteCarloEngine.js:135:25
     const safeInvestment = Number.isFinite(Number(monthlyInvestment)) && Number(monthlyInvestment) > 0
         ? Number(monthlyInvestment)
         : 0;
-    const safeSavings = Number.isFinite(Number(currentSavings)) && Number(currentSavings) > 0
+    const safeSavings = Number.isFinite(Number(currentSavings)) || Number(currentSavings) > 0
         ? Number(currentSavings)
         : 0;

[Killed] ConditionalExpression
services/monteCarloEngine.js:139:9
         ? Number(currentSavings)
         : 0;
     // Input guards
-    if (safeInvestment <= 0 && safeSavings <= 0) {
+    if (false) {
         return emptyResult(years, simulations);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (370.0616ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.9107ms)

[Killed] BlockStatement
services/monteCarloEngine.js:139:50
         ? Number(currentSavings)
         : 0;
     // Input guards
-    if (safeInvestment <= 0 && safeSavings <= 0) {
-        return emptyResult(years, simulations);
-    }
+    if (safeInvestment <= 0 && safeSavings <= 0) {}
     if (!years || years <= 0 || !Number.isFinite(years)) {
         return emptyResult(1, simulations);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (272.5794ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.4693ms)

[Killed] BooleanLiteral
services/monteCarloEngine.js:142:33
     if (safeInvestment <= 0 && safeSavings <= 0) {
         return emptyResult(years, simulations);
     }
-    if (!years || years <= 0 || !Number.isFinite(years)) {
+    if (!years || years <= 0 || Number.isFinite(years)) {
         return emptyResult(1, simulations);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (18.5792ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.4178ms)
✔ sampleLogNormal

[Killed] BooleanLiteral
services/monteCarloEngine.js:142:9
     if (safeInvestment <= 0 && safeSavings <= 0) {
         return emptyResult(years, simulations);
     }
-    if (!years || years <= 0 || !Number.isFinite(years)) {
+    if (years || years <= 0 || !Number.isFinite(years)) {
         return emptyResult(1, simulations);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (6.7658ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.9537ms)

[Survived] BooleanLiteral
services/monteCarloEngine.js:145:9
     if (!years || years <= 0 || !Number.isFinite(years)) {
         return emptyResult(1, simulations);
     }
-    if (!Number.isFinite(postTaxAnnualReturn))
+    if (Number.isFinite(postTaxAnnualReturn))
         postTaxAnnualReturn = 0.08;
     let safeVolatility = (!Number.isFinite(annualVolatility) || annualVolatility < 0) ? 0.05 : annualVolatility;

[Survived] ConditionalExpression
services/monteCarloEngine.js:145:9
     if (!years || years <= 0 || !Number.isFinite(years)) {
         return emptyResult(1, simulations);
     }
-    if (!Number.isFinite(postTaxAnnualReturn))
+    if (true)
         postTaxAnnualReturn = 0.08;
     let safeVolatility = (!Number.isFinite(annualVolatility) || annualVolatility < 0) ? 0.05 : annualVolatility;

[Survived] BooleanLiteral
services/monteCarloEngine.js:147:27
     }
     if (!Number.isFinite(postTaxAnnualReturn))
         postTaxAnnualReturn = 0.08;
-    let safeVolatility = (!Number.isFinite(annualVolatility) || annualVolatility < 0) ? 0.05 : annualVolatility;
+    let safeVolatility = (Number.isFinite(annualVolatility) || annualVolatility < 0) ? 0.05 : annualVolatility;
     // Cap simulations to prevent resource exhaustion (DoS vector)
     simulations = Math.min(Math.max(simulations, 100), 50000);

[Survived] EqualityOperator
services/monteCarloEngine.js:147:65
     }
     if (!Number.isFinite(postTaxAnnualReturn))
         postTaxAnnualReturn = 0.08;
-    let safeVolatility = (!Number.isFinite(annualVolatility) || annualVolatility < 0) ? 0.05 : annualVolatility;
+    let safeVolatility = (!Number.isFinite(annualVolatility) || annualVolatility >= 0) ? 0.05 : annualVolatility;
     // Cap simulations to prevent resource exhaustion (DoS vector)
     simulations = Math.min(Math.max(simulations, 100), 50000);

[Killed] MethodExpression
services/monteCarloEngine.js:149:28
         postTaxAnnualReturn = 0.08;
     let safeVolatility = (!Number.isFinite(annualVolatility) || annualVolatility < 0) ? 0.05 : annualVolatility;
     // Cap simulations to prevent resource exhaustion (DoS vector)
-    simulations = Math.min(Math.max(simulations, 100), 50000);
+    simulations = Math.min(Math.min(simulations, 100), 50000);
     // Warn on negative post-tax returns (possible during extreme market conditions)
     if (postTaxAnnualReturn < 0 && !isRealTrack) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (88.3097ms)

✔ reverseSIP handles zero rate, reachable targets,

[Timeout] MethodExpression
services/monteCarloEngine.js:149:19
         postTaxAnnualReturn = 0.08;
     let safeVolatility = (!Number.isFinite(annualVolatility) || annualVolatility < 0) ? 0.05 : annualVolatility;
     // Cap simulations to prevent resource exhaustion (DoS vector)
-    simulations = Math.min(Math.max(simulations, 100), 50000);
+    simulations = Math.max(Math.max(simulations, 100), 50000);
     // Warn on negative post-tax returns (possible during extreme market conditions)
     if (postTaxAnnualReturn < 0 && !isRealTrack) {

[Survived] LogicalOperator
services/monteCarloEngine.js:151:9
     // Cap simulations to prevent resource exhaustion (DoS vector)
     simulations = Math.min(Math.max(simulations, 100), 50000);
     // Warn on negative post-tax returns (possible during extreme market conditions)
-    if (postTaxAnnualReturn < 0 && !isRealTrack) {
+    if (postTaxAnnualReturn < 0 || !isRealTrack) {
         console.warn(`[MC] Negative post-tax return: ${(postTaxAnnualReturn * 100).toFixed(2)}%. `
             + `Simulation will proceed but projections may show capital erosion.`);

[Survived] ConditionalExpression
services/monteCarloEngine.js:151:9
     // Cap simulations to prevent resource exhaustion (DoS vector)
     simulations = Math.min(Math.max(simulations, 100), 50000);
     // Warn on negative post-tax returns (possible during extreme market conditions)
-    if (postTaxAnnualReturn < 0 && !isRealTrack) {
+    if (false) {
         console.warn(`[MC] Negative post-tax return: ${(postTaxAnnualReturn * 100).toFixed(2)}%. `
             + `Simulation will proceed but projections may show capital erosion.`);

[Survived] ArithmeticOperator
services/monteCarloEngine.js:152:57
     simulations = Math.min(Math.max(simulations, 100), 50000);
     // Warn on negative post-tax returns (possible during extreme market conditions)
     if (postTaxAnnualReturn < 0 && !isRealTrack) {
-        console.warn(`[MC] Negative post-tax return: ${(postTaxAnnualReturn * 100).toFixed(2)}%. `
+        console.warn(`[MC] Negative post-tax return: ${(postTaxAnnualReturn / 100).toFixed(2)}%. `
             + `Simulation will proceed but projections may show capital erosion.`);
     }

[Survived] StringLiteral
services/monteCarloEngine.js:153:15
     // Warn on negative post-tax returns (possible during extreme market conditions)
     if (postTaxAnnualReturn < 0 && !isRealTrack) {
         console.warn(`[MC] Negative post-tax return: ${(postTaxAnnualReturn * 100).toFixed(2)}%. `
-            + `Simulation will proceed but projections may show capital erosion.`);
+            + ``);
     }
     // Clamp volatility to sane range: 0.1% to 60%

[Killed] EqualityOperator
services/monteCarloEngine.js:156:9
             + `Simulation will proceed but projections may show capital erosion.`);
     }
     // Clamp volatility to sane range: 0.1% to 60%
-    if (safeVolatility > 0.60) {
+    if (safeVolatility <= 0.60) {
         if (!isRealTrack) {
             console.warn(`[MC] Extreme volatility ${(safeVolatility * 100).toFixed(1)}% clamped to 60%.`);
killedBy: All tests
statusReason: [MC] Extreme volatility 12.0% clamped to 60%.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 0.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (317.5074ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:156:9
             + `Simulation will proceed but projections may show capital erosion.`);
     }
     // Clamp volatility to sane range: 0.1% to 60%
-    if (safeVolatility > 0.60) {
+    if (true) {
         if (!isRealTrack) {
             console.warn(`[MC] Extreme volatility ${(safeVolatility * 100).toFixed(1)}% clamped to 60%.`);
killedBy: All tests
statusReason: [MC] Extreme volatility 12.0% clamped to 60%.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

[Survived] BlockStatement
services/monteCarloEngine.js:157:27
     }
     // Clamp volatility to sane range: 0.1% to 60%
     if (safeVolatility > 0.60) {
-        if (!isRealTrack) {
-            console.warn(`[MC] Extreme volatility ${(safeVolatility * 100).toFixed(1)}% clamped to 60%.`);
-        }
+        if (!isRealTrack) {}
         safeVolatility = 0.60;
     }

[Survived] ConditionalExpression
services/monteCarloEngine.js:157:13
     }
     // Clamp volatility to sane range: 0.1% to 60%
     if (safeVolatility > 0.60) {
-        if (!isRealTrack) {
+        if (true) {
             console.warn(`[MC] Extreme volatility ${(safeVolatility * 100).toFixed(1)}% clamped to 60%.`);
         }

[Survived] ArithmeticOperator
services/monteCarloEngine.js:158:54
     // Clamp volatility to sane range: 0.1% to 60%
     if (safeVolatility > 0.60) {
         if (!isRealTrack) {
-            console.warn(`[MC] Extreme volatility ${(safeVolatility * 100).toFixed(1)}% clamped to 60%.`);
+            console.warn(`[MC] Extreme volatility ${(safeVolatility / 100).toFixed(1)}% clamped to 60%.`);
         }
         safeVolatility = 0.60;

[Survived] StringLiteral
services/monteCarloEngine.js:158:26
     // Clamp volatility to sane range: 0.1% to 60%
     if (safeVolatility > 0.60) {
         if (!isRealTrack) {
-            console.warn(`[MC] Extreme volatility ${(safeVolatility * 100).toFixed(1)}% clamped to 60%.`);
+            console.warn(``);
         }
         safeVolatility = 0.60;

[Killed] ArrowFunction
services/monteCarloEngine.js:163:65
         safeVolatility = 0.60;
     }
     const { totalMonths, checkpointMonths, yearsArray } = horizon;
-    const checkpointMonthToIndex = new Map(checkpointMonths.map((month, index) => [month, index]));
+    const checkpointMonthToIndex = new Map(checkpointMonths.map(() => undefined));
     // finalValues[year_index] = array of terminal values across all simulations
     const allSimResults = yearsArray.map(() => []);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (7.9881ms)

✔ reverseSIP handles zero rate, reachable targets, a

[Killed] ArrayDeclaration
services/monteCarloEngine.js:163:83
         safeVolatility = 0.60;
     }
     const { totalMonths, checkpointMonths, yearsArray } = horizon;
-    const checkpointMonthToIndex = new Map(checkpointMonths.map((month, index) => [month, index]));
+    const checkpointMonthToIndex = new Map(checkpointMonths.map((month, index) => []));
     // finalValues[year_index] = array of terminal values across all simulations
     const allSimResults = yearsArray.map(() => []);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (362.221ms)

[Killed] ArrowFunction
services/monteCarloEngine.js:165:42
     const { totalMonths, checkpointMonths, yearsArray } = horizon;
     const checkpointMonthToIndex = new Map(checkpointMonths.map((month, index) => [month, index]));
     // finalValues[year_index] = array of terminal values across all simulations
-    const allSimResults = yearsArray.map(() => []);
+    const allSimResults = yearsArray.map(() => undefined);
     let finalValues = []; // terminal balances for goal probability
     const halfSims = Math.ceil(simulations / 2);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (12.6099ms)

✔ reverseSIP handles zero rate, reachable targets,

[Survived] ArithmeticOperator
services/monteCarloEngine.js:167:32
     // finalValues[year_index] = array of terminal values across all simulations
     const allSimResults = yearsArray.map(() => []);
     let finalValues = []; // terminal balances for goal probability
-    const halfSims = Math.ceil(simulations / 2);
+    const halfSims = Math.ceil(simulations * 2);
     const actualSims = halfSims * 2;
     // Deterministic SIP + lump sum FV for control variate (aligned with continuous GBM expected yield)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:168:24
     const allSimResults = yearsArray.map(() => []);
     let finalValues = []; // terminal balances for goal probability
     const halfSims = Math.ceil(simulations / 2);
-    const actualSims = halfSims * 2;
+    const actualSims = halfSims / 2;
     // Deterministic SIP + lump sum FV for control variate (aligned with continuous GBM expected yield)
     const r = toMonthlyRate(postTaxAnnualReturn, true);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (333.6994ms)

[Survived] BooleanLiteral
services/monteCarloEngine.js:170:50
     const halfSims = Math.ceil(simulations / 2);
     const actualSims = halfSims * 2;
     // Deterministic SIP + lump sum FV for control variate (aligned with continuous GBM expected yield)
-    const r = toMonthlyRate(postTaxAnnualReturn, true);
+    const r = toMonthlyRate(postTaxAnnualReturn, false);
     const fvSIP = annuityDueFV(safeInvestment, r, totalMonths);
     const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);

[Killed] ArithmeticOperator
services/monteCarloEngine.js:172:23
     // Deterministic SIP + lump sum FV for control variate (aligned with continuous GBM expected yield)
     const r = toMonthlyRate(postTaxAnnualReturn, true);
     const fvSIP = annuityDueFV(safeInvestment, r, totalMonths);
-    const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);
+    const fvSavings = safeSavings / Math.pow(1 + r, totalMonths);
     const deterministicFV = fvSIP + fvSavings;
     for (let sim = 0; sim < halfSims; sim++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.836ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:172:46
     // Deterministic SIP + lump sum FV for control variate (aligned with continuous GBM expected yield)
     const r = toMonthlyRate(postTaxAnnualReturn, true);
     const fvSIP = annuityDueFV(safeInvestment, r, totalMonths);
-    const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);
+    const fvSavings = safeSavings * Math.pow(1 - r, totalMonths);
     const deterministicFV = fvSIP + fvSavings;
     for (let sim = 0; sim < halfSims; sim++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (366.2287ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:173:29
     const r = toMonthlyRate(postTaxAnnualReturn, true);
     const fvSIP = annuityDueFV(safeInvestment, r, totalMonths);
     const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);
-    const deterministicFV = fvSIP + fvSavings;
+    const deterministicFV = fvSIP - fvSavings;
     for (let sim = 0; sim < halfSims; sim++) {
         const useQMC = sim < halfSims * 0.4;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (317.3627ms)
✔ reverseSIP handles zero rate, reachable targets,

[Killed] EqualityOperator
services/monteCarloEngine.js:174:23
     const fvSIP = annuityDueFV(safeInvestment, r, totalMonths);
     const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);
     const deterministicFV = fvSIP + fvSavings;
-    for (let sim = 0; sim < halfSims; sim++) {
+    for (let sim = 0; sim >= halfSims; sim++) {
         const useQMC = sim < halfSims * 0.4;
         const zValues = new Array(totalMonths);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (14.0864ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ConditionalExpression
services/monteCarloEngine.js:174:23
     const fvSIP = annuityDueFV(safeInvestment, r, totalMonths);
     const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);
     const deterministicFV = fvSIP + fvSavings;
-    for (let sim = 0; sim < halfSims; sim++) {
+    for (let sim = 0; false; sim++) {
         const useQMC = sim < halfSims * 0.4;
         const zValues = new Array(totalMonths);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (8.1504ms)

[Survived] EqualityOperator
services/monteCarloEngine.js:175:24
     const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);
     const deterministicFV = fvSIP + fvSavings;
     for (let sim = 0; sim < halfSims; sim++) {
-        const useQMC = sim < halfSims * 0.4;
+        const useQMC = sim >= halfSims * 0.4;
         const zValues = new Array(totalMonths);
         for (let i = 0; i < totalMonths; i++) {

[Survived] ConditionalExpression
services/monteCarloEngine.js:175:24
     const fvSavings = safeSavings * Math.pow(1 + r, totalMonths);
     const deterministicFV = fvSIP + fvSavings;
     for (let sim = 0; sim < halfSims; sim++) {
-        const useQMC = sim < halfSims * 0.4;
+        const useQMC = true;
         const zValues = new Array(totalMonths);
         for (let i = 0; i < totalMonths; i++) {

[Killed] BlockStatement
services/monteCarloEngine.js:177:47
     for (let sim = 0; sim < halfSims; sim++) {
         const useQMC = sim < halfSims * 0.4;
         const zValues = new Array(totalMonths);
-        for (let i = 0; i < totalMonths; i++) {
-            if (useQMC) {
-                const seqIdx = sim * totalMonths + i + 1;
-                const base1 = (i % 2 === 0) ? 2 : 5;
-                const base2 = (i % 2 === 0) ? 3 : 7;
-                const u1 = halton(seqIdx, base1) || 0.5;
-                const u2 = halton(seqIdx, base2) || 0.5;
-                zValues[i] = boxMuller(u1, u2);
-            }
-            else {
-                zValues[i] = boxMuller();
-            }
-        }
+        for (let i = 0; i < totalMonths; i++) {}
         // ── Path 1: use +Z ──────────────────────────────────────────────
         let balance1 = safeSavings;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (125.5937ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] EqualityOperator
services/monteCarloEngine.js:177:25
     for (let sim = 0; sim < halfSims; sim++) {
         const useQMC = sim < halfSims * 0.4;
         const zValues = new Array(totalMonths);
-        for (let i = 0; i < totalMonths; i++) {
+        for (let i = 0; i >= totalMonths; i++) {
             if (useQMC) {
                 const seqIdx = sim * totalMonths + i + 1;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (129.1345ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] BlockStatement
services/monteCarloEngine.js:178:25
         const useQMC = sim < halfSims * 0.4;
         const zValues = new Array(totalMonths);
         for (let i = 0; i < totalMonths; i++) {
-            if (useQMC) {
-                const seqIdx = sim * totalMonths + i + 1;
-                const base1 = (i % 2 === 0) ? 2 : 5;
-                const base2 = (i % 2 === 0) ? 3 : 7;
-                const u1 = halton(seqIdx, base1) || 0.5;
-                const u2 = halton(seqIdx, base2) || 0.5;
-                zValues[i] = boxMuller(u1, u2);
-            }
+            if (useQMC) {}
             else {
                 zValues[i] = boxMuller();
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (174.2047ms)

[Survived] ConditionalExpression
services/monteCarloEngine.js:178:17
         const useQMC = sim < halfSims * 0.4;
         const zValues = new Array(totalMonths);
         for (let i = 0; i < totalMonths; i++) {
-            if (useQMC) {
+            if (true) {
                 const seqIdx = sim * totalMonths + i + 1;
                 const base1 = (i % 2 === 0) ? 2 : 5;

[Survived] ArithmeticOperator
services/monteCarloEngine.js:179:32
         const zValues = new Array(totalMonths);
         for (let i = 0; i < totalMonths; i++) {
             if (useQMC) {
-                const seqIdx = sim * totalMonths + i + 1;
+                const seqIdx = sim / totalMonths + i + 1;
                 const base1 = (i % 2 === 0) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;

[Survived] ArithmeticOperator
services/monteCarloEngine.js:179:32
         const zValues = new Array(totalMonths);
         for (let i = 0; i < totalMonths; i++) {
             if (useQMC) {
-                const seqIdx = sim * totalMonths + i + 1;
+                const seqIdx = sim * totalMonths + i - 1;
                 const base1 = (i % 2 === 0) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;
