[Survived] ArithmeticOperator
services/monteCarloEngine.js:180:32
         for (let i = 0; i < totalMonths; i++) {
             if (useQMC) {
                 const seqIdx = sim * totalMonths + i + 1;
-                const base1 = (i % 2 === 0) ? 2 : 5;
+                const base1 = (i * 2 === 0) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;
                 const u1 = halton(seqIdx, base1) || 0.5;

[Survived] ConditionalExpression
services/monteCarloEngine.js:180:32
         for (let i = 0; i < totalMonths; i++) {
             if (useQMC) {
                 const seqIdx = sim * totalMonths + i + 1;
-                const base1 = (i % 2 === 0) ? 2 : 5;
+                const base1 = (true) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;
                 const u1 = halton(seqIdx, base1) || 0.5;

[Survived] EqualityOperator
services/monteCarloEngine.js:181:32
             if (useQMC) {
                 const seqIdx = sim * totalMonths + i + 1;
                 const base1 = (i % 2 === 0) ? 2 : 5;
-                const base2 = (i % 2 === 0) ? 3 : 7;
+                const base2 = (i % 2 !== 0) ? 3 : 7;
                 const u1 = halton(seqIdx, base1) || 0.5;
                 const u2 = halton(seqIdx, base2) || 0.5;

[Survived] ConditionalExpression
services/monteCarloEngine.js:181:32
             if (useQMC) {
                 const seqIdx = sim * totalMonths + i + 1;
                 const base1 = (i % 2 === 0) ? 2 : 5;
-                const base2 = (i % 2 === 0) ? 3 : 7;
+                const base2 = (false) ? 3 : 7;
                 const u1 = halton(seqIdx, base1) || 0.5;
                 const u2 = halton(seqIdx, base2) || 0.5;

[Survived] ConditionalExpression
services/monteCarloEngine.js:182:28
                 const seqIdx = sim * totalMonths + i + 1;
                 const base1 = (i % 2 === 0) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;
-                const u1 = halton(seqIdx, base1) || 0.5;
+                const u1 = false;
                 const u2 = halton(seqIdx, base2) || 0.5;
                 zValues[i] = boxMuller(u1, u2);

[Survived] ConditionalExpression
services/monteCarloEngine.js:182:28
                 const seqIdx = sim * totalMonths + i + 1;
                 const base1 = (i % 2 === 0) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;
-                const u1 = halton(seqIdx, base1) || 0.5;
+                const u1 = true;
                 const u2 = halton(seqIdx, base2) || 0.5;
                 zValues[i] = boxMuller(u1, u2);

[Survived] ConditionalExpression
services/monteCarloEngine.js:183:28
                 const base1 = (i % 2 === 0) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;
                 const u1 = halton(seqIdx, base1) || 0.5;
-                const u2 = halton(seqIdx, base2) || 0.5;
+                const u2 = true;
                 zValues[i] = boxMuller(u1, u2);
             }

[Survived] LogicalOperator
services/monteCarloEngine.js:183:28
                 const base1 = (i % 2 === 0) ? 2 : 5;
                 const base2 = (i % 2 === 0) ? 3 : 7;
                 const u1 = halton(seqIdx, base1) || 0.5;
-                const u2 = halton(seqIdx, base2) || 0.5;
+                const u2 = halton(seqIdx, base2) && 0.5;
                 zValues[i] = boxMuller(u1, u2);
             }

[Killed] BlockStatement
services/monteCarloEngine.js:186:18
                 const u2 = halton(seqIdx, base2) || 0.5;
                 zValues[i] = boxMuller(u1, u2);
             }
-            else {
-                zValues[i] = boxMuller();
-            }
+            else {}
         }
         // ── Path 1: use +Z ──────────────────────────────────────────────
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (273.4545ms)

[Survived] EqualityOperator
services/monteCarloEngine.js:192:32
         }
         // ── Path 1: use +Z ──────────────────────────────────────────────
         let balance1 = safeSavings;
-        for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
+        for (let monthIdx = 0; monthIdx >= totalMonths; monthIdx++) {
             balance1 += safeInvestment;
             const z = zValues[monthIdx];

[Survived] ConditionalExpression
services/monteCarloEngine.js:192:32
         }
         // ── Path 1: use +Z ──────────────────────────────────────────────
         let balance1 = safeSavings;
-        for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
+        for (let monthIdx = 0; false; monthIdx++) {
             balance1 += safeInvestment;
             const z = zValues[monthIdx];

[Survived] AssignmentOperator
services/monteCarloEngine.js:193:13
         // ── Path 1: use +Z ──────────────────────────────────────────────
         let balance1 = safeSavings;
         for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
-            balance1 += safeInvestment;
+            balance1 -= safeInvestment;
             const z = zValues[monthIdx];
             balance1 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, z);

[Survived] AssignmentOperator
services/monteCarloEngine.js:195:13
         for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
             balance1 += safeInvestment;
             const z = zValues[monthIdx];
-            balance1 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, z);
+            balance1 /= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, z);
             const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
             if (checkpointIdx !== undefined) {

[Survived] ArithmeticOperator
services/monteCarloEngine.js:196:62
             balance1 += safeInvestment;
             const z = zValues[monthIdx];
             balance1 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, z);
-            const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
+            const checkpointIdx = checkpointMonthToIndex.get(monthIdx - 1);
             if (checkpointIdx !== undefined) {
                 allSimResults[checkpointIdx].push(balance1);

[Killed] ConditionalExpression
services/monteCarloEngine.js:197:17
             const z = zValues[monthIdx];
             balance1 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, z);
             const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
-            if (checkpointIdx !== undefined) {
+            if (true) {
                 allSimResults[checkpointIdx].push(balance1);
             }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (11.0542ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] EqualityOperator
services/monteCarloEngine.js:197:17
             const z = zValues[monthIdx];
             balance1 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, z);
             const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
-            if (checkpointIdx !== undefined) {
+            if (checkpointIdx === undefined) {
                 allSimResults[checkpointIdx].push(balance1);
             }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (7.6882ms)

✔ reverseSIP handles zero rate, reachable targets, a

[Survived] BlockStatement
services/monteCarloEngine.js:204:68
         finalValues.push(balance1);
         // ── Path 2: use -Z (antithetic mirror) ──────────────────────────
         let balance2 = safeSavings;
-        for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
-            balance2 += safeInvestment;
-            const z = zValues[monthIdx];
-            balance2 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, -z);
-            const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
-            if (checkpointIdx !== undefined) {
-                allSimResults[checkpointIdx].push(balance2);
-            }
-        }
+        for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {}
         finalValues.push(balance2);
     }

[Survived] ConditionalExpression
services/monteCarloEngine.js:204:32
         finalValues.push(balance1);
         // ── Path 2: use -Z (antithetic mirror) ──────────────────────────
         let balance2 = safeSavings;
-        for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
+        for (let monthIdx = 0; false; monthIdx++) {
             balance2 += safeInvestment;
             const z = zValues[monthIdx];

[Survived] AssignmentOperator
services/monteCarloEngine.js:205:13
         // ── Path 2: use -Z (antithetic mirror) ──────────────────────────
         let balance2 = safeSavings;
         for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
-            balance2 += safeInvestment;
+            balance2 -= safeInvestment;
             const z = zValues[monthIdx];
             balance2 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, -z);

[Survived] UnaryOperator
services/monteCarloEngine.js:207:85
         for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
             balance2 += safeInvestment;
             const z = zValues[monthIdx];
-            balance2 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, -z);
+            balance2 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, +z);
             const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
             if (checkpointIdx !== undefined) {

[Survived] AssignmentOperator
services/monteCarloEngine.js:207:13
         for (let monthIdx = 0; monthIdx < totalMonths; monthIdx++) {
             balance2 += safeInvestment;
             const z = zValues[monthIdx];
-            balance2 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, -z);
+            balance2 /= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, -z);
             const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
             if (checkpointIdx !== undefined) {

[Survived] ArithmeticOperator
services/monteCarloEngine.js:208:62
             balance2 += safeInvestment;
             const z = zValues[monthIdx];
             balance2 *= sampleLogNormalMonthly(postTaxAnnualReturn, safeVolatility, -z);
-            const checkpointIdx = checkpointMonthToIndex.get(monthIdx + 1);
+            const checkpointIdx = checkpointMonthToIndex.get(monthIdx - 1);
             if (checkpointIdx !== undefined) {
                 allSimResults[checkpointIdx].push(balance2);

[Killed] EqualityOperator
services/monteCarloEngine.js:216:21
         finalValues.push(balance2);
     }
     // ── MULTIPLICATIVE CONTROL VARIATE CORRECTION ────────────────────────
-    for (let y = 0; y < checkpointMonths.length; y++) {
+    for (let y = 0; y <= checkpointMonths.length; y++) {
         const totalMonths_y = checkpointMonths[y];
         const fvSIP_y = annuityDueFV(safeInvestment, r, totalMonths_y);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (192.1462ms)

[Killed] UpdateOperator
services/monteCarloEngine.js:216:50
         finalValues.push(balance2);
     }
     // ── MULTIPLICATIVE CONTROL VARIATE CORRECTION ────────────────────────
-    for (let y = 0; y < checkpointMonths.length; y++) {
+    for (let y = 0; y < checkpointMonths.length; y--) {
         const totalMonths_y = checkpointMonths[y];
         const fvSIP_y = annuityDueFV(safeInvestment, r, totalMonths_y);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (223.6147ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:219:52
     for (let y = 0; y < checkpointMonths.length; y++) {
         const totalMonths_y = checkpointMonths[y];
         const fvSIP_y = annuityDueFV(safeInvestment, r, totalMonths_y);
-        const fvSavings_y = safeSavings * Math.pow(1 + r, totalMonths_y);
+        const fvSavings_y = safeSavings * Math.pow(1 - r, totalMonths_y);
         const deterministicFV_y = fvSIP_y + fvSavings_y;
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (328.4381ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:219:29
     for (let y = 0; y < checkpointMonths.length; y++) {
         const totalMonths_y = checkpointMonths[y];
         const fvSIP_y = annuityDueFV(safeInvestment, r, totalMonths_y);
-        const fvSavings_y = safeSavings * Math.pow(1 + r, totalMonths_y);
+        const fvSavings_y = safeSavings / Math.pow(1 + r, totalMonths_y);
         const deterministicFV_y = fvSIP_y + fvSavings_y;
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (342.531ms)

✔ reverseSIP handles zero rate, reachable targets, an

[Killed] ArithmeticOperator
services/monteCarloEngine.js:220:35
         const totalMonths_y = checkpointMonths[y];
         const fvSIP_y = annuityDueFV(safeInvestment, r, totalMonths_y);
         const fvSavings_y = safeSavings * Math.pow(1 + r, totalMonths_y);
-        const deterministicFV_y = fvSIP_y + fvSavings_y;
+        const deterministicFV_y = fvSIP_y - fvSavings_y;
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
         if (rawMean_y > 0) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (436.418ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:221:27
         const fvSIP_y = annuityDueFV(safeInvestment, r, totalMonths_y);
         const fvSavings_y = safeSavings * Math.pow(1 + r, totalMonths_y);
         const deterministicFV_y = fvSIP_y + fvSavings_y;
-        const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
+        const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) * allSimResults[y].length;
         if (rawMean_y > 0) {
             const ratio = deterministicFV_y / rawMean_y;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (367.7225ms)

[Survived] ArrowFunction
services/monteCarloEngine.js:221:51
         const fvSIP_y = annuityDueFV(safeInvestment, r, totalMonths_y);
         const fvSavings_y = safeSavings * Math.pow(1 + r, totalMonths_y);
         const deterministicFV_y = fvSIP_y + fvSavings_y;
-        const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
+        const rawMean_y = allSimResults[y].reduce(() => undefined, 0) / allSimResults[y].length;
         if (rawMean_y > 0) {
             const ratio = deterministicFV_y / rawMean_y;

[Survived] ConditionalExpression
services/monteCarloEngine.js:222:13
         const fvSavings_y = safeSavings * Math.pow(1 + r, totalMonths_y);
         const deterministicFV_y = fvSIP_y + fvSavings_y;
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
-        if (rawMean_y > 0) {
+        if (false) {
             const ratio = deterministicFV_y / rawMean_y;
             for (let s = 0; s < allSimResults[y].length; s++) {

[Survived] EqualityOperator
services/monteCarloEngine.js:222:13
         const fvSavings_y = safeSavings * Math.pow(1 + r, totalMonths_y);
         const deterministicFV_y = fvSIP_y + fvSavings_y;
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
-        if (rawMean_y > 0) {
+        if (rawMean_y >= 0) {
             const ratio = deterministicFV_y / rawMean_y;
             for (let s = 0; s < allSimResults[y].length; s++) {

[Killed] ArithmeticOperator
services/monteCarloEngine.js:223:27
         const deterministicFV_y = fvSIP_y + fvSavings_y;
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
         if (rawMean_y > 0) {
-            const ratio = deterministicFV_y / rawMean_y;
+            const ratio = deterministicFV_y * rawMean_y;
             for (let s = 0; s < allSimResults[y].length; s++) {
                 allSimResults[y][s] *= ratio;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (415.9598ms)

[Survived] BlockStatement
services/monteCarloEngine.js:224:63
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
         if (rawMean_y > 0) {
             const ratio = deterministicFV_y / rawMean_y;
-            for (let s = 0; s < allSimResults[y].length; s++) {
-                allSimResults[y][s] *= ratio;
-            }
+            for (let s = 0; s < allSimResults[y].length; s++) {}
         }
     }

[Timeout] EqualityOperator
services/monteCarloEngine.js:224:29
         const rawMean_y = allSimResults[y].reduce((s, v) => s + v, 0) / allSimResults[y].length;
         if (rawMean_y > 0) {
             const ratio = deterministicFV_y / rawMean_y;
-            for (let s = 0; s < allSimResults[y].length; s++) {
+            for (let s = 0; s <= allSimResults[y].length; s++) {
                 allSimResults[y][s] *= ratio;
             }

[Survived] AssignmentOperator
services/monteCarloEngine.js:225:17
         if (rawMean_y > 0) {
             const ratio = deterministicFV_y / rawMean_y;
             for (let s = 0; s < allSimResults[y].length; s++) {
-                allSimResults[y][s] *= ratio;
+                allSimResults[y][s] /= ratio;
             }
         }

[Killed] ArithmeticOperator
services/monteCarloEngine.js:230:25
         }
     }
     // Update finalValues to contain the corrected terminal values for goal probability
-    const terminalIdx = allSimResults.length - 1;
+    const terminalIdx = allSimResults.length + 1;
     finalValues = [...allSimResults[terminalIdx]];
     const rawMean = finalValues.reduce((s, v) => s + v, 0) / finalValues.length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (151.5373ms)

[Survived] ArithmeticOperator
services/monteCarloEngine.js:232:50
     // Update finalValues to contain the corrected terminal values for goal probability
     const terminalIdx = allSimResults.length - 1;
     finalValues = [...allSimResults[terminalIdx]];
-    const rawMean = finalValues.reduce((s, v) => s + v, 0) / finalValues.length;
+    const rawMean = finalValues.reduce((s, v) => s - v, 0) / finalValues.length;
     const controlCorrection = rawMean - deterministicFV;
     // Sort each year's results ONCE, then extract all percentiles

[Survived] ArrowFunction
services/monteCarloEngine.js:232:40
     // Update finalValues to contain the corrected terminal values for goal probability
     const terminalIdx = allSimResults.length - 1;
     finalValues = [...allSimResults[terminalIdx]];
-    const rawMean = finalValues.reduce((s, v) => s + v, 0) / finalValues.length;
+    const rawMean = finalValues.reduce(() => undefined, 0) / finalValues.length;
     const controlCorrection = rawMean - deterministicFV;
     // Sort each year's results ONCE, then extract all percentiles

[Survived] ArithmeticOperator
services/monteCarloEngine.js:233:31
     const terminalIdx = allSimResults.length - 1;
     finalValues = [...allSimResults[terminalIdx]];
     const rawMean = finalValues.reduce((s, v) => s + v, 0) / finalValues.length;
-    const controlCorrection = rawMean - deterministicFV;
+    const controlCorrection = rawMean + deterministicFV;
     // Sort each year's results ONCE, then extract all percentiles
     const p10 = [], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];

[Killed] ArrayDeclaration
services/monteCarloEngine.js:235:57
     const rawMean = finalValues.reduce((s, v) => s + v, 0) / finalValues.length;
     const controlCorrection = rawMean - deterministicFV;
     // Sort each year's results ONCE, then extract all percentiles
-    const p10 = [], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];
+    const p10 = [], p25 = [], p50 = [], p75 = [], p90 = ["Stryker was here"], mean = [];
     const stdErr = [];
     for (let y = 0; y < allSimResults.length; y++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (362.7297ms)

[Killed] ArrayDeclaration
services/monteCarloEngine.js:235:17
     const rawMean = finalValues.reduce((s, v) => s + v, 0) / finalValues.length;
     const controlCorrection = rawMean - deterministicFV;
     // Sort each year's results ONCE, then extract all percentiles
-    const p10 = [], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];
+    const p10 = ["Stryker was here"], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];
     const stdErr = [];
     for (let y = 0; y < allSimResults.length; y++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (387.485ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:237:21
     // Sort each year's results ONCE, then extract all percentiles
     const p10 = [], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];
     const stdErr = [];
-    for (let y = 0; y < allSimResults.length; y++) {
+    for (let y = 0; false; y++) {
         const sorted = [...allSimResults[y]].sort((a, b) => a - b);
         const yrNom = Math.round(percentile(sorted, 10));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (341.5756ms)
✔ reverseSIP handles zero rate, reachable targets, and

[Killed] EqualityOperator
services/monteCarloEngine.js:237:21
     // Sort each year's results ONCE, then extract all percentiles
     const p10 = [], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];
     const stdErr = [];
-    for (let y = 0; y < allSimResults.length; y++) {
+    for (let y = 0; y >= allSimResults.length; y++) {
         const sorted = [...allSimResults[y]].sort((a, b) => a - b);
         const yrNom = Math.round(percentile(sorted, 10));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (281.6642ms)

[Killed] ArrowFunction
services/monteCarloEngine.js:238:51
     const p10 = [], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];
     const stdErr = [];
     for (let y = 0; y < allSimResults.length; y++) {
-        const sorted = [...allSimResults[y]].sort((a, b) => a - b);
+        const sorted = [...allSimResults[y]].sort(() => undefined);
         const yrNom = Math.round(percentile(sorted, 10));
         const yrP25 = Math.round(percentile(sorted, 25));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (405.1795ms)

[Killed] MethodExpression
services/monteCarloEngine.js:238:24
     const p10 = [], p25 = [], p50 = [], p75 = [], p90 = [], mean = [];
     const stdErr = [];
     for (let y = 0; y < allSimResults.length; y++) {
-        const sorted = [...allSimResults[y]].sort((a, b) => a - b);
+        const sorted = [...allSimResults[y]];
         const yrNom = Math.round(percentile(sorted, 10));
         const yrP25 = Math.round(percentile(sorted, 25));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (356.9445ms)

[Survived] ArithmeticOperator
services/monteCarloEngine.js:244:45
         const yrP50 = Math.round(percentile(sorted, 50));
         const yrP75 = Math.round(percentile(sorted, 75));
         const yrP90 = Math.round(percentile(sorted, 90));
-        const avg = sorted.reduce((s, v) => s + v, 0) / sorted.length;
+        const avg = sorted.reduce((s, v) => s - v, 0) / sorted.length;
         const yrMean = Math.round(avg);
         p10.push(yrNom);

[Survived] ArrowFunction
services/monteCarloEngine.js:244:35
         const yrP50 = Math.round(percentile(sorted, 50));
         const yrP75 = Math.round(percentile(sorted, 75));
         const yrP90 = Math.round(percentile(sorted, 90));
-        const avg = sorted.reduce((s, v) => s + v, 0) / sorted.length;
+        const avg = sorted.reduce(() => undefined, 0) / sorted.length;
         const yrMean = Math.round(avg);
         p10.push(yrNom);

[Survived] ArithmeticOperator
services/monteCarloEngine.js:252:26
         p75.push(yrP75);
         p90.push(yrP90);
         mean.push(yrMean);
-        const variance = sorted.reduce((s, v) => s + (v - avg) ** 2, 0) / (sorted.length - 1);
+        const variance = sorted.reduce((s, v) => s + (v - avg) ** 2, 0) * (sorted.length - 1);
         stdErr.push(Math.round(Math.sqrt(variance / sorted.length)));
     }

[Survived] ArithmeticOperator
services/monteCarloEngine.js:252:55
         p75.push(yrP75);
         p90.push(yrP90);
         mean.push(yrMean);
-        const variance = sorted.reduce((s, v) => s + (v - avg) ** 2, 0) / (sorted.length - 1);
+        const variance = sorted.reduce((s, v) => s + (v + avg) ** 2, 0) / (sorted.length - 1);
         stdErr.push(Math.round(Math.sqrt(variance / sorted.length)));
     }
