[Survived] ArithmeticOperator
services/monteCarloEngine.js:253:42
         p90.push(yrP90);
         mean.push(yrMean);
         const variance = sorted.reduce((s, v) => s + (v - avg) ** 2, 0) / (sorted.length - 1);
-        stdErr.push(Math.round(Math.sqrt(variance / sorted.length)));
+        stdErr.push(Math.round(Math.sqrt(variance * sorted.length)));
     }
     let realTrackResult = null;

[Timeout] ConditionalExpression
services/monteCarloEngine.js:256:9
         stdErr.push(Math.round(Math.sqrt(variance / sorted.length)));
     }
     let realTrackResult = null;
-    if (!isRealTrack) {
+    if (true) {
         const realReturn = (1 + postTaxAnnualReturn) / (1 + inflationRate) - 1;
         realTrackResult = runMonteCarlo({

[Survived] BlockStatement
services/monteCarloEngine.js:256:23
         stdErr.push(Math.round(Math.sqrt(variance / sorted.length)));
     }
     let realTrackResult = null;
-    if (!isRealTrack) {
-        const realReturn = (1 + postTaxAnnualReturn) / (1 + inflationRate) - 1;
-        realTrackResult = runMonteCarlo({
-            monthlyInvestment: safeInvestment,
-            postTaxAnnualReturn: realReturn,
-            annualVolatility: safeVolatility,
-            years,
-            simulations,
-            inflationRate,
-            isRealTrack: true,
-            currentSavings: safeSavings,
-        });
-    }
+    if (!isRealTrack) {}
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];

[Survived] ArithmeticOperator
services/monteCarloEngine.js:257:28
     }
     let realTrackResult = null;
     if (!isRealTrack) {
-        const realReturn = (1 + postTaxAnnualReturn) / (1 + inflationRate) - 1;
+        const realReturn = (1 + postTaxAnnualReturn) / (1 + inflationRate) + 1;
         realTrackResult = runMonteCarlo({
             monthlyInvestment: safeInvestment,

[Survived] ArithmeticOperator
services/monteCarloEngine.js:257:29
     }
     let realTrackResult = null;
     if (!isRealTrack) {
-        const realReturn = (1 + postTaxAnnualReturn) / (1 + inflationRate) - 1;
+        const realReturn = (1 - postTaxAnnualReturn) / (1 + inflationRate) - 1;
         realTrackResult = runMonteCarlo({
             monthlyInvestment: safeInvestment,

[Survived] ObjectLiteral
services/monteCarloEngine.js:258:41
     let realTrackResult = null;
     if (!isRealTrack) {
         const realReturn = (1 + postTaxAnnualReturn) / (1 + inflationRate) - 1;
-        realTrackResult = runMonteCarlo({
-            monthlyInvestment: safeInvestment,
-            postTaxAnnualReturn: realReturn,
-            annualVolatility: safeVolatility,
-            years,
-            simulations,
-            inflationRate,
-            isRealTrack: true,
-            currentSavings: safeSavings,
-        });
+        realTrackResult = runMonteCarlo({});
     }
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];

[Timeout] BooleanLiteral
services/monteCarloEngine.js:265:26
             years,
             simulations,
             inflationRate,
-            isRealTrack: true,
+            isRealTrack: false,
             currentSavings: safeSavings,
         });

[Killed] ConditionalExpression
services/monteCarloEngine.js:269:22
             currentSavings: safeSavings,
         });
     }
-    const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
+    const p10_real = true ? realTrackResult.p10 : [];
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (300.9181ms)

✔ reverseSIP handles zero rate, reachable targets,

[Survived] LogicalOperator
services/monteCarloEngine.js:269:22
             currentSavings: safeSavings,
         });
     }
-    const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
+    const p10_real = !isRealTrack || realTrackResult ? realTrackResult.p10 : [];
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];

[Killed] ConditionalExpression
services/monteCarloEngine.js:270:22
         });
     }
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
-    const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
+    const p25_real = true ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (308.0269ms)

[Survived] ConditionalExpression
services/monteCarloEngine.js:270:22
         });
     }
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
-    const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
+    const p25_real = false ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];

[Killed] ConditionalExpression
services/monteCarloEngine.js:271:22
     }
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
-    const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
+    const p50_real = true ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (317.6945ms)

[Survived] BooleanLiteral
services/monteCarloEngine.js:271:22
     }
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
-    const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
+    const p50_real = isRealTrack && realTrackResult ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];

[Killed] ConditionalExpression
services/monteCarloEngine.js:272:22
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
-    const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
+    const p75_real = true ? realTrackResult.p75 : [];
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
     const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (337.0143ms)

[Survived] LogicalOperator
services/monteCarloEngine.js:272:22
     const p10_real = !isRealTrack && realTrackResult ? realTrackResult.p10 : [];
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
-    const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
+    const p75_real = !isRealTrack || realTrackResult ? realTrackResult.p75 : [];
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
     const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];

[Killed] ConditionalExpression
services/monteCarloEngine.js:273:22
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
-    const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
+    const p90_real = true ? realTrackResult.p90 : [];
     const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (372.2313ms)

[Survived] BooleanLiteral
services/monteCarloEngine.js:273:22
     const p25_real = !isRealTrack && realTrackResult ? realTrackResult.p25 : [];
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
-    const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
+    const p90_real = isRealTrack && realTrackResult ? realTrackResult.p90 : [];
     const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);

[Killed] ConditionalExpression
services/monteCarloEngine.js:274:23
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
-    const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];
+    const mean_real = true ? realTrackResult.mean : [];
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);
     const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (373.8717ms)

[Survived] BooleanLiteral
services/monteCarloEngine.js:274:23
     const p50_real = !isRealTrack && realTrackResult ? realTrackResult.p50 : [];
     const p75_real = !isRealTrack && realTrackResult ? realTrackResult.p75 : [];
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
-    const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];
+    const mean_real = isRealTrack && realTrackResult ? realTrackResult.mean : [];
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);
     const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;

[Survived] ArithmeticOperator
services/monteCarloEngine.js:276:50
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
     const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);
-    const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
+    const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn + RISK_FREE_RATE) / safeVolatility : 0;
     const sharpeSensitivity = {
         minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,

[Survived] ConditionalExpression
services/monteCarloEngine.js:276:24
     const p90_real = !isRealTrack && realTrackResult ? realTrackResult.p90 : [];
     const mean_real = !isRealTrack && realTrackResult ? realTrackResult.mean : [];
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);
-    const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
+    const baseSharpe = false ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
     const sharpeSensitivity = {
         minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,

[Survived] EqualityOperator
services/monteCarloEngine.js:278:21
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);
     const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
     const sharpeSensitivity = {
-        minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,
+        minus_5pct: safeVolatility - 0.05 <= 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,
         minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
         base: baseSharpe,

[Survived] ArithmeticOperator
services/monteCarloEngine.js:278:55
     const sequenceOfReturnsRisk = computeSequenceRisk(finalValues, actualSims, years, 0);
     const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
     const sharpeSensitivity = {
-        minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,
+        minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) * (safeVolatility - 0.05) : 0,
         minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
         base: baseSharpe,

[Survived] ArithmeticOperator
services/monteCarloEngine.js:279:55
     const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
     const sharpeSensitivity = {
         minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,
-        minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
+        minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) * (safeVolatility - 0.02) : 0,
         base: baseSharpe,
         plus_2pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.02),

[Survived] ArithmeticOperator
services/monteCarloEngine.js:279:56
     const baseSharpe = safeVolatility > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / safeVolatility : 0;
     const sharpeSensitivity = {
         minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,
-        minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
+        minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn + RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
         base: baseSharpe,
         plus_2pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.02),

[Survived] ArithmeticOperator
services/monteCarloEngine.js:281:20
         minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,
         minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
         base: baseSharpe,
-        plus_2pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.02),
+        plus_2pct: (postTaxAnnualReturn - RISK_FREE_RATE) * (safeVolatility + 0.02),
         plus_5pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.05),
     };

[Survived] ArithmeticOperator
services/monteCarloEngine.js:281:21
         minus_5pct: (safeVolatility - 0.05) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.05) : 0,
         minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
         base: baseSharpe,
-        plus_2pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.02),
+        plus_2pct: (postTaxAnnualReturn + RISK_FREE_RATE) / (safeVolatility + 0.02),
         plus_5pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.05),
     };

[Survived] ArithmeticOperator
services/monteCarloEngine.js:282:21
         minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
         base: baseSharpe,
         plus_2pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.02),
-        plus_5pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.05),
+        plus_5pct: (postTaxAnnualReturn + RISK_FREE_RATE) / (safeVolatility + 0.05),
     };
     const response = {

[Survived] ArithmeticOperator
services/monteCarloEngine.js:282:20
         minus_2pct: (safeVolatility - 0.02) > 0.001 ? (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility - 0.02) : 0,
         base: baseSharpe,
         plus_2pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.02),
-        plus_5pct: (postTaxAnnualReturn - RISK_FREE_RATE) / (safeVolatility + 0.05),
+        plus_5pct: (postTaxAnnualReturn - RISK_FREE_RATE) * (safeVolatility + 0.05),
     };
     const response = {

[Killed] BlockStatement
services/monteCarloEngine.js:294:23
         finalValues, // expose for goal probability reuse
         simulations_run: actualSims,
     };
-    if (!isRealTrack) {
-        response.real = realTrackResult;
-        response.inflationRateUsed = inflationRate;
-        response.sequenceRisk = sequenceOfReturnsRisk;
-        response.riskMetrics = computeRiskMetrics(p50, p10, years, RISK_FREE_RATE, postTaxAnnualReturn);
-        response.variance_reduction = 'halton_qmc+antithetic+control_variates';
-        response.sequence_of_returns_risk = sequenceOfReturnsRisk;
-        response.sharpe_ratio_sensitivity = sharpeSensitivity;
-        response.inflation_rate = inflationRate;
-    }
+    if (!isRealTrack) {}
     return response;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (371.8626ms)

[Killed] BooleanLiteral
services/monteCarloEngine.js:294:9
         finalValues, // expose for goal probability reuse
         simulations_run: actualSims,
     };
-    if (!isRealTrack) {
+    if (isRealTrack) {
         response.real = realTrackResult;
         response.inflationRateUsed = inflationRate;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (309.5557ms)

[Killed] StringLiteral
services/monteCarloEngine.js:299:39
         response.inflationRateUsed = inflationRate;
         response.sequenceRisk = sequenceOfReturnsRisk;
         response.riskMetrics = computeRiskMetrics(p50, p10, years, RISK_FREE_RATE, postTaxAnnualReturn);
-        response.variance_reduction = 'halton_qmc+antithetic+control_variates';
+        response.variance_reduction = "";
         response.sequence_of_returns_risk = sequenceOfReturnsRisk;
         response.sharpe_ratio_sensitivity = sharpeSensitivity;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.1674ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] BlockStatement
services/monteCarloEngine.js:309:42
 /**
  * Generate an empty result set (for invalid inputs).
  */
-function emptyResult(years, simulations) {
-    const horizon = buildProjectionHorizon(years);
-    const zeros = Array.from({ length: horizon.yearsArray.length }, () => 0);
-    return {
-        years_array: horizon.yearsArray,
-        p10: [...zeros], p25: [...zeros], p50: [...zeros],
-        p75: [...zeros], p90: [...zeros], mean: [...zeros],
-        finalValues: [],
-        simulations_run: simulations || 0,
-    };
-}
+function emptyResult(years, simulations) {}
 /**
  * Compute the probability that a goal amount is reached.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (357.1992ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (1.5002ms)

[Killed] ArrowFunction
services/monteCarloEngine.js:311:69
  */
 function emptyResult(years, simulations) {
     const horizon = buildProjectionHorizon(years);
-    const zeros = Array.from({ length: horizon.yearsArray.length }, () => 0);
+    const zeros = Array.from({ length: horizon.yearsArray.length }, () => undefined);
     return {
         years_array: horizon.yearsArray,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (353.8755ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.8103ms)

[Survived] ArrayDeclaration
services/monteCarloEngine.js:314:14
     const zeros = Array.from({ length: horizon.yearsArray.length }, () => 0);
     return {
         years_array: horizon.yearsArray,
-        p10: [...zeros], p25: [...zeros], p50: [...zeros],
+        p10: [], p25: [...zeros], p50: [...zeros],
         p75: [...zeros], p90: [...zeros], mean: [...zeros],
         finalValues: [],

[Survived] ArrayDeclaration
services/monteCarloEngine.js:315:49
     return {
         years_array: horizon.yearsArray,
         p10: [...zeros], p25: [...zeros], p50: [...zeros],
-        p75: [...zeros], p90: [...zeros], mean: [...zeros],
+        p75: [...zeros], p90: [...zeros], mean: [],
         finalValues: [],
         simulations_run: simulations || 0,

[Survived] LogicalOperator
services/monteCarloEngine.js:317:26
         p10: [...zeros], p25: [...zeros], p50: [...zeros],
         p75: [...zeros], p90: [...zeros], mean: [...zeros],
         finalValues: [],
-        simulations_run: simulations || 0,
+        simulations_run: simulations && 0,
     };
 }

[Survived] ConditionalExpression
services/monteCarloEngine.js:317:26
         p10: [...zeros], p25: [...zeros], p50: [...zeros],
         p75: [...zeros], p90: [...zeros], mean: [...zeros],
         finalValues: [],
-        simulations_run: simulations || 0,
+        simulations_run: false,
     };
 }

[Killed] BlockStatement
services/monteCarloEngine.js:323:70
 /**
  * Compute the probability that a goal amount is reached.
  */
-export function computeGoalProbability(terminalValues, targetAmount) {
-    if (!terminalValues || terminalValues.length === 0 || !targetAmount || targetAmount <= 0)
-        return 0;
-    const successes = terminalValues.filter(v => v >= targetAmount).length;
-    return parseFloat((successes / terminalValues.length).toFixed(4));
-}
+export function computeGoalProbability(terminalValues, targetAmount) {}
 /**
  * Compute the Wilson score confidence interval for a binomial proportion.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (341.5404ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:324:76
  * Compute the probability that a goal amount is reached.
  */
 export function computeGoalProbability(terminalValues, targetAmount) {
-    if (!terminalValues || terminalValues.length === 0 || !targetAmount || targetAmount <= 0)
+    if (!terminalValues || terminalValues.length === 0 || !targetAmount || targetAmount > 0)
         return 0;
     const successes = terminalValues.filter(v => v >= targetAmount).length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (339.2001ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:324:76
  * Compute the probability that a goal amount is reached.
  */
 export function computeGoalProbability(terminalValues, targetAmount) {
-    if (!terminalValues || terminalValues.length === 0 || !targetAmount || targetAmount <= 0)
+    if (!terminalValues || terminalValues.length === 0 || !targetAmount || false)
         return 0;
     const successes = terminalValues.filter(v => v >= targetAmount).length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.7288ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:326:50
 export function computeGoalProbability(terminalValues, targetAmount) {
     if (!terminalValues || terminalValues.length === 0 || !targetAmount || targetAmount <= 0)
         return 0;
-    const successes = terminalValues.filter(v => v >= targetAmount).length;
+    const successes = terminalValues.filter(v => v < targetAmount).length;
     return parseFloat((successes / terminalValues.length).toFixed(4));
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (388.5954ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:326:50
 export function computeGoalProbability(terminalValues, targetAmount) {
     if (!terminalValues || terminalValues.length === 0 || !targetAmount || targetAmount <= 0)
         return 0;
-    const successes = terminalValues.filter(v => v >= targetAmount).length;
+    const successes = terminalValues.filter(v => true).length;
     return parseFloat((successes / terminalValues.length).toFixed(4));
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (295.0894ms)
