[Killed] ArithmeticOperator
services/monteCarloEngine.js:327:24
     if (!terminalValues || terminalValues.length === 0 || !targetAmount || targetAmount <= 0)
         return 0;
     const successes = terminalValues.filter(v => v >= targetAmount).length;
-    return parseFloat((successes / terminalValues.length).toFixed(4));
+    return parseFloat((successes * terminalValues.length).toFixed(4));
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (319.7669ms)

[Killed] BlockStatement
services/monteCarloEngine.js:332:39
 /**
  * Compute the Wilson score confidence interval for a binomial proportion.
  */
-export function computeWilsonCI(p, n) {
-    if (n <= 0 || p === null)
-        return { lower: 0, upper: 0 };
-    const z = 1.95996; // 95% confidence level
-    const pVal = Math.min(Math.max(p, 0), 1);
-    const factor = (z * z) / n;
-    const term1 = pVal + factor / 2;
-    const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
-    const denom = 1 + factor;
-    const lower = (term1 - term2) / denom;
-    const upper = (term1 + term2) / denom;
-    return {
-        lower: parseFloat(Math.max(0, lower).toFixed(4)),
-        upper: parseFloat(Math.min(1, upper).toFixed(4)),
-    };
-}
+export function computeWilsonCI(p, n) {}
 /**
  * Run a full Monte Carlo simulation and also compute goal probability.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (311.5993ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:333:19
  * Compute the Wilson score confidence interval for a binomial proportion.
  */
 export function computeWilsonCI(p, n) {
-    if (n <= 0 || p === null)
+    if (n <= 0 || false)
         return { lower: 0, upper: 0 };
     const z = 1.95996; // 95% confidence level
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (328.1348ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:333:9
  * Compute the Wilson score confidence interval for a binomial proportion.
  */
 export function computeWilsonCI(p, n) {
-    if (n <= 0 || p === null)
+    if (true)
         return { lower: 0, upper: 0 };
     const z = 1.95996; // 95% confidence level
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (318.8015ms)

[Killed] ObjectLiteral
services/monteCarloEngine.js:334:16
  */
 export function computeWilsonCI(p, n) {
     if (n <= 0 || p === null)
-        return { lower: 0, upper: 0 };
+        return {};
     const z = 1.95996; // 95% confidence level
     const pVal = Math.min(Math.max(p, 0), 1);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (294.0765ms)

[Killed] MethodExpression
services/monteCarloEngine.js:336:27
     if (n <= 0 || p === null)
         return { lower: 0, upper: 0 };
     const z = 1.95996; // 95% confidence level
-    const pVal = Math.min(Math.max(p, 0), 1);
+    const pVal = Math.min(Math.min(p, 0), 1);
     const factor = (z * z) / n;
     const term1 = pVal + factor / 2;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (354.2903ms)

[Killed] MethodExpression
services/monteCarloEngine.js:336:18
     if (n <= 0 || p === null)
         return { lower: 0, upper: 0 };
     const z = 1.95996; // 95% confidence level
-    const pVal = Math.min(Math.max(p, 0), 1);
+    const pVal = Math.max(Math.max(p, 0), 1);
     const factor = (z * z) / n;
     const term1 = pVal + factor / 2;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.577ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:337:21
         return { lower: 0, upper: 0 };
     const z = 1.95996; // 95% confidence level
     const pVal = Math.min(Math.max(p, 0), 1);
-    const factor = (z * z) / n;
+    const factor = (z / z) / n;
     const term1 = pVal + factor / 2;
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (295.7563ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:337:20
         return { lower: 0, upper: 0 };
     const z = 1.95996; // 95% confidence level
     const pVal = Math.min(Math.max(p, 0), 1);
-    const factor = (z * z) / n;
+    const factor = z * z * n;
     const term1 = pVal + factor / 2;
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (343.8247ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:338:19
     const z = 1.95996; // 95% confidence level
     const pVal = Math.min(Math.max(p, 0), 1);
     const factor = (z * z) / n;
-    const term1 = pVal + factor / 2;
+    const term1 = pVal - factor / 2;
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
     const denom = 1 + factor;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (321.3121ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:338:26
     const z = 1.95996; // 95% confidence level
     const pVal = Math.min(Math.max(p, 0), 1);
     const factor = (z * z) / n;
-    const term1 = pVal + factor / 2;
+    const term1 = pVal + factor * 2;
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
     const denom = 1 + factor;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (330.508ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:339:54
     const pVal = Math.min(Math.max(p, 0), 1);
     const factor = (z * z) / n;
     const term1 = pVal + factor / 2;
-    const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
+    const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor * 4) / n);
     const denom = 1 + factor;
     const lower = (term1 - term2) / denom;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (313.3934ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:339:33
     const pVal = Math.min(Math.max(p, 0), 1);
     const factor = (z * z) / n;
     const term1 = pVal + factor / 2;
-    const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
+    const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) * n);
     const denom = 1 + factor;
     const lower = (term1 - term2) / denom;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (318.5322ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:340:19
     const factor = (z * z) / n;
     const term1 = pVal + factor / 2;
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
-    const denom = 1 + factor;
+    const denom = 1 - factor;
     const lower = (term1 - term2) / denom;
     const upper = (term1 + term2) / denom;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (330.3834ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:341:20
     const term1 = pVal + factor / 2;
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
     const denom = 1 + factor;
-    const lower = (term1 - term2) / denom;
+    const lower = (term1 + term2) / denom;
     const upper = (term1 + term2) / denom;
     return {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (353.5139ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:341:19
     const term1 = pVal + factor / 2;
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
     const denom = 1 + factor;
-    const lower = (term1 - term2) / denom;
+    const lower = (term1 - term2) * denom;
     const upper = (term1 + term2) / denom;
     return {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (288.2781ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:342:19
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
     const denom = 1 + factor;
     const lower = (term1 - term2) / denom;
-    const upper = (term1 + term2) / denom;
+    const upper = (term1 + term2) * denom;
     return {
         lower: parseFloat(Math.max(0, lower).toFixed(4)),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (327.6959ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:342:20
     const term2 = z * Math.sqrt((pVal * (1 - pVal) + factor / 4) / n);
     const denom = 1 + factor;
     const lower = (term1 - term2) / denom;
-    const upper = (term1 + term2) / denom;
+    const upper = (term1 - term2) / denom;
     return {
         lower: parseFloat(Math.max(0, lower).toFixed(4)),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (335.7995ms)

[Killed] MethodExpression
services/monteCarloEngine.js:344:27
     const lower = (term1 - term2) / denom;
     const upper = (term1 + term2) / denom;
     return {
-        lower: parseFloat(Math.max(0, lower).toFixed(4)),
+        lower: parseFloat(Math.min(0, lower).toFixed(4)),
         upper: parseFloat(Math.min(1, upper).toFixed(4)),
     };
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (339.3062ms)

[Killed] MethodExpression
services/monteCarloEngine.js:345:27
     const upper = (term1 + term2) / denom;
     return {
         lower: parseFloat(Math.max(0, lower).toFixed(4)),
-        upper: parseFloat(Math.min(1, upper).toFixed(4)),
+        upper: parseFloat(Math.max(1, upper).toFixed(4)),
     };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (304.4398ms)

[Killed] BlockStatement
services/monteCarloEngine.js:351:47
 /**
  * Run a full Monte Carlo simulation and also compute goal probability.
  */
-export function runMonteCarloWithGoal(params) {
-    const { targetAmount, ...mcParams } = params;
-    const result = runMonteCarlo(mcParams);
-    // Reuse terminal values from the primary simulation run
-    const goalProbability = targetAmount && result.finalValues
-        ? computeGoalProbability(result.finalValues, targetAmount)
-        : null;
-    const goalProbabilityCI = goalProbability !== null
-        ? computeWilsonCI(goalProbability, result.simulations_run)
-        : null;
-    // Remove raw finalValues from response
-    const { finalValues, ...cleanResult } = result;
-    if (cleanResult.real) {
-        delete cleanResult.real.finalValues;
-    }
-    return {
-        ...cleanResult,
-        goal_probability: goalProbability,
-        goal_probability_ci: goalProbabilityCI,
-        target_amount: targetAmount || null,
-    };
-}
+export function runMonteCarloWithGoal(params) {}
 /**
  * Get default volatility parameters for an instrument type.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (2.1159ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:355:29
     const { targetAmount, ...mcParams } = params;
     const result = runMonteCarlo(mcParams);
     // Reuse terminal values from the primary simulation run
-    const goalProbability = targetAmount && result.finalValues
+    const goalProbability = false
         ? computeGoalProbability(result.finalValues, targetAmount)
         : null;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (356.1399ms)

[Survived] LogicalOperator
services/monteCarloEngine.js:355:29
     const { targetAmount, ...mcParams } = params;
     const result = runMonteCarlo(mcParams);
     // Reuse terminal values from the primary simulation run
-    const goalProbability = targetAmount && result.finalValues
+    const goalProbability = targetAmount || result.finalValues
         ? computeGoalProbability(result.finalValues, targetAmount)
         : null;

[Killed] EqualityOperator
services/monteCarloEngine.js:358:31
     const goalProbability = targetAmount && result.finalValues
         ? computeGoalProbability(result.finalValues, targetAmount)
         : null;
-    const goalProbabilityCI = goalProbability !== null
+    const goalProbabilityCI = goalProbability === null
         ? computeWilsonCI(goalProbability, result.simulations_run)
         : null;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (365.2532ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:358:31
     const goalProbability = targetAmount && result.finalValues
         ? computeGoalProbability(result.finalValues, targetAmount)
         : null;
-    const goalProbabilityCI = goalProbability !== null
+    const goalProbabilityCI = false
         ? computeWilsonCI(goalProbability, result.simulations_run)
         : null;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (318.2964ms)

[Survived] BlockStatement
services/monteCarloEngine.js:363:27
         : null;
     // Remove raw finalValues from response
     const { finalValues, ...cleanResult } = result;
-    if (cleanResult.real) {
-        delete cleanResult.real.finalValues;
-    }
+    if (cleanResult.real) {}
     return {
         ...cleanResult,

[Survived] ConditionalExpression
services/monteCarloEngine.js:363:9
         : null;
     // Remove raw finalValues from response
     const { finalValues, ...cleanResult } = result;
-    if (cleanResult.real) {
+    if (true) {
         delete cleanResult.real.finalValues;
     }

[Killed] ObjectLiteral
services/monteCarloEngine.js:366:12
     if (cleanResult.real) {
         delete cleanResult.real.finalValues;
     }
-    return {
-        ...cleanResult,
-        goal_probability: goalProbability,
-        goal_probability_ci: goalProbabilityCI,
-        target_amount: targetAmount || null,
-    };
+    return {};
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✖ Monte Carlo output has ordered percentiles and bounded goal probability (316.9591ms)

[Survived] LogicalOperator
services/monteCarloEngine.js:370:24
         ...cleanResult,
         goal_probability: goalProbability,
         goal_probability_ci: goalProbabilityCI,
-        target_amount: targetAmount || null,
+        target_amount: targetAmount && null,
     };
 }

[Survived] ConditionalExpression
services/monteCarloEngine.js:370:24
         ...cleanResult,
         goal_probability: goalProbability,
         goal_probability_ci: goalProbabilityCI,
-        target_amount: targetAmount || null,
+        target_amount: true,
     };
 }

[Killed] BlockStatement
services/monteCarloEngine.js:376:71
 /**
  * Get default volatility parameters for an instrument type.
  */
-export function getInstrumentVolatility(instrumentType, overrideMean) {
-    const params = INSTRUMENT_PARAMS[instrumentType];
-    if (!params) {
-        console.warn(`[MC] Unknown instrument type: '${instrumentType}'. Using default params {mean: 0.08, stdDev: 0.05}.`);
-    }
-    const defaults = params || { mean: 0.08, stdDev: 0.05 };
-    return {
-        mean: overrideMean !== undefined ? overrideMean : defaults.mean,
-        stdDev: defaults.stdDev,
-    };
-}
+export function getInstrumentVolatility(instrumentType, overrideMean) {}
 /**
  * Reverse SIP formula — compute monthly SIP required to reach a target.
killedBy: All tests
statusReason: [MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.0775ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.7654ms)

✔ sampleLogNormalMonthly exact GBM formula verification (0.3219ms)

[Survived] ConditionalExpression
services/monteCarloEngine.js:378:9
  */
 export function getInstrumentVolatility(instrumentType, overrideMean) {
     const params = INSTRUMENT_PARAMS[instrumentType];
-    if (!params) {
+    if (true) {
         console.warn(`[MC] Unknown instrument type: '${instrumentType}'. Using default params {mean: 0.08, stdDev: 0.05}.`);
     }

[Survived] BlockStatement
services/monteCarloEngine.js:378:18
  */
 export function getInstrumentVolatility(instrumentType, overrideMean) {
     const params = INSTRUMENT_PARAMS[instrumentType];
-    if (!params) {
-        console.warn(`[MC] Unknown instrument type: '${instrumentType}'. Using default params {mean: 0.08, stdDev: 0.05}.`);
-    }
+    if (!params) {}
     const defaults = params || { mean: 0.08, stdDev: 0.05 };
     return {

[Killed] ConditionalExpression
services/monteCarloEngine.js:381:22
     if (!params) {
         console.warn(`[MC] Unknown instrument type: '${instrumentType}'. Using default params {mean: 0.08, stdDev: 0.05}.`);
     }
-    const defaults = params || { mean: 0.08, stdDev: 0.05 };
+    const defaults = true;
     return {
         mean: overrideMean !== undefined ? overrideMean : defaults.mean,
killedBy: All tests
statusReason: [MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.8373ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.8003ms)

✔ sampleLogNormalMonthly exact GBM formula verification (0.3174ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:381:22
     if (!params) {
         console.warn(`[MC] Unknown instrument type: '${instrumentType}'. Using default params {mean: 0.08, stdDev: 0.05}.`);
     }
-    const defaults = params || { mean: 0.08, stdDev: 0.05 };
+    const defaults = false;
     return {
         mean: overrideMean !== undefined ? overrideMean : defaults.mean,
killedBy: All tests
statusReason: [MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (366.1678ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.735ms)

✔ sampleLogNormalMonthly exact GBM formula verification (0.3952ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:383:15
     }
     const defaults = params || { mean: 0.08, stdDev: 0.05 };
     return {
-        mean: overrideMean !== undefined ? overrideMean : defaults.mean,
+        mean: overrideMean === undefined ? overrideMean : defaults.mean,
         stdDev: defaults.stdDev,
     };
killedBy: All tests
statusReason: [MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (311.3168ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.8357ms)

✔ sampleLogNormalMonthly exact GBM formula verification (0.422ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:383:15
     }
     const defaults = params || { mean: 0.08, stdDev: 0.05 };
     return {
-        mean: overrideMean !== undefined ? overrideMean : defaults.mean,
+        mean: false ? overrideMean : defaults.mean,
         stdDev: defaults.stdDev,
     };
killedBy: All tests
statusReason: [MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (303.9484ms)

✔ reverseSIP handles zero rate, reachable targets, and invalid inputs (0.6842ms)

✔ sampleLogNormalMonthly exact GBM formula verification (0.3338ms)

[Killed] BlockStatement
services/monteCarloEngine.js:390:81
 /**
  * Reverse SIP formula — compute monthly SIP required to reach a target.
  */
-export function reverseSIP(targetAmount, annualRate, years, currentSavings = 0) {
-    if (!Number.isFinite(targetAmount) || targetAmount <= 0)
-        return 0;
-    if (!Number.isFinite(years) || years <= 0)
-        return 0;
-    if (!Number.isFinite(annualRate) || annualRate < 0)
-        annualRate = 0;
-    if (!Number.isFinite(currentSavings) || currentSavings < 0)
-        currentSavings = 0;
-    const r = toMonthlyRate(annualRate, true);
-    const n = years * 12;
-    const fvCurrent = currentSavings > 0
-        ? currentSavings * Math.pow(1 + r, n)
-        : 0;
-    const remaining = Math.max(0, targetAmount - fvCurrent);
-    if (remaining === 0)
-        return 0;
-    if (r === 0)
-        return remaining / n;
-    return remaining * r / ((Math.pow(1 + r, n) - 1) * (1 + r));
-}
+export function reverseSIP(targetAmount, annualRate, years, currentSavings = 0) {}
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (331.4851ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:391:43
  * Reverse SIP formula — compute monthly SIP required to reach a target.
  */
 export function reverseSIP(targetAmount, annualRate, years, currentSavings = 0) {
-    if (!Number.isFinite(targetAmount) || targetAmount <= 0)
+    if (!Number.isFinite(targetAmount) || targetAmount > 0)
         return 0;
     if (!Number.isFinite(years) || years <= 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (379.0424ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:391:9
  * Reverse SIP formula — compute monthly SIP required to reach a target.
  */
 export function reverseSIP(targetAmount, annualRate, years, currentSavings = 0) {
-    if (!Number.isFinite(targetAmount) || targetAmount <= 0)
+    if (false)
         return 0;
     if (!Number.isFinite(years) || years <= 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.2347ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:393:36
 export function reverseSIP(targetAmount, annualRate, years, currentSavings = 0) {
     if (!Number.isFinite(targetAmount) || targetAmount <= 0)
         return 0;
-    if (!Number.isFinite(years) || years <= 0)
+    if (!Number.isFinite(years) || years > 0)
         return 0;
     if (!Number.isFinite(annualRate) || annualRate < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.1022ms)
