[Killed] BooleanLiteral
services/monteCarloEngine.js:393:9
 export function reverseSIP(targetAmount, annualRate, years, currentSavings = 0) {
     if (!Number.isFinite(targetAmount) || targetAmount <= 0)
         return 0;
-    if (!Number.isFinite(years) || years <= 0)
+    if (Number.isFinite(years) || years <= 0)
         return 0;
     if (!Number.isFinite(annualRate) || annualRate < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (348.074ms)

[Killed] BooleanLiteral
services/monteCarloEngine.js:395:9
         return 0;
     if (!Number.isFinite(years) || years <= 0)
         return 0;
-    if (!Number.isFinite(annualRate) || annualRate < 0)
+    if (Number.isFinite(annualRate) || annualRate < 0)
         annualRate = 0;
     if (!Number.isFinite(currentSavings) || currentSavings < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (314.6639ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ConditionalExpression
services/monteCarloEngine.js:395:9
         return 0;
     if (!Number.isFinite(years) || years <= 0)
         return 0;
-    if (!Number.isFinite(annualRate) || annualRate < 0)
+    if (true)
         annualRate = 0;
     if (!Number.isFinite(currentSavings) || currentSavings < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.6167ms)

[Killed] BooleanLiteral
services/monteCarloEngine.js:397:9
         return 0;
     if (!Number.isFinite(annualRate) || annualRate < 0)
         annualRate = 0;
-    if (!Number.isFinite(currentSavings) || currentSavings < 0)
+    if (Number.isFinite(currentSavings) || currentSavings < 0)
         currentSavings = 0;
     const r = toMonthlyRate(annualRate, true);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.2734ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:397:9
         return 0;
     if (!Number.isFinite(annualRate) || annualRate < 0)
         annualRate = 0;
-    if (!Number.isFinite(currentSavings) || currentSavings < 0)
+    if (true)
         currentSavings = 0;
     const r = toMonthlyRate(annualRate, true);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (321.8227ms)

[Killed] BooleanLiteral
services/monteCarloEngine.js:399:41
         annualRate = 0;
     if (!Number.isFinite(currentSavings) || currentSavings < 0)
         currentSavings = 0;
-    const r = toMonthlyRate(annualRate, true);
+    const r = toMonthlyRate(annualRate, false);
     const n = years * 12;
     const fvCurrent = currentSavings > 0
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (367.8237ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:400:15
     if (!Number.isFinite(currentSavings) || currentSavings < 0)
         currentSavings = 0;
     const r = toMonthlyRate(annualRate, true);
-    const n = years * 12;
+    const n = years / 12;
     const fvCurrent = currentSavings > 0
         ? currentSavings * Math.pow(1 + r, n)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (354.9781ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:401:23
         currentSavings = 0;
     const r = toMonthlyRate(annualRate, true);
     const n = years * 12;
-    const fvCurrent = currentSavings > 0
+    const fvCurrent = false
         ? currentSavings * Math.pow(1 + r, n)
         : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (336.6913ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:401:23
         currentSavings = 0;
     const r = toMonthlyRate(annualRate, true);
     const n = years * 12;
-    const fvCurrent = currentSavings > 0
+    const fvCurrent = currentSavings <= 0
         ? currentSavings * Math.pow(1 + r, n)
         : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (331.0103ms)

[Survived] ArithmeticOperator
services/monteCarloEngine.js:402:11
     const r = toMonthlyRate(annualRate, true);
     const n = years * 12;
     const fvCurrent = currentSavings > 0
-        ? currentSavings * Math.pow(1 + r, n)
+        ? currentSavings / Math.pow(1 + r, n)
         : 0;
     const remaining = Math.max(0, targetAmount - fvCurrent);

[Survived] ArithmeticOperator
services/monteCarloEngine.js:402:37
     const r = toMonthlyRate(annualRate, true);
     const n = years * 12;
     const fvCurrent = currentSavings > 0
-        ? currentSavings * Math.pow(1 + r, n)
+        ? currentSavings * Math.pow(1 - r, n)
         : 0;
     const remaining = Math.max(0, targetAmount - fvCurrent);

[Killed] MethodExpression
services/monteCarloEngine.js:404:23
     const fvCurrent = currentSavings > 0
         ? currentSavings * Math.pow(1 + r, n)
         : 0;
-    const remaining = Math.max(0, targetAmount - fvCurrent);
+    const remaining = Math.min(0, targetAmount - fvCurrent);
     if (remaining === 0)
         return 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (326.8677ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:404:35
     const fvCurrent = currentSavings > 0
         ? currentSavings * Math.pow(1 + r, n)
         : 0;
-    const remaining = Math.max(0, targetAmount - fvCurrent);
+    const remaining = Math.max(0, targetAmount + fvCurrent);
     if (remaining === 0)
         return 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (324.4968ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:405:9
         ? currentSavings * Math.pow(1 + r, n)
         : 0;
     const remaining = Math.max(0, targetAmount - fvCurrent);
-    if (remaining === 0)
+    if (true)
         return 0;
     if (r === 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.6635ms)

[Killed] EqualityOperator
services/monteCarloEngine.js:405:9
         ? currentSavings * Math.pow(1 + r, n)
         : 0;
     const remaining = Math.max(0, targetAmount - fvCurrent);
-    if (remaining === 0)
+    if (remaining !== 0)
         return 0;
     if (r === 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (362.7052ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:407:9
     const remaining = Math.max(0, targetAmount - fvCurrent);
     if (remaining === 0)
         return 0;
-    if (r === 0)
+    if (true)
         return remaining / n;
     return remaining * r / ((Math.pow(1 + r, n) - 1) * (1 + r));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.2194ms)

[Killed] ConditionalExpression
services/monteCarloEngine.js:407:9
     const remaining = Math.max(0, targetAmount - fvCurrent);
     if (remaining === 0)
         return 0;
-    if (r === 0)
+    if (false)
         return remaining / n;
     return remaining * r / ((Math.pow(1 + r, n) - 1) * (1 + r));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.9581ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:408:16
     if (remaining === 0)
         return 0;
     if (r === 0)
-        return remaining / n;
+        return remaining * n;
     return remaining * r / ((Math.pow(1 + r, n) - 1) * (1 + r));
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (340.3847ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:409:12
         return 0;
     if (r === 0)
         return remaining / n;
-    return remaining * r / ((Math.pow(1 + r, n) - 1) * (1 + r));
+    return remaining / r / ((Math.pow(1 + r, n) - 1) * (1 + r));
 }
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (355.0139ms)

[Killed] ArithmeticOperator
services/monteCarloEngine.js:409:30
         return 0;
     if (r === 0)
         return remaining / n;
-    return remaining * r / ((Math.pow(1 + r, n) - 1) * (1 + r));
+    return remaining * r / ((Math.pow(1 + r, n) + 1) * (1 + r));
 }
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (355.87ms)
