[Killed] ArrayDeclaration
services/portfolioEngine.js:7:20
  */
 import { INSTRUMENT_PARAMS as CENTRAL_PARAMS, RISK_FREE_RATE } from './instrumentConstants.js';
 const INSTRUMENT_PARAMS = CENTRAL_PARAMS;
-const ASSET_KEYS = [
-    'Equity_MF', 'ELSS', 'ETF', 'Debt_MF', 'FD', 'Gold', 'NPS', 'PPF',
-    'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', 'Arbitrage_MF', 'Hybrid_MF',
-    'Index_MF', 'Midcap_MF', 'Smallcap_MF',
-];
+const ASSET_KEYS = [];
 // lower triangular values
 const CORR_LOWER = [
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (333.0259ms)
✔ reverseSIP handles zero rate, reachable targets,

[Survived] StringLiteral
services/portfolioEngine.js:8:18
 import { INSTRUMENT_PARAMS as CENTRAL_PARAMS, RISK_FREE_RATE } from './instrumentConstants.js';
 const INSTRUMENT_PARAMS = CENTRAL_PARAMS;
 const ASSET_KEYS = [
-    'Equity_MF', 'ELSS', 'ETF', 'Debt_MF', 'FD', 'Gold', 'NPS', 'PPF',
+    'Equity_MF', "", 'ETF', 'Debt_MF', 'FD', 'Gold', 'NPS', 'PPF',
     'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', 'Arbitrage_MF', 'Hybrid_MF',
     'Index_MF', 'Midcap_MF', 'Smallcap_MF',

[Survived] StringLiteral
services/portfolioEngine.js:8:44
 import { INSTRUMENT_PARAMS as CENTRAL_PARAMS, RISK_FREE_RATE } from './instrumentConstants.js';
 const INSTRUMENT_PARAMS = CENTRAL_PARAMS;
 const ASSET_KEYS = [
-    'Equity_MF', 'ELSS', 'ETF', 'Debt_MF', 'FD', 'Gold', 'NPS', 'PPF',
+    'Equity_MF', 'ELSS', 'ETF', 'Debt_MF', "", 'Gold', 'NPS', 'PPF',
     'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', 'Arbitrage_MF', 'Hybrid_MF',
     'Index_MF', 'Midcap_MF', 'Smallcap_MF',

[Survived] StringLiteral
services/portfolioEngine.js:9:62
 const INSTRUMENT_PARAMS = CENTRAL_PARAMS;
 const ASSET_KEYS = [
     'Equity_MF', 'ELSS', 'ETF', 'Debt_MF', 'FD', 'Gold', 'NPS', 'PPF',
-    'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', 'Arbitrage_MF', 'Hybrid_MF',
+    'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', 'Arbitrage_MF', "",
     'Index_MF', 'Midcap_MF', 'Smallcap_MF',
 ];

[Survived] StringLiteral
services/portfolioEngine.js:9:46
 const INSTRUMENT_PARAMS = CENTRAL_PARAMS;
 const ASSET_KEYS = [
     'Equity_MF', 'ELSS', 'ETF', 'Debt_MF', 'FD', 'Gold', 'NPS', 'PPF',
-    'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', 'Arbitrage_MF', 'Hybrid_MF',
+    'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', "", 'Hybrid_MF',
     'Index_MF', 'Midcap_MF', 'Smallcap_MF',
 ];

[Survived] StringLiteral
services/portfolioEngine.js:10:5
 const ASSET_KEYS = [
     'Equity_MF', 'ELSS', 'ETF', 'Debt_MF', 'FD', 'Gold', 'NPS', 'PPF',
     'RBI_Bond', 'G-Sec', 'SGB', 'Liquid_MF', 'Arbitrage_MF', 'Hybrid_MF',
-    'Index_MF', 'Midcap_MF', 'Smallcap_MF',
+    "", 'Midcap_MF', 'Smallcap_MF',
 ];
 // lower triangular values

[Killed] ArrayDeclaration
services/portfolioEngine.js:14:23
 ];
 // lower triangular values
 const CORR_LOWER = [
-    /* Equity_MF   */ [1.00],
+    /* Equity_MF   */ [],
     /* ELSS        */ [0.93, 1.00],
     /* ETF         */ [0.95, 0.91, 1.00],
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (360.5878ms)

[Survived] ArrayDeclaration
services/portfolioEngine.js:15:23
 // lower triangular values
 const CORR_LOWER = [
     /* Equity_MF   */ [1.00],
-    /* ELSS        */ [0.93, 1.00],
+    /* ELSS        */ [],
     /* ETF         */ [0.95, 0.91, 1.00],
     /* Debt_MF     */ [0.12, 0.11, 0.13, 1.00],

[Survived] ArrayDeclaration
services/portfolioEngine.js:16:23
 const CORR_LOWER = [
     /* Equity_MF   */ [1.00],
     /* ELSS        */ [0.93, 1.00],
-    /* ETF         */ [0.95, 0.91, 1.00],
+    /* ETF         */ [],
     /* Debt_MF     */ [0.12, 0.11, 0.13, 1.00],
     /* FD          */ [0.05, 0.05, 0.06, 0.80, 1.00],

[Survived] ArrayDeclaration
services/portfolioEngine.js:20:23
     /* Debt_MF     */ [0.12, 0.11, 0.13, 1.00],
     /* FD          */ [0.05, 0.05, 0.06, 0.80, 1.00],
     /* Gold        */ [0.08, 0.07, 0.09, 0.18, 0.10, 1.00],
-    /* NPS         */ [0.82, 0.80, 0.83, 0.30, 0.15, 0.12, 1.00],
+    /* NPS         */ [],
     /* PPF         */ [0.04, 0.04, 0.05, 0.75, 0.88, 0.08, 0.14, 1.00],
     /* RBI_Bond    */ [0.06, 0.06, 0.07, 0.82, 0.90, 0.12, 0.16, 0.85, 1.00],

[Survived] ArrayDeclaration
services/portfolioEngine.js:23:23
     /* NPS         */ [0.82, 0.80, 0.83, 0.30, 0.15, 0.12, 1.00],
     /* PPF         */ [0.04, 0.04, 0.05, 0.75, 0.88, 0.08, 0.14, 1.00],
     /* RBI_Bond    */ [0.06, 0.06, 0.07, 0.82, 0.90, 0.12, 0.16, 0.85, 1.00],
-    /* G-Sec       */ [0.10, 0.09, 0.11, 0.85, 0.78, 0.15, 0.20, 0.80, 0.88, 1.00],
+    /* G-Sec       */ [],
     /* SGB         */ [0.10, 0.09, 0.11, 0.20, 0.12, 0.97, 0.14, 0.10, 0.14, 0.18, 1.00],
     /* Liquid_MF   */ [0.03, 0.03, 0.04, 0.72, 0.85, 0.08, 0.10, 0.82, 0.84, 0.70, 0.09, 1.00],

[Survived] ArrayDeclaration
services/portfolioEngine.js:24:23
     /* PPF         */ [0.04, 0.04, 0.05, 0.75, 0.88, 0.08, 0.14, 1.00],
     /* RBI_Bond    */ [0.06, 0.06, 0.07, 0.82, 0.90, 0.12, 0.16, 0.85, 1.00],
     /* G-Sec       */ [0.10, 0.09, 0.11, 0.85, 0.78, 0.15, 0.20, 0.80, 0.88, 1.00],
-    /* SGB         */ [0.10, 0.09, 0.11, 0.20, 0.12, 0.97, 0.14, 0.10, 0.14, 0.18, 1.00],
+    /* SGB         */ [],
     /* Liquid_MF   */ [0.03, 0.03, 0.04, 0.72, 0.85, 0.08, 0.10, 0.82, 0.84, 0.70, 0.09, 1.00],
     /* Arbitrage_MF*/ [0.15, 0.14, 0.16, 0.55, 0.45, 0.10, 0.18, 0.40, 0.42, 0.50, 0.12, 0.48, 1.00],

[Survived] ArrayDeclaration
services/portfolioEngine.js:25:23
     /* RBI_Bond    */ [0.06, 0.06, 0.07, 0.82, 0.90, 0.12, 0.16, 0.85, 1.00],
     /* G-Sec       */ [0.10, 0.09, 0.11, 0.85, 0.78, 0.15, 0.20, 0.80, 0.88, 1.00],
     /* SGB         */ [0.10, 0.09, 0.11, 0.20, 0.12, 0.97, 0.14, 0.10, 0.14, 0.18, 1.00],
-    /* Liquid_MF   */ [0.03, 0.03, 0.04, 0.72, 0.85, 0.08, 0.10, 0.82, 0.84, 0.70, 0.09, 1.00],
+    /* Liquid_MF   */ [],
     /* Arbitrage_MF*/ [0.15, 0.14, 0.16, 0.55, 0.45, 0.10, 0.18, 0.40, 0.42, 0.50, 0.12, 0.48, 1.00],
     /* Hybrid_MF   */ [0.78, 0.76, 0.79, 0.35, 0.18, 0.15, 0.72, 0.16, 0.18, 0.25, 0.17, 0.12, 0.28, 1.00],

[Survived] ArrayDeclaration
services/portfolioEngine.js:27:23
     /* SGB         */ [0.10, 0.09, 0.11, 0.20, 0.12, 0.97, 0.14, 0.10, 0.14, 0.18, 1.00],
     /* Liquid_MF   */ [0.03, 0.03, 0.04, 0.72, 0.85, 0.08, 0.10, 0.82, 0.84, 0.70, 0.09, 1.00],
     /* Arbitrage_MF*/ [0.15, 0.14, 0.16, 0.55, 0.45, 0.10, 0.18, 0.40, 0.42, 0.50, 0.12, 0.48, 1.00],
-    /* Hybrid_MF   */ [0.78, 0.76, 0.79, 0.35, 0.18, 0.15, 0.72, 0.16, 0.18, 0.25, 0.17, 0.12, 0.28, 1.00],
+    /* Hybrid_MF   */ [],
     /* Index_MF    */ [0.95, 0.90, 0.98, 0.13, 0.06, 0.09, 0.83, 0.05, 0.07, 0.11, 0.11, 0.04, 0.16, 0.79, 1.00],
     /* Midcap_MF   */ [0.88, 0.86, 0.85, 0.10, 0.04, 0.06, 0.78, 0.03, 0.05, 0.08, 0.08, 0.02, 0.12, 0.74, 0.86, 1.00],

[Survived] ArrayDeclaration
services/portfolioEngine.js:30:23
     /* Hybrid_MF   */ [0.78, 0.76, 0.79, 0.35, 0.18, 0.15, 0.72, 0.16, 0.18, 0.25, 0.17, 0.12, 0.28, 1.00],
     /* Index_MF    */ [0.95, 0.90, 0.98, 0.13, 0.06, 0.09, 0.83, 0.05, 0.07, 0.11, 0.11, 0.04, 0.16, 0.79, 1.00],
     /* Midcap_MF   */ [0.88, 0.86, 0.85, 0.10, 0.04, 0.06, 0.78, 0.03, 0.05, 0.08, 0.08, 0.02, 0.12, 0.74, 0.86, 1.00],
-    /* Smallcap_MF */ [0.82, 0.80, 0.78, 0.08, 0.03, 0.05, 0.72, 0.02, 0.04, 0.06, 0.06, 0.01, 0.10, 0.68, 0.80, 0.92, 1.00],
+    /* Smallcap_MF */ [],
 ];
 function buildFullCorrelation() {

[Killed] BlockStatement
services/portfolioEngine.js:32:33
     /* Midcap_MF   */ [0.88, 0.86, 0.85, 0.10, 0.04, 0.06, 0.78, 0.03, 0.05, 0.08, 0.08, 0.02, 0.12, 0.74, 0.86, 1.00],
     /* Smallcap_MF */ [0.82, 0.80, 0.78, 0.08, 0.03, 0.05, 0.72, 0.02, 0.04, 0.06, 0.06, 0.01, 0.10, 0.68, 0.80, 0.92, 1.00],
 ];
-function buildFullCorrelation() {
-    const n = ASSET_KEYS.length;
-    const C = Array.from({ length: n }, () => new Float64Array(n));
-    for (let i = 0; i < n; i++) {
-        for (let j = 0; j <= i; j++) {
-            const val = CORR_LOWER[i][j];
-            C[i][j] = val;
-            C[j][i] = val;
-        }
-    }
-    return C;
-}
+function buildFullCorrelation() {}
 function checkCholeskyPSD(matrix) {
     const n = matrix.length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (332.686ms)

[Killed] ArrowFunction
services/portfolioEngine.js:34:41
 ];
 function buildFullCorrelation() {
     const n = ASSET_KEYS.length;
-    const C = Array.from({ length: n }, () => new Float64Array(n));
+    const C = Array.from({ length: n }, () => undefined);
     for (let i = 0; i < n; i++) {
         for (let j = 0; j <= i; j++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (296.9838ms)

[Killed] ObjectLiteral
services/portfolioEngine.js:34:26
 ];
 function buildFullCorrelation() {
     const n = ASSET_KEYS.length;
-    const C = Array.from({ length: n }, () => new Float64Array(n));
+    const C = Array.from({}, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
         for (let j = 0; j <= i; j++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (372.177ms)

[Killed] EqualityOperator
services/portfolioEngine.js:35:21
 function buildFullCorrelation() {
     const n = ASSET_KEYS.length;
     const C = Array.from({ length: n }, () => new Float64Array(n));
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i >= n; i++) {
         for (let j = 0; j <= i; j++) {
             const val = CORR_LOWER[i][j];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (355.3563ms)

[Killed] BlockStatement
services/portfolioEngine.js:35:33
 function buildFullCorrelation() {
     const n = ASSET_KEYS.length;
     const C = Array.from({ length: n }, () => new Float64Array(n));
-    for (let i = 0; i < n; i++) {
-        for (let j = 0; j <= i; j++) {
-            const val = CORR_LOWER[i][j];
-            C[i][j] = val;
-            C[j][i] = val;
-        }
-    }
+    for (let i = 0; i < n; i++) {}
     return C;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (326.09ms)

[Killed] UpdateOperator
services/portfolioEngine.js:36:33
     const n = ASSET_KEYS.length;
     const C = Array.from({ length: n }, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
-        for (let j = 0; j <= i; j++) {
+        for (let j = 0; j <= i; j--) {
             const val = CORR_LOWER[i][j];
             C[i][j] = val;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (254.7428ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] EqualityOperator
services/portfolioEngine.js:36:25
     const n = ASSET_KEYS.length;
     const C = Array.from({ length: n }, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
-        for (let j = 0; j <= i; j++) {
+        for (let j = 0; j < i; j++) {
             const val = CORR_LOWER[i][j];
             C[i][j] = val;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.1046ms)

[Killed] ArrowFunction
services/portfolioEngine.js:46:41
 }
 function checkCholeskyPSD(matrix) {
     const n = matrix.length;
-    const L = Array.from({ length: n }, () => new Float64Array(n));
+    const L = Array.from({ length: n }, () => undefined);
     for (let i = 0; i < n; i++) {
         for (let j = 0; j <= i; j++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (259.9389ms)

[Killed] ObjectLiteral
services/portfolioEngine.js:46:26
 }
 function checkCholeskyPSD(matrix) {
     const n = matrix.length;
-    const L = Array.from({ length: n }, () => new Float64Array(n));
+    const L = Array.from({}, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
         for (let j = 0; j <= i; j++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (276.782ms)

[Killed] EqualityOperator
services/portfolioEngine.js:47:21
 function checkCholeskyPSD(matrix) {
     const n = matrix.length;
     const L = Array.from({ length: n }, () => new Float64Array(n));
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         for (let j = 0; j <= i; j++) {
             let sum = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.8984ms)

[Survived] ConditionalExpression
services/portfolioEngine.js:47:21
 function checkCholeskyPSD(matrix) {
     const n = matrix.length;
     const L = Array.from({ length: n }, () => new Float64Array(n));
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; false; i++) {
         for (let j = 0; j <= i; j++) {
             let sum = 0;

[Survived] BlockStatement
services/portfolioEngine.js:48:38
     const n = matrix.length;
     const L = Array.from({ length: n }, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
-        for (let j = 0; j <= i; j++) {
-            let sum = 0;
-            for (let k = 0; k < j; k++) {
-                sum += L[i][k] * L[j][k];
-            }
-            if (i === j) {
-                const val = matrix[i][i] - sum;
-                if (val < -1e-9)
-                    return false;
-                L[i][j] = Math.sqrt(Math.max(0, val));
-            }
-            else {
-                if (L[j][j] > 1e-12) {
-                    L[i][j] = (matrix[i][j] - sum) / L[j][j];
-                }
-                else {
-                    L[i][j] = 0;
-                }
-            }
-        }
+        for (let j = 0; j <= i; j++) {}
     }
     return true;

[Timeout] EqualityOperator
services/portfolioEngine.js:50:29
     for (let i = 0; i < n; i++) {
         for (let j = 0; j <= i; j++) {
             let sum = 0;
-            for (let k = 0; k < j; k++) {
+            for (let k = 0; k >= j; k++) {
                 sum += L[i][k] * L[j][k];
             }

[Timeout] UpdateOperator
services/portfolioEngine.js:50:36
     for (let i = 0; i < n; i++) {
         for (let j = 0; j <= i; j++) {
             let sum = 0;
-            for (let k = 0; k < j; k++) {
+            for (let k = 0; k < j; k--) {
                 sum += L[i][k] * L[j][k];
             }

[Survived] AssignmentOperator
services/portfolioEngine.js:51:17
         for (let j = 0; j <= i; j++) {
             let sum = 0;
             for (let k = 0; k < j; k++) {
-                sum += L[i][k] * L[j][k];
+                sum -= L[i][k] * L[j][k];
             }
             if (i === j) {

[Survived] ArithmeticOperator
services/portfolioEngine.js:51:24
         for (let j = 0; j <= i; j++) {
             let sum = 0;
             for (let k = 0; k < j; k++) {
-                sum += L[i][k] * L[j][k];
+                sum += L[i][k] / L[j][k];
             }
             if (i === j) {

[Survived] ConditionalExpression
services/portfolioEngine.js:53:17
             for (let k = 0; k < j; k++) {
                 sum += L[i][k] * L[j][k];
             }
-            if (i === j) {
+            if (false) {
                 const val = matrix[i][i] - sum;
                 if (val < -1e-9)

[Survived] EqualityOperator
services/portfolioEngine.js:53:17
             for (let k = 0; k < j; k++) {
                 sum += L[i][k] * L[j][k];
             }
-            if (i === j) {
+            if (i !== j) {
                 const val = matrix[i][i] - sum;
                 if (val < -1e-9)

[Survived] ArithmeticOperator
services/portfolioEngine.js:54:29
                 sum += L[i][k] * L[j][k];
             }
             if (i === j) {
-                const val = matrix[i][i] - sum;
+                const val = matrix[i][i] + sum;
                 if (val < -1e-9)
                     return false;

[Timeout] EqualityOperator
services/portfolioEngine.js:55:21
             }
             if (i === j) {
                 const val = matrix[i][i] - sum;
-                if (val < -1e-9)
+                if (val >= -1e-9)
                     return false;
                 L[i][j] = Math.sqrt(Math.max(0, val));

[Survived] EqualityOperator
services/portfolioEngine.js:55:21
             }
             if (i === j) {
                 const val = matrix[i][i] - sum;
-                if (val < -1e-9)
+                if (val <= -1e-9)
                     return false;
                 L[i][j] = Math.sqrt(Math.max(0, val));

[Timeout] BooleanLiteral
services/portfolioEngine.js:56:28
             if (i === j) {
                 const val = matrix[i][i] - sum;
                 if (val < -1e-9)
-                    return false;
+                    return true;
                 L[i][j] = Math.sqrt(Math.max(0, val));
             }

[Timeout] MethodExpression
services/portfolioEngine.js:57:37
                 const val = matrix[i][i] - sum;
                 if (val < -1e-9)
                     return false;
-                L[i][j] = Math.sqrt(Math.max(0, val));
+                L[i][j] = Math.sqrt(Math.min(0, val));
             }
             else {

[Survived] BlockStatement
services/portfolioEngine.js:59:18
                     return false;
                 L[i][j] = Math.sqrt(Math.max(0, val));
             }
-            else {
-                if (L[j][j] > 1e-12) {
-                    L[i][j] = (matrix[i][j] - sum) / L[j][j];
-                }
-                else {
-                    L[i][j] = 0;
-                }
-            }
+            else {}
         }
     }

[Survived] EqualityOperator
services/portfolioEngine.js:60:21
                 L[i][j] = Math.sqrt(Math.max(0, val));
             }
             else {
-                if (L[j][j] > 1e-12) {
+                if (L[j][j] >= 1e-12) {
                     L[i][j] = (matrix[i][j] - sum) / L[j][j];
                 }

[Survived] ConditionalExpression
services/portfolioEngine.js:60:21
                 L[i][j] = Math.sqrt(Math.max(0, val));
             }
             else {
-                if (L[j][j] > 1e-12) {
+                if (true) {
                     L[i][j] = (matrix[i][j] - sum) / L[j][j];
                 }

[Survived] ArithmeticOperator
services/portfolioEngine.js:61:31
             }
             else {
                 if (L[j][j] > 1e-12) {
-                    L[i][j] = (matrix[i][j] - sum) / L[j][j];
+                    L[i][j] = (matrix[i][j] - sum) * L[j][j];
                 }
                 else {

[Survived] ArithmeticOperator
services/portfolioEngine.js:61:32
             }
             else {
                 if (L[j][j] > 1e-12) {
-                    L[i][j] = (matrix[i][j] - sum) / L[j][j];
+                    L[i][j] = (matrix[i][j] + sum) / L[j][j];
                 }
                 else {

[Survived] BlockStatement
services/portfolioEngine.js:63:22
                 if (L[j][j] > 1e-12) {
                     L[i][j] = (matrix[i][j] - sum) / L[j][j];
                 }
-                else {
-                    L[i][j] = 0;
-                }
+                else {}
             }
         }

[Survived] BooleanLiteral
services/portfolioEngine.js:72:5
     return true;
 }
 const FULL_CORR = buildFullCorrelation();
-if (!checkCholeskyPSD(FULL_CORR)) {
+if (checkCholeskyPSD(FULL_CORR)) {
     console.warn('[portfolioEngine] Warning: Master correlation matrix is not Positive Semi-Definite (PSD)!');
 }

[Survived] ConditionalExpression
services/portfolioEngine.js:72:5
     return true;
 }
 const FULL_CORR = buildFullCorrelation();
-if (!checkCholeskyPSD(FULL_CORR)) {
+if (true) {
     console.warn('[portfolioEngine] Warning: Master correlation matrix is not Positive Semi-Definite (PSD)!');
 }

[Killed] BlockStatement
services/portfolioEngine.js:75:23
 if (!checkCholeskyPSD(FULL_CORR)) {
     console.warn('[portfolioEngine] Warning: Master correlation matrix is not Positive Semi-Definite (PSD)!');
 }
-function matvec(A, x) {
-    const n = x.length;
-    const y = new Float64Array(n);
-    for (let i = 0; i < n; i++) {
-        let s = 0;
-        for (let j = 0; j < n; j++)
-            s += A[i][j] * x[j];
-        y[i] = s;
-    }
-    return y;
-}
+function matvec(A, x) {}
 function dot(a, b) {
     let s = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (230.592ms)

[Killed] UpdateOperator
services/portfolioEngine.js:78:28
 function matvec(A, x) {
     const n = x.length;
     const y = new Float64Array(n);
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i < n; i--) {
         let s = 0;
         for (let j = 0; j < n; j++)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (222.9896ms)

[Killed] BlockStatement
services/portfolioEngine.js:78:33
 function matvec(A, x) {
     const n = x.length;
     const y = new Float64Array(n);
-    for (let i = 0; i < n; i++) {
-        let s = 0;
-        for (let j = 0; j < n; j++)
-            s += A[i][j] * x[j];
-        y[i] = s;
-    }
+    for (let i = 0; i < n; i++) {}
     return y;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (289.4895ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:80:25
     const y = new Float64Array(n);
     for (let i = 0; i < n; i++) {
         let s = 0;
-        for (let j = 0; j < n; j++)
+        for (let j = 0; false; j++)
             s += A[i][j] * x[j];
         y[i] = s;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (249.2142ms)

[Killed] EqualityOperator
services/portfolioEngine.js:80:25
     const y = new Float64Array(n);
     for (let i = 0; i < n; i++) {
         let s = 0;
-        for (let j = 0; j < n; j++)
+        for (let j = 0; j >= n; j++)
             s += A[i][j] * x[j];
         y[i] = s;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (239.7546ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:81:18
     for (let i = 0; i < n; i++) {
         let s = 0;
         for (let j = 0; j < n; j++)
-            s += A[i][j] * x[j];
+            s += A[i][j] / x[j];
         y[i] = s;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (241.7319ms)
✔ reverseSIP handles zero rate, reachable targets,

[Killed] AssignmentOperator
services/portfolioEngine.js:81:13
     for (let i = 0; i < n; i++) {
         let s = 0;
         for (let j = 0; j < n; j++)
-            s += A[i][j] * x[j];
+            s -= A[i][j] * x[j];
         y[i] = s;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (244.2276ms)

[Killed] BlockStatement
services/portfolioEngine.js:86:20
     }
     return y;
 }
-function dot(a, b) {
-    let s = 0;
-    for (let i = 0; i < a.length; i++)
-        s += a[i] * b[i];
-    return s;
-}
+function dot(a, b) {}
 function portfolioVariance(cov, w) {
     return dot(w, matvec(cov, w));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (256.5206ms)

[Killed] EqualityOperator
services/portfolioEngine.js:88:21
 }
 function dot(a, b) {
     let s = 0;
-    for (let i = 0; i < a.length; i++)
+    for (let i = 0; i <= a.length; i++)
         s += a[i] * b[i];
     return s;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (311.8507ms)

[Killed] EqualityOperator
services/portfolioEngine.js:88:21
 }
 function dot(a, b) {
     let s = 0;
-    for (let i = 0; i < a.length; i++)
+    for (let i = 0; i >= a.length; i++)
         s += a[i] * b[i];
     return s;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (251.153ms)
