[Killed] AssignmentOperator
services/portfolioEngine.js:89:9
 function dot(a, b) {
     let s = 0;
     for (let i = 0; i < a.length; i++)
-        s += a[i] * b[i];
+        s -= a[i] * b[i];
     return s;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (238.7639ms)

[Survived] ArithmeticOperator
services/portfolioEngine.js:89:14
 function dot(a, b) {
     let s = 0;
     for (let i = 0; i < a.length; i++)
-        s += a[i] * b[i];
+        s += a[i] / b[i];
     return s;
 }

[Killed] BlockStatement
services/portfolioEngine.js:92:36
         s += a[i] * b[i];
     return s;
 }
-function portfolioVariance(cov, w) {
-    return dot(w, matvec(cov, w));
-}
+function portfolioVariance(cov, w) {}
 function portfolioVol(cov, w) {
     return Math.sqrt(Math.max(0, portfolioVariance(cov, w)));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (240.4453ms)

[Killed] BlockStatement
services/portfolioEngine.js:95:31
 function portfolioVariance(cov, w) {
     return dot(w, matvec(cov, w));
 }
-function portfolioVol(cov, w) {
-    return Math.sqrt(Math.max(0, portfolioVariance(cov, w)));
-}
+function portfolioVol(cov, w) {}
 function portfolioReturn(w, mu) {
     return dot(w, mu);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (221.6545ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] MethodExpression
services/portfolioEngine.js:96:22
     return dot(w, matvec(cov, w));
 }
 function portfolioVol(cov, w) {
-    return Math.sqrt(Math.max(0, portfolioVariance(cov, w)));
+    return Math.sqrt(Math.min(0, portfolioVariance(cov, w)));
 }
 function portfolioReturn(w, mu) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (256.5515ms)

[Killed] BlockStatement
services/portfolioEngine.js:98:33
 function portfolioVol(cov, w) {
     return Math.sqrt(Math.max(0, portfolioVariance(cov, w)));
 }
-function portfolioReturn(w, mu) {
-    return dot(w, mu);
-}
+function portfolioReturn(w, mu) {}
 function projectSimplex(v) {
     const n = v.length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (250.7531ms)

[Killed] BlockStatement
services/portfolioEngine.js:101:28
 function portfolioReturn(w, mu) {
     return dot(w, mu);
 }
-function projectSimplex(v) {
-    const n = v.length;
-    const u = Array.from(v).sort((a, b) => b - a); // descending
-    let cumSum = 0;
-    let rho = 0;
-    for (let j = 0; j < n; j++) {
-        cumSum += u[j];
-        if (u[j] + (1 - cumSum) / (j + 1) > 0) {
-            rho = j;
-        }
-    }
-    let cumSumRho = 0;
-    for (let j = 0; j <= rho; j++)
-        cumSumRho += u[j];
-    const theta = (cumSumRho - 1) / (rho + 1);
-    const w = new Float64Array(n);
-    for (let i = 0; i < n; i++)
-        w[i] = Math.max(v[i] - theta, 0);
-    return w;
-}
+function projectSimplex(v) {}
 export function buildCovarianceMatrix(assetKeys) {
     const n = assetKeys.length;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (242.2652ms)

[Survived] MethodExpression
services/portfolioEngine.js:103:15
 }
 function projectSimplex(v) {
     const n = v.length;
-    const u = Array.from(v).sort((a, b) => b - a); // descending
+    const u = Array.from(v); // descending
     let cumSum = 0;
     let rho = 0;

[Survived] ArrowFunction
services/portfolioEngine.js:103:34
 }
 function projectSimplex(v) {
     const n = v.length;
-    const u = Array.from(v).sort((a, b) => b - a); // descending
+    const u = Array.from(v).sort(() => undefined); // descending
     let cumSum = 0;
     let rho = 0;

[Timeout] UpdateOperator
services/portfolioEngine.js:106:28
     const u = Array.from(v).sort((a, b) => b - a); // descending
     let cumSum = 0;
     let rho = 0;
-    for (let j = 0; j < n; j++) {
+    for (let j = 0; j < n; j--) {
         cumSum += u[j];
         if (u[j] + (1 - cumSum) / (j + 1) > 0) {

[Survived] ConditionalExpression
services/portfolioEngine.js:106:21
     const u = Array.from(v).sort((a, b) => b - a); // descending
     let cumSum = 0;
     let rho = 0;
-    for (let j = 0; j < n; j++) {
+    for (let j = 0; false; j++) {
         cumSum += u[j];
         if (u[j] + (1 - cumSum) / (j + 1) > 0) {

[Survived] AssignmentOperator
services/portfolioEngine.js:107:9
     let cumSum = 0;
     let rho = 0;
     for (let j = 0; j < n; j++) {
-        cumSum += u[j];
+        cumSum -= u[j];
         if (u[j] + (1 - cumSum) / (j + 1) > 0) {
             rho = j;

[Survived] EqualityOperator
services/portfolioEngine.js:108:13
     let rho = 0;
     for (let j = 0; j < n; j++) {
         cumSum += u[j];
-        if (u[j] + (1 - cumSum) / (j + 1) > 0) {
+        if (u[j] + (1 - cumSum) / (j + 1) <= 0) {
             rho = j;
         }

[Survived] ArithmeticOperator
services/portfolioEngine.js:108:21
     let rho = 0;
     for (let j = 0; j < n; j++) {
         cumSum += u[j];
-        if (u[j] + (1 - cumSum) / (j + 1) > 0) {
+        if (u[j] + (1 + cumSum) / (j + 1) > 0) {
             rho = j;
         }

[Timeout] UpdateOperator
services/portfolioEngine.js:113:31
         }
     }
     let cumSumRho = 0;
-    for (let j = 0; j <= rho; j++)
+    for (let j = 0; j <= rho; j--)
         cumSumRho += u[j];
     const theta = (cumSumRho - 1) / (rho + 1);

[Survived] EqualityOperator
services/portfolioEngine.js:113:21
         }
     }
     let cumSumRho = 0;
-    for (let j = 0; j <= rho; j++)
+    for (let j = 0; j < rho; j++)
         cumSumRho += u[j];
     const theta = (cumSumRho - 1) / (rho + 1);

[Killed] AssignmentOperator
services/portfolioEngine.js:114:9
     }
     let cumSumRho = 0;
     for (let j = 0; j <= rho; j++)
-        cumSumRho += u[j];
+        cumSumRho -= u[j];
     const theta = (cumSumRho - 1) / (rho + 1);
     const w = new Float64Array(n);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (241.5729ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:115:19
     let cumSumRho = 0;
     for (let j = 0; j <= rho; j++)
         cumSumRho += u[j];
-    const theta = (cumSumRho - 1) / (rho + 1);
+    const theta = (cumSumRho - 1) * (rho + 1);
     const w = new Float64Array(n);
     for (let i = 0; i < n; i++)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (220.4359ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:115:38
     let cumSumRho = 0;
     for (let j = 0; j <= rho; j++)
         cumSumRho += u[j];
-    const theta = (cumSumRho - 1) / (rho + 1);
+    const theta = (cumSumRho - 1) / (rho - 1);
     const w = new Float64Array(n);
     for (let i = 0; i < n; i++)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (299.1273ms)

[Killed] EqualityOperator
services/portfolioEngine.js:117:21
         cumSumRho += u[j];
     const theta = (cumSumRho - 1) / (rho + 1);
     const w = new Float64Array(n);
-    for (let i = 0; i < n; i++)
+    for (let i = 0; i >= n; i++)
         w[i] = Math.max(v[i] - theta, 0);
     return w;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (270.8807ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:117:21
         cumSumRho += u[j];
     const theta = (cumSumRho - 1) / (rho + 1);
     const w = new Float64Array(n);
-    for (let i = 0; i < n; i++)
+    for (let i = 0; false; i++)
         w[i] = Math.max(v[i] - theta, 0);
     return w;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (263.1482ms)

[Killed] MethodExpression
services/portfolioEngine.js:118:16
     const theta = (cumSumRho - 1) / (rho + 1);
     const w = new Float64Array(n);
     for (let i = 0; i < n; i++)
-        w[i] = Math.max(v[i] - theta, 0);
+        w[i] = Math.min(v[i] - theta, 0);
     return w;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (280.7285ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:118:25
     const theta = (cumSumRho - 1) / (rho + 1);
     const w = new Float64Array(n);
     for (let i = 0; i < n; i++)
-        w[i] = Math.max(v[i] - theta, 0);
+        w[i] = Math.max(v[i] + theta, 0);
     return w;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (300.6098ms)

[Killed] EqualityOperator
services/portfolioEngine.js:123:9
 }
 export function buildCovarianceMatrix(assetKeys) {
     const n = assetKeys.length;
-    if (n === 0)
+    if (n !== 0)
         throw new Error('assetKeys must be non-empty');
     // Mapping for asset classes that share correlation/volatility profiles
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (275.2773ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:123:9
 }
 export function buildCovarianceMatrix(assetKeys) {
     const n = assetKeys.length;
-    if (n === 0)
+    if (false)
         throw new Error('assetKeys must be non-empty');
     // Mapping for asset classes that share correlation/volatility profiles
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (312.9083ms)

[Survived] StringLiteral
services/portfolioEngine.js:129:16
     // but aren't directly in ASSET_KEYS
     const COVARIANCE_ALIAS = {
         'SCSS': 'FD',
-        'SSY': 'PPF',
+        'SSY': "",
         'Gold_Physical': 'Gold',
         'Balanced_Advantage': 'Hybrid_MF',

[Killed] BlockStatement
services/portfolioEngine.js:133:44
         'Gold_Physical': 'Gold',
         'Balanced_Advantage': 'Hybrid_MF',
     };
-    const indices = assetKeys.map((key) => {
-        let lookupKey = COVARIANCE_ALIAS[key] || key;
-        const idx = ASSET_KEYS.indexOf(lookupKey);
-        if (idx === -1) {
-            // Graceful fallback: use Equity_MF (index 0) as a safe default
-            // and warn instead of crashing the request
-            console.warn(`[portfolioEngine] Unknown asset key "${key}" in buildCovarianceMatrix. ` +
-                `Falling back to Equity_MF correlation profile. Valid keys: ${ASSET_KEYS.join(', ')}`);
-            return 0;
-        }
-        return idx;
-    });
+    const indices = assetKeys.map((key) => {});
     const sigmas = assetKeys.map((key) => {
         const resolvedKey = COVARIANCE_ALIAS[key] || key;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (307.3208ms)

[Survived] LogicalOperator
services/portfolioEngine.js:134:25
         'Balanced_Advantage': 'Hybrid_MF',
     };
     const indices = assetKeys.map((key) => {
-        let lookupKey = COVARIANCE_ALIAS[key] || key;
+        let lookupKey = COVARIANCE_ALIAS[key] && key;
         const idx = ASSET_KEYS.indexOf(lookupKey);
         if (idx === -1) {

[Survived] ConditionalExpression
services/portfolioEngine.js:134:25
         'Balanced_Advantage': 'Hybrid_MF',
     };
     const indices = assetKeys.map((key) => {
-        let lookupKey = COVARIANCE_ALIAS[key] || key;
+        let lookupKey = true;
         const idx = ASSET_KEYS.indexOf(lookupKey);
         if (idx === -1) {

[Killed] ConditionalExpression
services/portfolioEngine.js:136:13
     const indices = assetKeys.map((key) => {
         let lookupKey = COVARIANCE_ALIAS[key] || key;
         const idx = ASSET_KEYS.indexOf(lookupKey);
-        if (idx === -1) {
+        if (false) {
             // Graceful fallback: use Equity_MF (index 0) as a safe default
             // and warn instead of crashing the request
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (350.596ms)

[Killed] UnaryOperator
services/portfolioEngine.js:136:21
     const indices = assetKeys.map((key) => {
         let lookupKey = COVARIANCE_ALIAS[key] || key;
         const idx = ASSET_KEYS.indexOf(lookupKey);
-        if (idx === -1) {
+        if (idx === +1) {
             // Graceful fallback: use Equity_MF (index 0) as a safe default
             // and warn instead of crashing the request
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (328.4478ms)

[Survived] StringLiteral
services/portfolioEngine.js:139:26
         if (idx === -1) {
             // Graceful fallback: use Equity_MF (index 0) as a safe default
             // and warn instead of crashing the request
-            console.warn(`[portfolioEngine] Unknown asset key "${key}" in buildCovarianceMatrix. ` +
+            console.warn(`` +
                 `Falling back to Equity_MF correlation profile. Valid keys: ${ASSET_KEYS.join(', ')}`);
             return 0;

[Survived] StringLiteral
services/portfolioEngine.js:140:95
             // Graceful fallback: use Equity_MF (index 0) as a safe default
             // and warn instead of crashing the request
             console.warn(`[portfolioEngine] Unknown asset key "${key}" in buildCovarianceMatrix. ` +
-                `Falling back to Equity_MF correlation profile. Valid keys: ${ASSET_KEYS.join(', ')}`);
+                `Falling back to Equity_MF correlation profile. Valid keys: ${ASSET_KEYS.join("")}`);
             return 0;
         }

[Killed] BlockStatement
services/portfolioEngine.js:145:43
         }
         return idx;
     });
-    const sigmas = assetKeys.map((key) => {
-        const resolvedKey = COVARIANCE_ALIAS[key] || key;
-        const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
-        if (!params) {
-            console.warn(`[portfolioEngine] No INSTRUMENT_PARAMS entry for "${key}". Using default volatility 0.10.`);
-            return 0.10;
-        }
-        return params.volatility;
-    });
+    const sigmas = assetKeys.map((key) => {});
     const cov = Array.from({ length: n }, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (326.1008ms)

[Killed] LogicalOperator
services/portfolioEngine.js:146:29
         return idx;
     });
     const sigmas = assetKeys.map((key) => {
-        const resolvedKey = COVARIANCE_ALIAS[key] || key;
+        const resolvedKey = COVARIANCE_ALIAS[key] && key;
         const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
         if (!params) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (367.8731ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:146:29
         return idx;
     });
     const sigmas = assetKeys.map((key) => {
-        const resolvedKey = COVARIANCE_ALIAS[key] || key;
+        const resolvedKey = false;
         const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
         if (!params) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (339.9211ms)

[Killed] LogicalOperator
services/portfolioEngine.js:147:24
     });
     const sigmas = assetKeys.map((key) => {
         const resolvedKey = COVARIANCE_ALIAS[key] || key;
-        const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
+        const params = INSTRUMENT_PARAMS[resolvedKey] && INSTRUMENT_PARAMS[key];
         if (!params) {
             console.warn(`[portfolioEngine] No INSTRUMENT_PARAMS entry for "${key}". Using default volatility 0.10.`);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (366.9767ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:147:24
     });
     const sigmas = assetKeys.map((key) => {
         const resolvedKey = COVARIANCE_ALIAS[key] || key;
-        const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
+        const params = false;
         if (!params) {
             console.warn(`[portfolioEngine] No INSTRUMENT_PARAMS entry for "${key}". Using default volatility 0.10.`);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (345.2405ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:148:13
     const sigmas = assetKeys.map((key) => {
         const resolvedKey = COVARIANCE_ALIAS[key] || key;
         const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
-        if (!params) {
+        if (true) {
             console.warn(`[portfolioEngine] No INSTRUMENT_PARAMS entry for "${key}". Using default volatility 0.10.`);
             return 0.10;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (362.9346ms)

[Killed] BooleanLiteral
services/portfolioEngine.js:148:13
     const sigmas = assetKeys.map((key) => {
         const resolvedKey = COVARIANCE_ALIAS[key] || key;
         const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
-        if (!params) {
+        if (params) {
             console.warn(`[portfolioEngine] No INSTRUMENT_PARAMS entry for "${key}". Using default volatility 0.10.`);
             return 0.10;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (297.0642ms)

[Survived] StringLiteral
services/portfolioEngine.js:149:26
         const resolvedKey = COVARIANCE_ALIAS[key] || key;
         const params = INSTRUMENT_PARAMS[resolvedKey] || INSTRUMENT_PARAMS[key];
         if (!params) {
-            console.warn(`[portfolioEngine] No INSTRUMENT_PARAMS entry for "${key}". Using default volatility 0.10.`);
+            console.warn(``);
             return 0.10;
         }

[Killed] ArrowFunction
services/portfolioEngine.js:154:43
         }
         return params.volatility;
     });
-    const cov = Array.from({ length: n }, () => new Float64Array(n));
+    const cov = Array.from({ length: n }, () => undefined);
     for (let i = 0; i < n; i++) {
         for (let j = 0; j < n; j++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.2651ms)

[Killed] ObjectLiteral
services/portfolioEngine.js:154:28
         }
         return params.volatility;
     });
-    const cov = Array.from({ length: n }, () => new Float64Array(n));
+    const cov = Array.from({}, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
         for (let j = 0; j < n; j++) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (334.2753ms)

[Killed] EqualityOperator
services/portfolioEngine.js:155:21
         return params.volatility;
     });
     const cov = Array.from({ length: n }, () => new Float64Array(n));
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i >= n; i++) {
         for (let j = 0; j < n; j++) {
             cov[i][j] = FULL_CORR[indices[i]][indices[j]] * sigmas[i] * sigmas[j];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (324.5782ms)

[Killed] EqualityOperator
services/portfolioEngine.js:155:21
         return params.volatility;
     });
     const cov = Array.from({ length: n }, () => new Float64Array(n));
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         for (let j = 0; j < n; j++) {
             cov[i][j] = FULL_CORR[indices[i]][indices[j]] * sigmas[i] * sigmas[j];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (303.0453ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:157:25
     const cov = Array.from({ length: n }, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
         for (let j = 0; j < n; j++) {
-            cov[i][j] = FULL_CORR[indices[i]][indices[j]] * sigmas[i] * sigmas[j];
+            cov[i][j] = FULL_CORR[indices[i]][indices[j]] / sigmas[i] * sigmas[j];
         }
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (296.2419ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:157:25
     const cov = Array.from({ length: n }, () => new Float64Array(n));
     for (let i = 0; i < n; i++) {
         for (let j = 0; j < n; j++) {
-            cov[i][j] = FULL_CORR[indices[i]][indices[j]] * sigmas[i] * sigmas[j];
+            cov[i][j] = FULL_CORR[indices[i]][indices[j]] * sigmas[i] / sigmas[j];
         }
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.896ms)
