[Killed] BlockStatement
services/portfolioEngine.js:162:73
     }
     return { matrix: cov, assetKeys: [...assetKeys] };
 }
-function _prepareCovarianceMatrixAndValidate(assetKeys, postTaxReturns) {
-    const n = assetKeys.length;
-    if (n === 0)
-        throw new Error('assetKeys must be non-empty');
-    if (postTaxReturns.length !== n) {
-        throw new Error(`postTaxReturns length (${postTaxReturns.length}) must match assetKeys length (${n})`);
-    }
-    const { matrix: cov } = buildCovarianceMatrix(assetKeys);
-    let maxDiag = 0;
-    for (let i = 0; i < n; i++) {
-        maxDiag = Math.max(maxDiag, cov[i][i]);
-    }
-    const regularization = 1e-6 * (maxDiag > 0 ? maxDiag : 1.0);
-    for (let i = 0; i < n; i++) {
-        cov[i][i] += regularization;
-    }
-    return { n, cov };
-}
+function _prepareCovarianceMatrixAndValidate(assetKeys, postTaxReturns) {}
 
 export function solveMinVariance(assetKeys, postTaxReturns) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (280.8357ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:164:9
 }
 function _prepareCovarianceMatrixAndValidate(assetKeys, postTaxReturns) {
     const n = assetKeys.length;
-    if (n === 0)
+    if (true)
         throw new Error('assetKeys must be non-empty');
     if (postTaxReturns.length !== n) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (286.6125ms)

[Survived] StringLiteral
services/portfolioEngine.js:165:25
 function _prepareCovarianceMatrixAndValidate(assetKeys, postTaxReturns) {
     const n = assetKeys.length;
     if (n === 0)
-        throw new Error('assetKeys must be non-empty');
+        throw new Error("");
     if (postTaxReturns.length !== n) {
         throw new Error(`postTaxReturns length (${postTaxReturns.length}) must match assetKeys length (${n})`);

[Killed] EqualityOperator
services/portfolioEngine.js:166:9
     const n = assetKeys.length;
     if (n === 0)
         throw new Error('assetKeys must be non-empty');
-    if (postTaxReturns.length !== n) {
+    if (postTaxReturns.length === n) {
         throw new Error(`postTaxReturns length (${postTaxReturns.length}) must match assetKeys length (${n})`);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.1047ms)

[Killed] BlockStatement
services/portfolioEngine.js:166:38
     const n = assetKeys.length;
     if (n === 0)
         throw new Error('assetKeys must be non-empty');
-    if (postTaxReturns.length !== n) {
-        throw new Error(`postTaxReturns length (${postTaxReturns.length}) must match assetKeys length (${n})`);
-    }
+    if (postTaxReturns.length !== n) {}
     const { matrix: cov } = buildCovarianceMatrix(assetKeys);
     let maxDiag = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (338.8515ms)

[Killed] UpdateOperator
services/portfolioEngine.js:171:28
     }
     const { matrix: cov } = buildCovarianceMatrix(assetKeys);
     let maxDiag = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i < n; i--) {
         maxDiag = Math.max(maxDiag, cov[i][i]);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (343.1658ms)

[Killed] EqualityOperator
services/portfolioEngine.js:171:21
     }
     const { matrix: cov } = buildCovarianceMatrix(assetKeys);
     let maxDiag = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         maxDiag = Math.max(maxDiag, cov[i][i]);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.7477ms)

[Survived] MethodExpression
services/portfolioEngine.js:172:19
     const { matrix: cov } = buildCovarianceMatrix(assetKeys);
     let maxDiag = 0;
     for (let i = 0; i < n; i++) {
-        maxDiag = Math.max(maxDiag, cov[i][i]);
+        maxDiag = Math.min(maxDiag, cov[i][i]);
     }
     const regularization = 1e-6 * (maxDiag > 0 ? maxDiag : 1.0);

[Survived] ConditionalExpression
services/portfolioEngine.js:174:36
     for (let i = 0; i < n; i++) {
         maxDiag = Math.max(maxDiag, cov[i][i]);
     }
-    const regularization = 1e-6 * (maxDiag > 0 ? maxDiag : 1.0);
+    const regularization = 1e-6 * (false ? maxDiag : 1.0);
     for (let i = 0; i < n; i++) {
         cov[i][i] += regularization;

[Survived] ConditionalExpression
services/portfolioEngine.js:174:36
     for (let i = 0; i < n; i++) {
         maxDiag = Math.max(maxDiag, cov[i][i]);
     }
-    const regularization = 1e-6 * (maxDiag > 0 ? maxDiag : 1.0);
+    const regularization = 1e-6 * (true ? maxDiag : 1.0);
     for (let i = 0; i < n; i++) {
         cov[i][i] += regularization;

[Killed] UpdateOperator
services/portfolioEngine.js:175:28
         maxDiag = Math.max(maxDiag, cov[i][i]);
     }
     const regularization = 1e-6 * (maxDiag > 0 ? maxDiag : 1.0);
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i < n; i--) {
         cov[i][i] += regularization;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.1023ms)

[Killed] EqualityOperator
services/portfolioEngine.js:175:21
         maxDiag = Math.max(maxDiag, cov[i][i]);
     }
     const regularization = 1e-6 * (maxDiag > 0 ? maxDiag : 1.0);
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         cov[i][i] += regularization;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (343.8123ms)

[Survived] AssignmentOperator
services/portfolioEngine.js:176:9
     }
     const regularization = 1e-6 * (maxDiag > 0 ? maxDiag : 1.0);
     for (let i = 0; i < n; i++) {
-        cov[i][i] += regularization;
+        cov[i][i] -= regularization;
     }
     return { n, cov };

[Survived] ArithmeticOperator
services/portfolioEngine.js:184:38
 export function solveMinVariance(assetKeys, postTaxReturns) {
     const { n, cov } = _prepareCovarianceMatrixAndValidate(assetKeys, postTaxReturns);
     // Initialise with equal weights
-    let w = new Float64Array(n).fill(1 / n);
+    let w = new Float64Array(n).fill(1 * n);
     const maxIter = 5000;
     const tol = 1e-10;

[Survived] ConditionalExpression
services/portfolioEngine.js:188:24
     const maxIter = 5000;
     const tol = 1e-10;
     let lr = 0.5;
-    for (let iter = 0; iter < maxIter; iter++) {
+    for (let iter = 0; false; iter++) {
         const grad = matvec(cov, w);
         for (let i = 0; i < n; i++)

[Survived] UpdateOperator
services/portfolioEngine.js:188:40
     const maxIter = 5000;
     const tol = 1e-10;
     let lr = 0.5;
-    for (let iter = 0; iter < maxIter; iter++) {
+    for (let iter = 0; iter < maxIter; iter--) {
         const grad = matvec(cov, w);
         for (let i = 0; i < n; i++)

[Survived] EqualityOperator
services/portfolioEngine.js:190:25
     let lr = 0.5;
     for (let iter = 0; iter < maxIter; iter++) {
         const grad = matvec(cov, w);
-        for (let i = 0; i < n; i++)
+        for (let i = 0; i <= n; i++)
             grad[i] *= 2;
         const wNew = new Float64Array(n);

[Timeout] UpdateOperator
services/portfolioEngine.js:190:32
     let lr = 0.5;
     for (let iter = 0; iter < maxIter; iter++) {
         const grad = matvec(cov, w);
-        for (let i = 0; i < n; i++)
+        for (let i = 0; i < n; i--)
             grad[i] *= 2;
         const wNew = new Float64Array(n);

[Survived] AssignmentOperator
services/portfolioEngine.js:191:13
     for (let iter = 0; iter < maxIter; iter++) {
         const grad = matvec(cov, w);
         for (let i = 0; i < n; i++)
-            grad[i] *= 2;
+            grad[i] /= 2;
         const wNew = new Float64Array(n);
         for (let i = 0; i < n; i++)

[Survived] ConditionalExpression
services/portfolioEngine.js:193:25
         for (let i = 0; i < n; i++)
             grad[i] *= 2;
         const wNew = new Float64Array(n);
-        for (let i = 0; i < n; i++)
+        for (let i = 0; false; i++)
             wNew[i] = w[i] - lr * grad[i];
         const wProj = projectSimplex(wNew);

[Timeout] UpdateOperator
services/portfolioEngine.js:193:32
         for (let i = 0; i < n; i++)
             grad[i] *= 2;
         const wNew = new Float64Array(n);
-        for (let i = 0; i < n; i++)
+        for (let i = 0; i < n; i--)
             wNew[i] = w[i] - lr * grad[i];
         const wProj = projectSimplex(wNew);

[Killed] ArithmeticOperator
services/portfolioEngine.js:194:23
             grad[i] *= 2;
         const wNew = new Float64Array(n);
         for (let i = 0; i < n; i++)
-            wNew[i] = w[i] - lr * grad[i];
+            wNew[i] = w[i] + lr * grad[i];
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (287.8751ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:194:30
             grad[i] *= 2;
         const wNew = new Float64Array(n);
         for (let i = 0; i < n; i++)
-            wNew[i] = w[i] - lr * grad[i];
+            wNew[i] = w[i] - lr / grad[i];
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (253.8682ms)

[Survived] EqualityOperator
services/portfolioEngine.js:197:25
             wNew[i] = w[i] - lr * grad[i];
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;
-        for (let i = 0; i < n; i++)
+        for (let i = 0; i >= n; i++)
             maxDelta = Math.max(maxDelta, Math.abs(wProj[i] - w[i]));
         w = wProj;

[Survived] ConditionalExpression
services/portfolioEngine.js:197:25
             wNew[i] = w[i] - lr * grad[i];
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;
-        for (let i = 0; i < n; i++)
+        for (let i = 0; false; i++)
             maxDelta = Math.max(maxDelta, Math.abs(wProj[i] - w[i]));
         w = wProj;

[Survived] ArithmeticOperator
services/portfolioEngine.js:198:52
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;
         for (let i = 0; i < n; i++)
-            maxDelta = Math.max(maxDelta, Math.abs(wProj[i] - w[i]));
+            maxDelta = Math.max(maxDelta, Math.abs(wProj[i] + w[i]));
         w = wProj;
         if (maxDelta < tol)

[Survived] MethodExpression
services/portfolioEngine.js:198:24
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;
         for (let i = 0; i < n; i++)
-            maxDelta = Math.max(maxDelta, Math.abs(wProj[i] - w[i]));
+            maxDelta = Math.min(maxDelta, Math.abs(wProj[i] - w[i]));
         w = wProj;
         if (maxDelta < tol)

[Survived] EqualityOperator
services/portfolioEngine.js:200:13
         for (let i = 0; i < n; i++)
             maxDelta = Math.max(maxDelta, Math.abs(wProj[i] - w[i]));
         w = wProj;
-        if (maxDelta < tol)
+        if (maxDelta <= tol)
             break;
         if (iter > 0 && iter % 500 === 0)

[Survived] EqualityOperator
services/portfolioEngine.js:200:13
         for (let i = 0; i < n; i++)
             maxDelta = Math.max(maxDelta, Math.abs(wProj[i] - w[i]));
         w = wProj;
-        if (maxDelta < tol)
+        if (maxDelta >= tol)
             break;
         if (iter > 0 && iter % 500 === 0)

[Survived] ConditionalExpression
services/portfolioEngine.js:202:13
         w = wProj;
         if (maxDelta < tol)
             break;
-        if (iter > 0 && iter % 500 === 0)
+        if (false)
             lr *= 0.8;
     }

[Survived] ConditionalExpression
services/portfolioEngine.js:202:25
         w = wProj;
         if (maxDelta < tol)
             break;
-        if (iter > 0 && iter % 500 === 0)
+        if (iter > 0 && true)
             lr *= 0.8;
     }

[Survived] AssignmentOperator
services/portfolioEngine.js:203:13
         if (maxDelta < tol)
             break;
         if (iter > 0 && iter % 500 === 0)
-            lr *= 0.8;
+            lr /= 0.8;
     }
     const vol = portfolioVol(cov, w);

[Survived] ConditionalExpression
services/portfolioEngine.js:207:20
     }
     const vol = portfolioVol(cov, w);
     const ret = portfolioReturn(w, postTaxReturns);
-    const sharpe = vol > 0 ? (ret - RISK_FREE_RATE) / vol : 0;
+    const sharpe = true ? (ret - RISK_FREE_RATE) / vol : 0;
     return {
         weights: _weightsToMap(assetKeys, w),

[Survived] ArithmeticOperator
services/portfolioEngine.js:207:30
     }
     const vol = portfolioVol(cov, w);
     const ret = portfolioReturn(w, postTaxReturns);
-    const sharpe = vol > 0 ? (ret - RISK_FREE_RATE) / vol : 0;
+    const sharpe = vol > 0 ? (ret - RISK_FREE_RATE) * vol : 0;
     return {
         weights: _weightsToMap(assetKeys, w),

[Killed] ObjectLiteral
services/portfolioEngine.js:208:12
     const vol = portfolioVol(cov, w);
     const ret = portfolioReturn(w, postTaxReturns);
     const sharpe = vol > 0 ? (ret - RISK_FREE_RATE) / vol : 0;
-    return {
-        weights: _weightsToMap(assetKeys, w),
-        expectedReturn: _round6(ret),
-        volatility: _round6(vol),
-        sharpe: _round4(sharpe),
-    };
+    return {};
 }
 function _runMaxSharpePGD(cov, mu, rf, wInit, maxIter = 8000, tol = 1e-10) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (318.5195ms)

[Survived] ConditionalExpression
services/portfolioEngine.js:219:24
     const n = wInit.length;
     let w = new Float64Array(wInit);
     let lr = 0.02;
-    for (let iter = 0; iter < maxIter; iter++) {
+    for (let iter = 0; false; iter++) {
         const sigmaW = matvec(cov, w);
         const portVar = dot(w, sigmaW);

[Survived] EqualityOperator
services/portfolioEngine.js:219:24
     const n = wInit.length;
     let w = new Float64Array(wInit);
     let lr = 0.02;
-    for (let iter = 0; iter < maxIter; iter++) {
+    for (let iter = 0; iter <= maxIter; iter++) {
         const sigmaW = matvec(cov, w);
         const portVar = dot(w, sigmaW);

[Killed] MethodExpression
services/portfolioEngine.js:222:35
     for (let iter = 0; iter < maxIter; iter++) {
         const sigmaW = matvec(cov, w);
         const portVar = dot(w, sigmaW);
-        const portVol = Math.sqrt(Math.max(portVar, 1e-18));
+        const portVol = Math.sqrt(Math.min(portVar, 1e-18));
         const portRet = dot(w, mu);
         const excessRet = portRet - rf;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (320.6624ms)

[Survived] ArithmeticOperator
services/portfolioEngine.js:224:27
         const portVar = dot(w, sigmaW);
         const portVol = Math.sqrt(Math.max(portVar, 1e-18));
         const portRet = dot(w, mu);
-        const excessRet = portRet - rf;
+        const excessRet = portRet + rf;
         const grad = new Float64Array(n);
         for (let i = 0; i < n; i++) {

[Survived] ConditionalExpression
services/portfolioEngine.js:226:25
         const portRet = dot(w, mu);
         const excessRet = portRet - rf;
         const grad = new Float64Array(n);
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; false; i++) {
             grad[i] = (mu[i] * portVol - excessRet * sigmaW[i] / portVol) / (portVol * portVol);
         }

[Survived] BlockStatement
services/portfolioEngine.js:226:37
         const portRet = dot(w, mu);
         const excessRet = portRet - rf;
         const grad = new Float64Array(n);
-        for (let i = 0; i < n; i++) {
-            grad[i] = (mu[i] * portVol - excessRet * sigmaW[i] / portVol) / (portVol * portVol);
-        }
+        for (let i = 0; i < n; i++) {}
         const wNew = new Float64Array(n);
         for (let i = 0; i < n; i++)

[Survived] ArithmeticOperator
services/portfolioEngine.js:227:24
         const excessRet = portRet - rf;
         const grad = new Float64Array(n);
         for (let i = 0; i < n; i++) {
-            grad[i] = (mu[i] * portVol - excessRet * sigmaW[i] / portVol) / (portVol * portVol);
+            grad[i] = (mu[i] / portVol - excessRet * sigmaW[i] / portVol) / (portVol * portVol);
         }
         const wNew = new Float64Array(n);

[Survived] ArithmeticOperator
services/portfolioEngine.js:227:42
         const excessRet = portRet - rf;
         const grad = new Float64Array(n);
         for (let i = 0; i < n; i++) {
-            grad[i] = (mu[i] * portVol - excessRet * sigmaW[i] / portVol) / (portVol * portVol);
+            grad[i] = (mu[i] * portVol - excessRet / sigmaW[i] / portVol) / (portVol * portVol);
         }
         const wNew = new Float64Array(n);

[Survived] EqualityOperator
services/portfolioEngine.js:230:25
             grad[i] = (mu[i] * portVol - excessRet * sigmaW[i] / portVol) / (portVol * portVol);
         }
         const wNew = new Float64Array(n);
-        for (let i = 0; i < n; i++)
+        for (let i = 0; i <= n; i++)
             wNew[i] = w[i] + lr * grad[i];
         const wProj = projectSimplex(wNew);

[Survived] ArithmeticOperator
services/portfolioEngine.js:231:23
         }
         const wNew = new Float64Array(n);
         for (let i = 0; i < n; i++)
-            wNew[i] = w[i] + lr * grad[i];
+            wNew[i] = w[i] - lr * grad[i];
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;

[Survived] ArithmeticOperator
services/portfolioEngine.js:231:30
         }
         const wNew = new Float64Array(n);
         for (let i = 0; i < n; i++)
-            wNew[i] = w[i] + lr * grad[i];
+            wNew[i] = w[i] + lr / grad[i];
         const wProj = projectSimplex(wNew);
         let maxDelta = 0;

[Survived] ConditionalExpression
services/portfolioEngine.js:237:13
         for (let i = 0; i < n; i++)
             maxDelta = Math.max(maxDelta, Math.abs(wProj[i] - w[i]));
         w = wProj;
-        if (maxDelta < tol)
+        if (false)
             break;
         if (iter > 0 && iter % 1000 === 0)

[Survived] ConditionalExpression
services/portfolioEngine.js:239:25
         w = wProj;
         if (maxDelta < tol)
             break;
-        if (iter > 0 && iter % 1000 === 0)
+        if (iter > 0 && true)
             lr *= 0.75;
     }

[Survived] LogicalOperator
services/portfolioEngine.js:239:13
         w = wProj;
         if (maxDelta < tol)
             break;
-        if (iter > 0 && iter % 1000 === 0)
+        if (iter > 0 || iter % 1000 === 0)
             lr *= 0.75;
     }

[Survived] AssignmentOperator
services/portfolioEngine.js:240:13
         if (maxDelta < tol)
             break;
         if (iter > 0 && iter % 1000 === 0)
-            lr *= 0.75;
+            lr /= 0.75;
     }
     const vol = portfolioVol(cov, w);

[Killed] EqualityOperator
services/portfolioEngine.js:244:20
     }
     const vol = portfolioVol(cov, w);
     const ret = portfolioReturn(w, mu);
-    const sharpe = vol > 0 ? (ret - rf) / vol : 0;
+    const sharpe = vol <= 0 ? (ret - rf) / vol : 0;
     return { w, sharpe, vol, ret };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (361.2449ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:244:20
     }
     const vol = portfolioVol(cov, w);
     const ret = portfolioReturn(w, mu);
-    const sharpe = vol > 0 ? (ret - rf) / vol : 0;
+    const sharpe = false ? (ret - rf) / vol : 0;
     return { w, sharpe, vol, ret };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.2663ms)

[Timeout] UpdateOperator
services/portfolioEngine.js:252:28
     const mu = Float64Array.from(postTaxReturns);
     const rf = RISK_FREE_RATE;
     const excessMu = new Float64Array(n);
-    for (let i = 0; i < n; i++)
+    for (let i = 0; i < n; i--)
         excessMu[i] = mu[i] - rf;
     const anyPositive = excessMu.some((e) => e > 0);

[Survived] ConditionalExpression
services/portfolioEngine.js:252:21
     const mu = Float64Array.from(postTaxReturns);
     const rf = RISK_FREE_RATE;
     const excessMu = new Float64Array(n);
-    for (let i = 0; i < n; i++)
+    for (let i = 0; false; i++)
         excessMu[i] = mu[i] - rf;
     const anyPositive = excessMu.some((e) => e > 0);

[Survived] ArithmeticOperator
services/portfolioEngine.js:253:23
     const rf = RISK_FREE_RATE;
     const excessMu = new Float64Array(n);
     for (let i = 0; i < n; i++)
-        excessMu[i] = mu[i] - rf;
+        excessMu[i] = mu[i] + rf;
     const anyPositive = excessMu.some((e) => e > 0);
     if (!anyPositive) {

[Survived] EqualityOperator
services/portfolioEngine.js:254:46
     const excessMu = new Float64Array(n);
     for (let i = 0; i < n; i++)
         excessMu[i] = mu[i] - rf;
-    const anyPositive = excessMu.some((e) => e > 0);
+    const anyPositive = excessMu.some((e) => e <= 0);
     if (!anyPositive) {
         return solveMinVariance(assetKeys, postTaxReturns);

[Survived] EqualityOperator
services/portfolioEngine.js:254:46
     const excessMu = new Float64Array(n);
     for (let i = 0; i < n; i++)
         excessMu[i] = mu[i] - rf;
-    const anyPositive = excessMu.some((e) => e > 0);
+    const anyPositive = excessMu.some((e) => e >= 0);
     if (!anyPositive) {
         return solveMinVariance(assetKeys, postTaxReturns);

[Survived] ConditionalExpression
services/portfolioEngine.js:255:9
     for (let i = 0; i < n; i++)
         excessMu[i] = mu[i] - rf;
     const anyPositive = excessMu.some((e) => e > 0);
-    if (!anyPositive) {
+    if (false) {
         return solveMinVariance(assetKeys, postTaxReturns);
     }

[Survived] ConditionalExpression
services/portfolioEngine.js:255:9
     for (let i = 0; i < n; i++)
         excessMu[i] = mu[i] - rf;
     const anyPositive = excessMu.some((e) => e > 0);
-    if (!anyPositive) {
+    if (true) {
         return solveMinVariance(assetKeys, postTaxReturns);
     }

[Survived] BlockStatement
services/portfolioEngine.js:261:33
     const candidates = [];
     let wExcess = new Float64Array(n);
     let sumW = 0;
-    for (let i = 0; i < n; i++) {
-        wExcess[i] = Math.max(excessMu[i], 0);
-        sumW += wExcess[i];
-    }
+    for (let i = 0; i < n; i++) {}
     if (sumW > 0) {
         for (let i = 0; i < n; i++)

[Survived] EqualityOperator
services/portfolioEngine.js:261:21
     const candidates = [];
     let wExcess = new Float64Array(n);
     let sumW = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         wExcess[i] = Math.max(excessMu[i], 0);
         sumW += wExcess[i];

[Survived] MethodExpression
services/portfolioEngine.js:262:22
     let wExcess = new Float64Array(n);
     let sumW = 0;
     for (let i = 0; i < n; i++) {
-        wExcess[i] = Math.max(excessMu[i], 0);
+        wExcess[i] = Math.min(excessMu[i], 0);
         sumW += wExcess[i];
     }

[Survived] AssignmentOperator
services/portfolioEngine.js:263:9
     let sumW = 0;
     for (let i = 0; i < n; i++) {
         wExcess[i] = Math.max(excessMu[i], 0);
-        sumW += wExcess[i];
+        sumW -= wExcess[i];
     }
     if (sumW > 0) {

[Survived] ConditionalExpression
services/portfolioEngine.js:265:9
         wExcess[i] = Math.max(excessMu[i], 0);
         sumW += wExcess[i];
     }
-    if (sumW > 0) {
+    if (false) {
         for (let i = 0; i < n; i++)
             wExcess[i] /= sumW;

[Survived] EqualityOperator
services/portfolioEngine.js:265:9
         wExcess[i] = Math.max(excessMu[i], 0);
         sumW += wExcess[i];
     }
-    if (sumW > 0) {
+    if (sumW <= 0) {
         for (let i = 0; i < n; i++)
             wExcess[i] /= sumW;

[Survived] EqualityOperator
services/portfolioEngine.js:266:25
         sumW += wExcess[i];
     }
     if (sumW > 0) {
-        for (let i = 0; i < n; i++)
+        for (let i = 0; i <= n; i++)
             wExcess[i] /= sumW;
     }

[Survived] EqualityOperator
services/portfolioEngine.js:266:25
         sumW += wExcess[i];
     }
     if (sumW > 0) {
-        for (let i = 0; i < n; i++)
+        for (let i = 0; i >= n; i++)
             wExcess[i] /= sumW;
     }

[Survived] AssignmentOperator
services/portfolioEngine.js:267:13
     }
     if (sumW > 0) {
         for (let i = 0; i < n; i++)
-            wExcess[i] /= sumW;
+            wExcess[i] *= sumW;
     }
     else {

[Survived] BlockStatement
services/portfolioEngine.js:269:10
         for (let i = 0; i < n; i++)
             wExcess[i] /= sumW;
     }
-    else {
-        wExcess.fill(1 / n);
-    }
+    else {}
     candidates.push(_runMaxSharpePGD(cov, mu, rf, wExcess));
     const wEqual = new Float64Array(n).fill(1 / n);

[Survived] ArithmeticOperator
services/portfolioEngine.js:270:22
             wExcess[i] /= sumW;
     }
     else {
-        wExcess.fill(1 / n);
+        wExcess.fill(1 * n);
     }
     candidates.push(_runMaxSharpePGD(cov, mu, rf, wExcess));

[Survived] ArithmeticOperator
services/portfolioEngine.js:273:45
         wExcess.fill(1 / n);
     }
     candidates.push(_runMaxSharpePGD(cov, mu, rf, wExcess));
-    const wEqual = new Float64Array(n).fill(1 / n);
+    const wEqual = new Float64Array(n).fill(1 * n);
     candidates.push(_runMaxSharpePGD(cov, mu, rf, wEqual));
     const wRand = new Float64Array(n);

[Survived] BlockStatement
services/portfolioEngine.js:276:33
     const wEqual = new Float64Array(n).fill(1 / n);
     candidates.push(_runMaxSharpePGD(cov, mu, rf, wEqual));
     const wRand = new Float64Array(n);
-    for (let i = 0; i < n; i++) {
-        wRand[i] = Math.abs(Math.sin(i + 1));
-    }
+    for (let i = 0; i < n; i++) {}
     candidates.push(_runMaxSharpePGD(cov, mu, rf, projectSimplex(wRand)));
     let best = candidates[0];

[Survived] EqualityOperator
services/portfolioEngine.js:276:21
     const wEqual = new Float64Array(n).fill(1 / n);
     candidates.push(_runMaxSharpePGD(cov, mu, rf, wEqual));
     const wRand = new Float64Array(n);
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i >= n; i++) {
         wRand[i] = Math.abs(Math.sin(i + 1));
     }
