[Killed] EqualityOperator
services/portfolioEngine.js:376:25
     const MIN_ALLOCATION_FLOOR = 0.02; // 2% minimum allocation floor
     for (let iter = 0; iter < 10; iter++) {
         let sum = 0;
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; i <= n; i++) {
             if (temp[i] < MIN_ALLOCATION_FLOOR) {
                 temp[i] = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (297.2635ms)

[Killed] EqualityOperator
services/portfolioEngine.js:377:17
     for (let iter = 0; iter < 10; iter++) {
         let sum = 0;
         for (let i = 0; i < n; i++) {
-            if (temp[i] < MIN_ALLOCATION_FLOOR) {
+            if (temp[i] >= MIN_ALLOCATION_FLOOR) {
                 temp[i] = 0;
             }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (255.6729ms)

[Survived] BlockStatement
services/portfolioEngine.js:377:49
     for (let iter = 0; iter < 10; iter++) {
         let sum = 0;
         for (let i = 0; i < n; i++) {
-            if (temp[i] < MIN_ALLOCATION_FLOOR) {
-                temp[i] = 0;
-            }
+            if (temp[i] < MIN_ALLOCATION_FLOOR) {}
             sum += temp[i];
         }

[Survived] AssignmentOperator
services/portfolioEngine.js:380:13
             if (temp[i] < MIN_ALLOCATION_FLOOR) {
                 temp[i] = 0;
             }
-            sum += temp[i];
+            sum -= temp[i];
         }
         if (sum <= 0) {

[Survived] ConditionalExpression
services/portfolioEngine.js:382:13
             }
             sum += temp[i];
         }
-        if (sum <= 0) {
+        if (false) {
             let maxIdx = 0;
             let maxVal = -1;

[Survived] BlockStatement
services/portfolioEngine.js:382:23
             }
             sum += temp[i];
         }
-        if (sum <= 0) {
-            let maxIdx = 0;
-            let maxVal = -1;
-            for (let i = 0; i < n; i++) {
-                if (w[i] > maxVal) {
-                    maxVal = w[i];
-                    maxIdx = i;
-                }
-            }
-            temp = new Float64Array(n);
-            temp[maxIdx] = 1.0;
-            break;
-        }
+        if (sum <= 0) {}
         let belowFloor = false;
         for (let i = 0; i < n; i++) {

[Survived] UnaryOperator
services/portfolioEngine.js:384:26
         }
         if (sum <= 0) {
             let maxIdx = 0;
-            let maxVal = -1;
+            let maxVal = +1;
             for (let i = 0; i < n; i++) {
                 if (w[i] > maxVal) {

[Survived] UpdateOperator
services/portfolioEngine.js:385:36
         if (sum <= 0) {
             let maxIdx = 0;
             let maxVal = -1;
-            for (let i = 0; i < n; i++) {
+            for (let i = 0; i < n; i--) {
                 if (w[i] > maxVal) {
                     maxVal = w[i];

[Survived] ConditionalExpression
services/portfolioEngine.js:385:29
         if (sum <= 0) {
             let maxIdx = 0;
             let maxVal = -1;
-            for (let i = 0; i < n; i++) {
+            for (let i = 0; false; i++) {
                 if (w[i] > maxVal) {
                     maxVal = w[i];

[Survived] ConditionalExpression
services/portfolioEngine.js:386:21
             let maxIdx = 0;
             let maxVal = -1;
             for (let i = 0; i < n; i++) {
-                if (w[i] > maxVal) {
+                if (true) {
                     maxVal = w[i];
                     maxIdx = i;

[Survived] EqualityOperator
services/portfolioEngine.js:386:21
             let maxIdx = 0;
             let maxVal = -1;
             for (let i = 0; i < n; i++) {
-                if (w[i] > maxVal) {
+                if (w[i] >= maxVal) {
                     maxVal = w[i];
                     maxIdx = i;

[Survived] BooleanLiteral
services/portfolioEngine.js:395:26
             temp[maxIdx] = 1.0;
             break;
         }
-        let belowFloor = false;
+        let belowFloor = true;
         for (let i = 0; i < n; i++) {
             if (temp[i] > 0) {

[Killed] ConditionalExpression
services/portfolioEngine.js:396:25
             break;
         }
         let belowFloor = false;
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; false; i++) {
             if (temp[i] > 0) {
                 temp[i] /= sum;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (338.3138ms)

[Killed] EqualityOperator
services/portfolioEngine.js:396:25
             break;
         }
         let belowFloor = false;
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; i >= n; i++) {
             if (temp[i] > 0) {
                 temp[i] /= sum;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (318.0064ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] BlockStatement
services/portfolioEngine.js:397:30
         }
         let belowFloor = false;
         for (let i = 0; i < n; i++) {
-            if (temp[i] > 0) {
-                temp[i] /= sum;
-                if (temp[i] < MIN_ALLOCATION_FLOOR) {
-                    belowFloor = true;
-                }
-            }
+            if (temp[i] > 0) {}
         }
         if (!belowFloor) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (278.2805ms)

[Killed] EqualityOperator
services/portfolioEngine.js:397:17
         }
         let belowFloor = false;
         for (let i = 0; i < n; i++) {
-            if (temp[i] > 0) {
+            if (temp[i] <= 0) {
                 temp[i] /= sum;
                 if (temp[i] < MIN_ALLOCATION_FLOOR) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (267.3754ms)

[Killed] AssignmentOperator
services/portfolioEngine.js:398:17
         let belowFloor = false;
         for (let i = 0; i < n; i++) {
             if (temp[i] > 0) {
-                temp[i] /= sum;
+                temp[i] *= sum;
                 if (temp[i] < MIN_ALLOCATION_FLOOR) {
                     belowFloor = true;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (344.3025ms)

[Survived] EqualityOperator
services/portfolioEngine.js:399:21
         for (let i = 0; i < n; i++) {
             if (temp[i] > 0) {
                 temp[i] /= sum;
-                if (temp[i] < MIN_ALLOCATION_FLOOR) {
+                if (temp[i] <= MIN_ALLOCATION_FLOOR) {
                     belowFloor = true;
                 }

[Survived] EqualityOperator
services/portfolioEngine.js:399:21
         for (let i = 0; i < n; i++) {
             if (temp[i] > 0) {
                 temp[i] /= sum;
-                if (temp[i] < MIN_ALLOCATION_FLOOR) {
+                if (temp[i] >= MIN_ALLOCATION_FLOOR) {
                     belowFloor = true;
                 }

[Survived] BooleanLiteral
services/portfolioEngine.js:400:34
             if (temp[i] > 0) {
                 temp[i] /= sum;
                 if (temp[i] < MIN_ALLOCATION_FLOOR) {
-                    belowFloor = true;
+                    belowFloor = false;
                 }
             }

[Survived] BooleanLiteral
services/portfolioEngine.js:404:13
                 }
             }
         }
-        if (!belowFloor) {
+        if (belowFloor) {
             break;
         }

[Survived] ConditionalExpression
services/portfolioEngine.js:404:13
                 }
             }
         }
-        if (!belowFloor) {
+        if (false) {
             break;
         }

[Killed] BlockStatement
services/portfolioEngine.js:409:33
         }
     }
     const map = {};
-    for (let i = 0; i < n; i++) {
-        map[keys[i]] = _round6((map[keys[i]] || 0) + temp[i]);
-    }
+    for (let i = 0; i < n; i++) {}
     return map;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (276.9762ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:409:21
         }
     }
     const map = {};
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; false; i++) {
         map[keys[i]] = _round6((map[keys[i]] || 0) + temp[i]);
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.6865ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:410:33
     }
     const map = {};
     for (let i = 0; i < n; i++) {
-        map[keys[i]] = _round6((map[keys[i]] || 0) + temp[i]);
+        map[keys[i]] = _round6((true) + temp[i]);
     }
     return map;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (267.3606ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:410:32
     }
     const map = {};
     for (let i = 0; i < n; i++) {
-        map[keys[i]] = _round6((map[keys[i]] || 0) + temp[i]);
+        map[keys[i]] = _round6((map[keys[i]] || 0) - temp[i]);
     }
     return map;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (256.7612ms)

[Killed] BlockStatement
services/portfolioEngine.js:414:21
     }
     return map;
 }
-function _round6(x) { return Math.round(x * 1e6) / 1e6; }
+function _round6(x) {}
 function _round4(x) { return Math.round(x * 1e4) / 1e4; }
 const CANONICAL_MAP = {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (279.5351ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:414:41
     }
     return map;
 }
-function _round6(x) { return Math.round(x * 1e6) / 1e6; }
+function _round6(x) { return Math.round(x / 1e6) / 1e6; }
 function _round4(x) { return Math.round(x * 1e4) / 1e4; }
 const CANONICAL_MAP = {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (285.8866ms)

[Killed] BlockStatement
services/portfolioEngine.js:415:21
     return map;
 }
 function _round6(x) { return Math.round(x * 1e6) / 1e6; }
-function _round4(x) { return Math.round(x * 1e4) / 1e4; }
+function _round4(x) {}
 const CANONICAL_MAP = {
     'ppf': 'PPF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (286.2519ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:415:41
     return map;
 }
 function _round6(x) { return Math.round(x * 1e6) / 1e6; }
-function _round4(x) { return Math.round(x * 1e4) / 1e4; }
+function _round4(x) { return Math.round(x / 1e4) / 1e4; }
 const CANONICAL_MAP = {
     'ppf': 'PPF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (390.9519ms)

[Killed] StringLiteral
services/portfolioEngine.js:417:12
 function _round6(x) { return Math.round(x * 1e6) / 1e6; }
 function _round4(x) { return Math.round(x * 1e4) / 1e4; }
 const CANONICAL_MAP = {
-    'ppf': 'PPF',
+    'ppf': "",
     'fd': 'FD',
     'debt_mf': 'Debt_MF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (328.8237ms)

[Survived] StringLiteral
services/portfolioEngine.js:418:11
 function _round4(x) { return Math.round(x * 1e4) / 1e4; }
 const CANONICAL_MAP = {
     'ppf': 'PPF',
-    'fd': 'FD',
+    'fd': "",
     'debt_mf': 'Debt_MF',
     'nps': 'NPS',

[Killed] StringLiteral
services/portfolioEngine.js:425:22
     'index_mf': 'Index_MF',
     'gold_etf': 'Gold',
     'gold': 'Gold',
-    'gold_physical': 'Gold',
+    'gold_physical': "",
     'goldphysical': 'Gold',
     'elss': 'ELSS',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (284.8337ms)

[Survived] StringLiteral
services/portfolioEngine.js:427:13
     'gold': 'Gold',
     'gold_physical': 'Gold',
     'goldphysical': 'Gold',
-    'elss': 'ELSS',
+    'elss': "",
     'nifty_etf': 'ETF',
     'etf': 'ETF',

[Survived] StringLiteral
services/portfolioEngine.js:430:18
     'elss': 'ELSS',
     'nifty_etf': 'ETF',
     'etf': 'ETF',
-    'midcap_mf': 'Midcap_MF',
+    'midcap_mf': "",
     'smallcap_mf': 'Smallcap_MF',
     'liquid_mf': 'Liquid_MF',

[Survived] StringLiteral
services/portfolioEngine.js:432:18
     'etf': 'ETF',
     'midcap_mf': 'Midcap_MF',
     'smallcap_mf': 'Smallcap_MF',
-    'liquid_mf': 'Liquid_MF',
+    'liquid_mf': "",
     'sgb': 'SGB',
     'scss': 'SCSS',

[Survived] StringLiteral
services/portfolioEngine.js:433:12
     'midcap_mf': 'Midcap_MF',
     'smallcap_mf': 'Smallcap_MF',
     'liquid_mf': 'Liquid_MF',
-    'sgb': 'SGB',
+    'sgb': "",
     'scss': 'SCSS',
     'ssy': 'SSY',

[Survived] StringLiteral
services/portfolioEngine.js:435:12
     'liquid_mf': 'Liquid_MF',
     'sgb': 'SGB',
     'scss': 'SCSS',
-    'ssy': 'SSY',
+    'ssy': "",
     'equity_mf': 'Equity_MF',
     'g-sec': 'G-Sec',

[Survived] StringLiteral
services/portfolioEngine.js:436:18
     'sgb': 'SGB',
     'scss': 'SCSS',
     'ssy': 'SSY',
-    'equity_mf': 'Equity_MF',
+    'equity_mf': "",
     'g-sec': 'G-Sec',
     'rbi_bond': 'RBI_Bond',

[Survived] StringLiteral
services/portfolioEngine.js:438:17
     'ssy': 'SSY',
     'equity_mf': 'Equity_MF',
     'g-sec': 'G-Sec',
-    'rbi_bond': 'RBI_Bond',
+    'rbi_bond': "",
     'rbi_bonds': 'RBI_Bond',
     'balanced_advantage': 'Hybrid_MF',

[Killed] StringLiteral
services/portfolioEngine.js:439:18
     'equity_mf': 'Equity_MF',
     'g-sec': 'G-Sec',
     'rbi_bond': 'RBI_Bond',
-    'rbi_bonds': 'RBI_Bond',
+    'rbi_bonds': "",
     'balanced_advantage': 'Hybrid_MF',
     'balancedadvantage': 'Hybrid_MF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (280.7411ms)

[Killed] StringLiteral
services/portfolioEngine.js:441:26
     'rbi_bond': 'RBI_Bond',
     'rbi_bonds': 'RBI_Bond',
     'balanced_advantage': 'Hybrid_MF',
-    'balancedadvantage': 'Hybrid_MF',
+    'balancedadvantage': "",
     'balanced_fund': 'Hybrid_MF',
     'arbitrage_mf': 'Arbitrage_MF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (258.6216ms)

[Killed] StringLiteral
services/portfolioEngine.js:442:22
     'rbi_bonds': 'RBI_Bond',
     'balanced_advantage': 'Hybrid_MF',
     'balancedadvantage': 'Hybrid_MF',
-    'balanced_fund': 'Hybrid_MF',
+    'balanced_fund': "",
     'arbitrage_mf': 'Arbitrage_MF',
 };
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (284.9464ms)

[Survived] StringLiteral
services/portfolioEngine.js:443:21
     'balanced_advantage': 'Hybrid_MF',
     'balancedadvantage': 'Hybrid_MF',
     'balanced_fund': 'Hybrid_MF',
-    'arbitrage_mf': 'Arbitrage_MF',
+    'arbitrage_mf': "",
 };
 export function resolveAssetKey(key) {

[Killed] BlockStatement
services/portfolioEngine.js:445:38
     'balanced_fund': 'Hybrid_MF',
     'arbitrage_mf': 'Arbitrage_MF',
 };
-export function resolveAssetKey(key) {
-    const norm = key.trim().toLowerCase().replace(/[^a-z0-9_-]/g, '');
-    if (CANONICAL_MAP[norm])
-        return CANONICAL_MAP[norm];
-    const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() === key.toLowerCase());
-    return match || key;
-}
+export function resolveAssetKey(key) {}
 const RISK_SCORE_MAP = {
     'Very Low': 5, 'Low': 20, 'Low-Medium': 30, 'Medium-Low': 35, 'Medium': 50, 'High': 80, 'Very High': 95
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.939ms)

[Killed] MethodExpression
services/portfolioEngine.js:446:18
     'arbitrage_mf': 'Arbitrage_MF',
 };
 export function resolveAssetKey(key) {
-    const norm = key.trim().toLowerCase().replace(/[^a-z0-9_-]/g, '');
+    const norm = key.trim().toUpperCase().replace(/[^a-z0-9_-]/g, '');
     if (CANONICAL_MAP[norm])
         return CANONICAL_MAP[norm];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (277.0366ms)

[Survived] MethodExpression
services/portfolioEngine.js:446:18
     'arbitrage_mf': 'Arbitrage_MF',
 };
 export function resolveAssetKey(key) {
-    const norm = key.trim().toLowerCase().replace(/[^a-z0-9_-]/g, '');
+    const norm = key.toLowerCase().replace(/[^a-z0-9_-]/g, '');
     if (CANONICAL_MAP[norm])
         return CANONICAL_MAP[norm];

[Killed] ConditionalExpression
services/portfolioEngine.js:447:9
 };
 export function resolveAssetKey(key) {
     const norm = key.trim().toLowerCase().replace(/[^a-z0-9_-]/g, '');
-    if (CANONICAL_MAP[norm])
+    if (false)
         return CANONICAL_MAP[norm];
     const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() === key.toLowerCase());
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (299.506ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:447:9
 };
 export function resolveAssetKey(key) {
     const norm = key.trim().toLowerCase().replace(/[^a-z0-9_-]/g, '');
-    if (CANONICAL_MAP[norm])
+    if (true)
         return CANONICAL_MAP[norm];
     const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() === key.toLowerCase());
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (274.8004ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ConditionalExpression
services/portfolioEngine.js:449:60
     const norm = key.trim().toLowerCase().replace(/[^a-z0-9_-]/g, '');
     if (CANONICAL_MAP[norm])
         return CANONICAL_MAP[norm];
-    const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() === key.toLowerCase());
+    const match = Object.keys(INSTRUMENT_PARAMS).find(k => true);
     return match || key;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (311.1181ms)

[Killed] EqualityOperator
services/portfolioEngine.js:449:60
     const norm = key.trim().toLowerCase().replace(/[^a-z0-9_-]/g, '');
     if (CANONICAL_MAP[norm])
         return CANONICAL_MAP[norm];
-    const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() === key.toLowerCase());
+    const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() !== key.toLowerCase());
     return match || key;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (342.9846ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:450:12
     if (CANONICAL_MAP[norm])
         return CANONICAL_MAP[norm];
     const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() === key.toLowerCase());
-    return match || key;
+    return true;
 }
 const RISK_SCORE_MAP = {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (295.052ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:450:12
     if (CANONICAL_MAP[norm])
         return CANONICAL_MAP[norm];
     const match = Object.keys(INSTRUMENT_PARAMS).find(k => k.toLowerCase() === key.toLowerCase());
-    return match || key;
+    return false;
 }
 const RISK_SCORE_MAP = {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.8635ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:456:9
     'Very Low': 5, 'Low': 20, 'Low-Medium': 30, 'Medium-Low': 35, 'Medium': 50, 'High': 80, 'Very High': 95
 };
 function getTransactionCostRate(key, isSell, holdingMonths = 24) {
-    if (['Equity_MF', 'Index_MF', 'Midcap_MF', 'Smallcap_MF', 'Hybrid_MF', 'Balanced_Advantage'].includes(key)) {
+    if (true) {
         if (isSell) {
             const STT = 0.001;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (288.0737ms)

[Killed] BlockStatement
services/portfolioEngine.js:456:113
     'Very Low': 5, 'Low': 20, 'Low-Medium': 30, 'Medium-Low': 35, 'Medium': 50, 'High': 80, 'Very High': 95
 };
 function getTransactionCostRate(key, isSell, holdingMonths = 24) {
-    if (['Equity_MF', 'Index_MF', 'Midcap_MF', 'Smallcap_MF', 'Hybrid_MF', 'Balanced_Advantage'].includes(key)) {
-        if (isSell) {
-            const STT = 0.001;
-            const STAMP_DUTY = 0.00005;
-            const exitLoad = holdingMonths < 12 ? 0.01 : 0;
-            return STT + STAMP_DUTY + exitLoad;
-        }
-        return 0.00005;
-    }
+    if (['Equity_MF', 'Index_MF', 'Midcap_MF', 'Smallcap_MF', 'Hybrid_MF', 'Balanced_Advantage'].includes(key)) {}
     if (key === 'ELSS') {
         if (isSell) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (372.3194ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:457:13
 };
 function getTransactionCostRate(key, isSell, holdingMonths = 24) {
     if (['Equity_MF', 'Index_MF', 'Midcap_MF', 'Smallcap_MF', 'Hybrid_MF', 'Balanced_Advantage'].includes(key)) {
-        if (isSell) {
+        if (true) {
             const STT = 0.001;
             const STAMP_DUTY = 0.00005;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.3236ms)
