[Killed] ConditionalExpression
services/portfolioEngine.js:457:13
 };
 function getTransactionCostRate(key, isSell, holdingMonths = 24) {
     if (['Equity_MF', 'Index_MF', 'Midcap_MF', 'Smallcap_MF', 'Hybrid_MF', 'Balanced_Advantage'].includes(key)) {
-        if (isSell) {
+        if (false) {
             const STT = 0.001;
             const STAMP_DUTY = 0.00005;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (249.1646ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:460:30
         if (isSell) {
             const STT = 0.001;
             const STAMP_DUTY = 0.00005;
-            const exitLoad = holdingMonths < 12 ? 0.01 : 0;
+            const exitLoad = false ? 0.01 : 0;
             return STT + STAMP_DUTY + exitLoad;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (382.6773ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:460:30
         if (isSell) {
             const STT = 0.001;
             const STAMP_DUTY = 0.00005;
-            const exitLoad = holdingMonths < 12 ? 0.01 : 0;
+            const exitLoad = true ? 0.01 : 0;
             return STT + STAMP_DUTY + exitLoad;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (336.8258ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:461:20
             const STT = 0.001;
             const STAMP_DUTY = 0.00005;
             const exitLoad = holdingMonths < 12 ? 0.01 : 0;
-            return STT + STAMP_DUTY + exitLoad;
+            return STT - STAMP_DUTY + exitLoad;
         }
         return 0.00005;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (341.3743ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:461:20
             const STT = 0.001;
             const STAMP_DUTY = 0.00005;
             const exitLoad = holdingMonths < 12 ? 0.01 : 0;
-            return STT + STAMP_DUTY + exitLoad;
+            return STT + STAMP_DUTY - exitLoad;
         }
         return 0.00005;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (333.8656ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:465:9
         }
         return 0.00005;
     }
-    if (key === 'ELSS') {
+    if (false) {
         if (isSell) {
             const STT = 0.001;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (327.3216ms)

[Killed] EqualityOperator
services/portfolioEngine.js:465:9
         }
         return 0.00005;
     }
-    if (key === 'ELSS') {
+    if (key !== 'ELSS') {
         if (isSell) {
             const STT = 0.001;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (378.7499ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:466:13
         return 0.00005;
     }
     if (key === 'ELSS') {
-        if (isSell) {
+        if (false) {
             const STT = 0.001;
             return STT;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.7404ms)

[Killed] BlockStatement
services/portfolioEngine.js:466:21
         return 0.00005;
     }
     if (key === 'ELSS') {
-        if (isSell) {
-            const STT = 0.001;
-            return STT;
-        }
+        if (isSell) {}
         return 0.00005;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (328.4534ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:472:9
         }
         return 0.00005;
     }
-    if (['ETF', 'Gold_ETF', 'Gold', 'Arbitrage_MF'].includes(key)) {
+    if (true) {
         const brokerage = 0.0005;
         if (isSell) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (280.8818ms)

[Killed] BlockStatement
services/portfolioEngine.js:472:68
         }
         return 0.00005;
     }
-    if (['ETF', 'Gold_ETF', 'Gold', 'Arbitrage_MF'].includes(key)) {
-        const brokerage = 0.0005;
-        if (isSell) {
-            const STT = 0.001;
-            const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
-            return STT + brokerage + exitLoad;
-        }
-        return 0.00005 + brokerage;
-    }
+    if (['ETF', 'Gold_ETF', 'Gold', 'Arbitrage_MF'].includes(key)) {}
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
         if (isSell) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (331.6865ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:474:13
     }
     if (['ETF', 'Gold_ETF', 'Gold', 'Arbitrage_MF'].includes(key)) {
         const brokerage = 0.0005;
-        if (isSell) {
+        if (false) {
             const STT = 0.001;
             const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (324.5156ms)

[Killed] BlockStatement
services/portfolioEngine.js:474:21
     }
     if (['ETF', 'Gold_ETF', 'Gold', 'Arbitrage_MF'].includes(key)) {
         const brokerage = 0.0005;
-        if (isSell) {
-            const STT = 0.001;
-            const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
-            return STT + brokerage + exitLoad;
-        }
+        if (isSell) {}
         return 0.00005 + brokerage;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (312.1038ms)

[Killed] EqualityOperator
services/portfolioEngine.js:476:31
         const brokerage = 0.0005;
         if (isSell) {
             const STT = 0.001;
-            const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
+            const exitLoad = (key !== 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
             return STT + brokerage + exitLoad;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.9032ms)

[Killed] EqualityOperator
services/portfolioEngine.js:476:57
         const brokerage = 0.0005;
         if (isSell) {
             const STT = 0.001;
-            const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
+            const exitLoad = (key === 'Arbitrage_MF' && holdingMonths >= 1) ? 0.0025 : 0;
             return STT + brokerage + exitLoad;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (332.7738ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:477:20
         if (isSell) {
             const STT = 0.001;
             const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
-            return STT + brokerage + exitLoad;
+            return STT - brokerage + exitLoad;
         }
         return 0.00005 + brokerage;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (353.1592ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:477:20
         if (isSell) {
             const STT = 0.001;
             const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
-            return STT + brokerage + exitLoad;
+            return STT + brokerage - exitLoad;
         }
         return 0.00005 + brokerage;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.7814ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:479:16
             const exitLoad = (key === 'Arbitrage_MF' && holdingMonths < 1) ? 0.0025 : 0;
             return STT + brokerage + exitLoad;
         }
-        return 0.00005 + brokerage;
+        return 0.00005 - brokerage;
     }
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (338.3496ms)

[Killed] BlockStatement
services/portfolioEngine.js:481:49
         }
         return 0.00005 + brokerage;
     }
-    if (['Debt_MF', 'Liquid_MF'].includes(key)) {
-        if (isSell) {
-            if (key === 'Liquid_MF') {
-                return holdingMonths < 1 ? 0.005 : 0;
-            }
-            const exitLoad = holdingMonths < 12 ? 0.005 : 0;
-            return exitLoad;
-        }
-        return 0.00005;
-    }
+    if (['Debt_MF', 'Liquid_MF'].includes(key)) {}
     if (['Gold_Physical'].includes(key)) {
         return isSell ? 0.005 : 0.03;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (292.7032ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:481:9
         }
         return 0.00005 + brokerage;
     }
-    if (['Debt_MF', 'Liquid_MF'].includes(key)) {
+    if (false) {
         if (isSell) {
             if (key === 'Liquid_MF') {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.7475ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:482:13
         return 0.00005 + brokerage;
     }
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
-        if (isSell) {
+        if (false) {
             if (key === 'Liquid_MF') {
                 return holdingMonths < 1 ? 0.005 : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.1009ms)

[Killed] BlockStatement
services/portfolioEngine.js:482:21
         return 0.00005 + brokerage;
     }
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
-        if (isSell) {
-            if (key === 'Liquid_MF') {
-                return holdingMonths < 1 ? 0.005 : 0;
-            }
-            const exitLoad = holdingMonths < 12 ? 0.005 : 0;
-            return exitLoad;
-        }
+        if (isSell) {}
         return 0.00005;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (304.3852ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] EqualityOperator
services/portfolioEngine.js:483:17
     }
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
         if (isSell) {
-            if (key === 'Liquid_MF') {
+            if (key !== 'Liquid_MF') {
                 return holdingMonths < 1 ? 0.005 : 0;
             }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (295.2154ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:483:17
     }
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
         if (isSell) {
-            if (key === 'Liquid_MF') {
+            if (true) {
                 return holdingMonths < 1 ? 0.005 : 0;
             }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (286.4842ms)

[Killed] EqualityOperator
services/portfolioEngine.js:484:24
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
         if (isSell) {
             if (key === 'Liquid_MF') {
-                return holdingMonths < 1 ? 0.005 : 0;
+                return holdingMonths >= 1 ? 0.005 : 0;
             }
             const exitLoad = holdingMonths < 12 ? 0.005 : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (311.7135ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:484:24
     if (['Debt_MF', 'Liquid_MF'].includes(key)) {
         if (isSell) {
             if (key === 'Liquid_MF') {
-                return holdingMonths < 1 ? 0.005 : 0;
+                return false ? 0.005 : 0;
             }
             const exitLoad = holdingMonths < 12 ? 0.005 : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (334.6993ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:486:30
             if (key === 'Liquid_MF') {
                 return holdingMonths < 1 ? 0.005 : 0;
             }
-            const exitLoad = holdingMonths < 12 ? 0.005 : 0;
+            const exitLoad = false ? 0.005 : 0;
             return exitLoad;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (275.6296ms)

[Killed] EqualityOperator
services/portfolioEngine.js:486:30
             if (key === 'Liquid_MF') {
                 return holdingMonths < 1 ? 0.005 : 0;
             }
-            const exitLoad = holdingMonths < 12 ? 0.005 : 0;
+            const exitLoad = holdingMonths >= 12 ? 0.005 : 0;
             return exitLoad;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (315.507ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ConditionalExpression
services/portfolioEngine.js:491:9
         }
         return 0.00005;
     }
-    if (['Gold_Physical'].includes(key)) {
+    if (true) {
         return isSell ? 0.005 : 0.03;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (320.3823ms)

[Survived] ConditionalExpression
services/portfolioEngine.js:491:9
         }
         return 0.00005;
     }
-    if (['Gold_Physical'].includes(key)) {
+    if (false) {
         return isSell ? 0.005 : 0.03;
     }

[Killed] BlockStatement
services/portfolioEngine.js:494:39
     if (['Gold_Physical'].includes(key)) {
         return isSell ? 0.005 : 0.03;
     }
-    if (['FD', 'SCSS'].includes(key)) {
-        if (isSell && holdingMonths < 12)
-            return 0.01;
-        return isSell ? 0.005 : 0.0;
-    }
+    if (['FD', 'SCSS'].includes(key)) {}
     return 0.0;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (271.1242ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:494:9
     if (['Gold_Physical'].includes(key)) {
         return isSell ? 0.005 : 0.03;
     }
-    if (['FD', 'SCSS'].includes(key)) {
+    if (false) {
         if (isSell && holdingMonths < 12)
             return 0.01;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (289.2435ms)

[Killed] LogicalOperator
services/portfolioEngine.js:495:13
         return isSell ? 0.005 : 0.03;
     }
     if (['FD', 'SCSS'].includes(key)) {
-        if (isSell && holdingMonths < 12)
+        if (isSell || holdingMonths < 12)
             return 0.01;
         return isSell ? 0.005 : 0.0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (270.8557ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:495:13
         return isSell ? 0.005 : 0.03;
     }
     if (['FD', 'SCSS'].includes(key)) {
-        if (isSell && holdingMonths < 12)
+        if (false)
             return 0.01;
         return isSell ? 0.005 : 0.0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (275.4159ms)

[Killed] LogicalOperator
services/portfolioEngine.js:504:41
 export function computeRebalance(currentAllocation, targetAllocation, threshold = 2.0, partialRatio = 1.0, holdingMonths = 24) {
     const resolvedCurrent = {};
     let totalValue = 0;
-    for (const [k, v] of Object.entries(currentAllocation || {})) {
+    for (const [k, v] of Object.entries(currentAllocation && {})) {
         const val = Number(v) || 0;
         if (val < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (352.3835ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:504:41
 export function computeRebalance(currentAllocation, targetAllocation, threshold = 2.0, partialRatio = 1.0, holdingMonths = 24) {
     const resolvedCurrent = {};
     let totalValue = 0;
-    for (const [k, v] of Object.entries(currentAllocation || {})) {
+    for (const [k, v] of Object.entries(true)) {
         const val = Number(v) || 0;
         if (val < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (380.6564ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:505:21
     const resolvedCurrent = {};
     let totalValue = 0;
     for (const [k, v] of Object.entries(currentAllocation || {})) {
-        const val = Number(v) || 0;
+        const val = true;
         if (val < 0)
             continue;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (281.4154ms)

[Killed] LogicalOperator
services/portfolioEngine.js:505:21
     const resolvedCurrent = {};
     let totalValue = 0;
     for (const [k, v] of Object.entries(currentAllocation || {})) {
-        const val = Number(v) || 0;
+        const val = Number(v) && 0;
         if (val < 0)
             continue;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (307.7385ms)

[Killed] EqualityOperator
services/portfolioEngine.js:506:13
     let totalValue = 0;
     for (const [k, v] of Object.entries(currentAllocation || {})) {
         const val = Number(v) || 0;
-        if (val < 0)
+        if (val >= 0)
             continue;
         const resolved = resolveAssetKey(k);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (290.9911ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:506:13
     let totalValue = 0;
     for (const [k, v] of Object.entries(currentAllocation || {})) {
         const val = Number(v) || 0;
-        if (val < 0)
+        if (false)
             continue;
         const resolved = resolveAssetKey(k);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (313.9864ms)

[Killed] LogicalOperator
services/portfolioEngine.js:509:38
         if (val < 0)
             continue;
         const resolved = resolveAssetKey(k);
-        resolvedCurrent[resolved] = (resolvedCurrent[resolved] || 0) + val;
+        resolvedCurrent[resolved] = (resolvedCurrent[resolved] && 0) + val;
         totalValue += val;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (346.0841ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:509:37
         if (val < 0)
             continue;
         const resolved = resolveAssetKey(k);
-        resolvedCurrent[resolved] = (resolvedCurrent[resolved] || 0) + val;
+        resolvedCurrent[resolved] = (resolvedCurrent[resolved] || 0) - val;
         totalValue += val;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (279.7266ms)
