[Killed] AssignmentOperator
services/portfolioEngine.js:510:9
             continue;
         const resolved = resolveAssetKey(k);
         resolvedCurrent[resolved] = (resolvedCurrent[resolved] || 0) + val;
-        totalValue += val;
+        totalValue -= val;
     }
     if (totalValue <= 0) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (284.472ms)

[Killed] EqualityOperator
services/portfolioEngine.js:512:9
         resolvedCurrent[resolved] = (resolvedCurrent[resolved] || 0) + val;
         totalValue += val;
     }
-    if (totalValue <= 0) {
+    if (totalValue > 0) {
         return {
             total_portfolio_value: 0,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (292.1189ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:512:9
         resolvedCurrent[resolved] = (resolvedCurrent[resolved] || 0) + val;
         totalValue += val;
     }
-    if (totalValue <= 0) {
+    if (true) {
         return {
             total_portfolio_value: 0,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (282.0446ms)

[Survived] StringLiteral
services/portfolioEngine.js:516:29
         return {
             total_portfolio_value: 0,
             drift_index: 0,
-            drift_severity: 'Low',
+            drift_severity: "",
             rebalance_recommended: false,
             total_estimated_transaction_cost: 0,

[Killed] BooleanLiteral
services/portfolioEngine.js:517:36
             total_portfolio_value: 0,
             drift_index: 0,
             drift_severity: 'Low',
-            rebalance_recommended: false,
+            rebalance_recommended: true,
             total_estimated_transaction_cost: 0,
             before_stats: { cagr: 0, risk_score: 0 },
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (362.8967ms)

[Killed] ArrowFunction
services/portfolioEngine.js:524:66
             assets: [],
         };
     }
-    const targetVals = Object.values(targetAllocation || {}).map(v => Number(v) || 0);
+    const targetVals = Object.values(targetAllocation || {}).map(() => undefined);
     const maxVal = Math.max(...targetVals, 0);
     const targetSum = targetVals.reduce((s, v) => s + v, 0);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.5985ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:524:71
             assets: [],
         };
     }
-    const targetVals = Object.values(targetAllocation || {}).map(v => Number(v) || 0);
+    const targetVals = Object.values(targetAllocation || {}).map(v => false);
     const maxVal = Math.max(...targetVals, 0);
     const targetSum = targetVals.reduce((s, v) => s + v, 0);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.3233ms)

[Survived] MethodExpression
services/portfolioEngine.js:525:20
         };
     }
     const targetVals = Object.values(targetAllocation || {}).map(v => Number(v) || 0);
-    const maxVal = Math.max(...targetVals, 0);
+    const maxVal = Math.min(...targetVals, 0);
     const targetSum = targetVals.reduce((s, v) => s + v, 0);
     const isDecimal = maxVal <= 1.0 && targetSum <= 1.05;

[Killed] ArithmeticOperator
services/portfolioEngine.js:526:51
     }
     const targetVals = Object.values(targetAllocation || {}).map(v => Number(v) || 0);
     const maxVal = Math.max(...targetVals, 0);
-    const targetSum = targetVals.reduce((s, v) => s + v, 0);
+    const targetSum = targetVals.reduce((s, v) => s - v, 0);
     const isDecimal = maxVal <= 1.0 && targetSum <= 1.05;
     const scale = isDecimal ? 100 : 1.0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.8432ms)

[Killed] ArrowFunction
services/portfolioEngine.js:526:41
     }
     const targetVals = Object.values(targetAllocation || {}).map(v => Number(v) || 0);
     const maxVal = Math.max(...targetVals, 0);
-    const targetSum = targetVals.reduce((s, v) => s + v, 0);
+    const targetSum = targetVals.reduce(() => undefined, 0);
     const isDecimal = maxVal <= 1.0 && targetSum <= 1.05;
     const scale = isDecimal ? 100 : 1.0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.8837ms)

[Survived] ConditionalExpression
services/portfolioEngine.js:527:40
     const targetVals = Object.values(targetAllocation || {}).map(v => Number(v) || 0);
     const maxVal = Math.max(...targetVals, 0);
     const targetSum = targetVals.reduce((s, v) => s + v, 0);
-    const isDecimal = maxVal <= 1.0 && targetSum <= 1.05;
+    const isDecimal = maxVal <= 1.0 && true;
     const scale = isDecimal ? 100 : 1.0;
     const normalizedSum = targetSum * scale;

[Survived] EqualityOperator
services/portfolioEngine.js:527:40
     const targetVals = Object.values(targetAllocation || {}).map(v => Number(v) || 0);
     const maxVal = Math.max(...targetVals, 0);
     const targetSum = targetVals.reduce((s, v) => s + v, 0);
-    const isDecimal = maxVal <= 1.0 && targetSum <= 1.05;
+    const isDecimal = maxVal <= 1.0 && targetSum > 1.05;
     const scale = isDecimal ? 100 : 1.0;
     const normalizedSum = targetSum * scale;

[Killed] ArithmeticOperator
services/portfolioEngine.js:529:27
     const targetSum = targetVals.reduce((s, v) => s + v, 0);
     const isDecimal = maxVal <= 1.0 && targetSum <= 1.05;
     const scale = isDecimal ? 100 : 1.0;
-    const normalizedSum = targetSum * scale;
+    const normalizedSum = targetSum / scale;
     const resolvedTarget = {};
     for (const [k, v] of Object.entries(targetAllocation || {})) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (342.5114ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:531:41
     const scale = isDecimal ? 100 : 1.0;
     const normalizedSum = targetSum * scale;
     const resolvedTarget = {};
-    for (const [k, v] of Object.entries(targetAllocation || {})) {
+    for (const [k, v] of Object.entries(false)) {
         const val = Number(v) || 0;
         if (val < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.0985ms)

[Killed] LogicalOperator
services/portfolioEngine.js:531:41
     const scale = isDecimal ? 100 : 1.0;
     const normalizedSum = targetSum * scale;
     const resolvedTarget = {};
-    for (const [k, v] of Object.entries(targetAllocation || {})) {
+    for (const [k, v] of Object.entries(targetAllocation && {})) {
         const val = Number(v) || 0;
         if (val < 0)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (331.422ms)

[Killed] LogicalOperator
services/portfolioEngine.js:532:21
     const normalizedSum = targetSum * scale;
     const resolvedTarget = {};
     for (const [k, v] of Object.entries(targetAllocation || {})) {
-        const val = Number(v) || 0;
+        const val = Number(v) && 0;
         if (val < 0)
             continue;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (286.5995ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:532:21
     const normalizedSum = targetSum * scale;
     const resolvedTarget = {};
     for (const [k, v] of Object.entries(targetAllocation || {})) {
-        const val = Number(v) || 0;
+        const val = false;
         if (val < 0)
             continue;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (263.7575ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:533:13
     const resolvedTarget = {};
     for (const [k, v] of Object.entries(targetAllocation || {})) {
         const val = Number(v) || 0;
-        if (val < 0)
+        if (true)
             continue;
         const resolved = resolveAssetKey(k);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (299.4247ms)

[Killed] EqualityOperator
services/portfolioEngine.js:536:71
         if (val < 0)
             continue;
         const resolved = resolveAssetKey(k);
-        resolvedTarget[resolved] = (resolvedTarget[resolved] || 0) + (normalizedSum > 0 ? (val * scale / normalizedSum) * 100 : 0);
+        resolvedTarget[resolved] = (resolvedTarget[resolved] || 0) + (normalizedSum <= 0 ? (val * scale / normalizedSum) * 100 : 0);
     }
     const allKeys = Array.from(new Set([
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.9083ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:536:92
         if (val < 0)
             continue;
         const resolved = resolveAssetKey(k);
-        resolvedTarget[resolved] = (resolvedTarget[resolved] || 0) + (normalizedSum > 0 ? (val * scale / normalizedSum) * 100 : 0);
+        resolvedTarget[resolved] = (resolvedTarget[resolved] || 0) + (normalizedSum > 0 ? (val / scale / normalizedSum) * 100 : 0);
     }
     const allKeys = Array.from(new Set([
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (371.7738ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:550:28
     let afterWeightedRisk = 0;
     let totalEstimatedTransactionCost = 0;
     for (const key of allKeys) {
-        const currentVal = resolvedCurrent[key] || 0;
+        const currentVal = true;
         const targetPct = resolvedTarget[key] || 0;
         const currentPct = (currentVal / totalValue) * 100;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (324.7574ms)

[Killed] LogicalOperator
services/portfolioEngine.js:550:28
     let afterWeightedRisk = 0;
     let totalEstimatedTransactionCost = 0;
     for (const key of allKeys) {
-        const currentVal = resolvedCurrent[key] || 0;
+        const currentVal = resolvedCurrent[key] && 0;
         const targetPct = resolvedTarget[key] || 0;
         const currentPct = (currentVal / totalValue) * 100;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.4748ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:551:27
     let totalEstimatedTransactionCost = 0;
     for (const key of allKeys) {
         const currentVal = resolvedCurrent[key] || 0;
-        const targetPct = resolvedTarget[key] || 0;
+        const targetPct = true;
         const currentPct = (currentVal / totalValue) * 100;
         const driftPct = currentPct - targetPct;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (295.5057ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:551:27
     let totalEstimatedTransactionCost = 0;
     for (const key of allKeys) {
         const currentVal = resolvedCurrent[key] || 0;
-        const targetPct = resolvedTarget[key] || 0;
+        const targetPct = false;
         const currentPct = (currentVal / totalValue) * 100;
         const driftPct = currentPct - targetPct;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.2696ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:552:29
     for (const key of allKeys) {
         const currentVal = resolvedCurrent[key] || 0;
         const targetPct = resolvedTarget[key] || 0;
-        const currentPct = (currentVal / totalValue) * 100;
+        const currentPct = (currentVal * totalValue) * 100;
         const driftPct = currentPct - targetPct;
         const targetVal = (targetPct / 100) * totalValue;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (277.4031ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:552:28
     for (const key of allKeys) {
         const currentVal = resolvedCurrent[key] || 0;
         const targetPct = resolvedTarget[key] || 0;
-        const currentPct = (currentVal / totalValue) * 100;
+        const currentPct = currentVal / totalValue / 100;
         const driftPct = currentPct - targetPct;
         const targetVal = (targetPct / 100) * totalValue;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.2656ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:553:26
         const currentVal = resolvedCurrent[key] || 0;
         const targetPct = resolvedTarget[key] || 0;
         const currentPct = (currentVal / totalValue) * 100;
-        const driftPct = currentPct - targetPct;
+        const driftPct = currentPct + targetPct;
         const targetVal = (targetPct / 100) * totalValue;
         const rawCorrection = targetVal - currentVal;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (307.2242ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:554:27
         const targetPct = resolvedTarget[key] || 0;
         const currentPct = (currentVal / totalValue) * 100;
         const driftPct = currentPct - targetPct;
-        const targetVal = (targetPct / 100) * totalValue;
+        const targetVal = targetPct / 100 / totalValue;
         const rawCorrection = targetVal - currentVal;
         const suggestedCorrection = rawCorrection * partialRatio;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.537ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:554:28
         const targetPct = resolvedTarget[key] || 0;
         const currentPct = (currentVal / totalValue) * 100;
         const driftPct = currentPct - targetPct;
-        const targetVal = (targetPct / 100) * totalValue;
+        const targetVal = (targetPct * 100) * totalValue;
         const rawCorrection = targetVal - currentVal;
         const suggestedCorrection = rawCorrection * partialRatio;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.2192ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:555:31
         const currentPct = (currentVal / totalValue) * 100;
         const driftPct = currentPct - targetPct;
         const targetVal = (targetPct / 100) * totalValue;
-        const rawCorrection = targetVal - currentVal;
+        const rawCorrection = targetVal + currentVal;
         const suggestedCorrection = rawCorrection * partialRatio;
         const driftExceedsThreshold = Math.abs(driftPct) >= threshold;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (290.4575ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:556:37
         const driftPct = currentPct - targetPct;
         const targetVal = (targetPct / 100) * totalValue;
         const rawCorrection = targetVal - currentVal;
-        const suggestedCorrection = rawCorrection * partialRatio;
+        const suggestedCorrection = rawCorrection / partialRatio;
         const driftExceedsThreshold = Math.abs(driftPct) >= threshold;
         sumDiff += Math.abs(driftPct);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (333.205ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ConditionalExpression
services/portfolioEngine.js:557:39
         const targetVal = (targetPct / 100) * totalValue;
         const rawCorrection = targetVal - currentVal;
         const suggestedCorrection = rawCorrection * partialRatio;
-        const driftExceedsThreshold = Math.abs(driftPct) >= threshold;
+        const driftExceedsThreshold = false;
         sumDiff += Math.abs(driftPct);
         const params = INSTRUMENT_PARAMS[key] || { nominalRate: 7.0, riskLevel: 'Medium', name: key };
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (275.612ms)

[Killed] EqualityOperator
services/portfolioEngine.js:557:39
         const targetVal = (targetPct / 100) * totalValue;
         const rawCorrection = targetVal - currentVal;
         const suggestedCorrection = rawCorrection * partialRatio;
-        const driftExceedsThreshold = Math.abs(driftPct) >= threshold;
+        const driftExceedsThreshold = Math.abs(driftPct) < threshold;
         sumDiff += Math.abs(driftPct);
         const params = INSTRUMENT_PARAMS[key] || { nominalRate: 7.0, riskLevel: 'Medium', name: key };
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (268.1141ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] AssignmentOperator
services/portfolioEngine.js:558:9
         const rawCorrection = targetVal - currentVal;
         const suggestedCorrection = rawCorrection * partialRatio;
         const driftExceedsThreshold = Math.abs(driftPct) >= threshold;
-        sumDiff += Math.abs(driftPct);
+        sumDiff -= Math.abs(driftPct);
         const params = INSTRUMENT_PARAMS[key] || { nominalRate: 7.0, riskLevel: 'Medium', name: key };
         const nominalRate = params.nominalRate;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (299.6582ms)

[Survived] ConditionalExpression
services/portfolioEngine.js:559:24
         const suggestedCorrection = rawCorrection * partialRatio;
         const driftExceedsThreshold = Math.abs(driftPct) >= threshold;
         sumDiff += Math.abs(driftPct);
-        const params = INSTRUMENT_PARAMS[key] || { nominalRate: 7.0, riskLevel: 'Medium', name: key };
+        const params = false;
         const nominalRate = params.nominalRate;
         const riskLevel = params.riskLevel;

[Survived] ConditionalExpression
services/portfolioEngine.js:559:24
         const suggestedCorrection = rawCorrection * partialRatio;
         const driftExceedsThreshold = Math.abs(driftPct) >= threshold;
         sumDiff += Math.abs(driftPct);
-        const params = INSTRUMENT_PARAMS[key] || { nominalRate: 7.0, riskLevel: 'Medium', name: key };
+        const params = true;
         const nominalRate = params.nominalRate;
         const riskLevel = params.riskLevel;

[Survived] LogicalOperator
services/portfolioEngine.js:562:28
         const params = INSTRUMENT_PARAMS[key] || { nominalRate: 7.0, riskLevel: 'Medium', name: key };
         const nominalRate = params.nominalRate;
         const riskLevel = params.riskLevel;
-        const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
+        const riskWeight = RISK_SCORE_MAP[riskLevel] && 50;
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;

[Survived] ConditionalExpression
services/portfolioEngine.js:562:28
         const params = INSTRUMENT_PARAMS[key] || { nominalRate: 7.0, riskLevel: 'Medium', name: key };
         const nominalRate = params.nominalRate;
         const riskLevel = params.riskLevel;
-        const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
+        const riskWeight = true;
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;

[Survived] ArithmeticOperator
services/portfolioEngine.js:563:32
         const nominalRate = params.nominalRate;
         const riskLevel = params.riskLevel;
         const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
-        beforeWeightedCAGR += (currentPct / 100) * nominalRate;
+        beforeWeightedCAGR += (currentPct * 100) * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;

[Survived] AssignmentOperator
services/portfolioEngine.js:563:9
         const nominalRate = params.nominalRate;
         const riskLevel = params.riskLevel;
         const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
-        beforeWeightedCAGR += (currentPct / 100) * nominalRate;
+        beforeWeightedCAGR -= currentPct / 100 * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;

[Survived] ArithmeticOperator
services/portfolioEngine.js:564:31
         const riskLevel = params.riskLevel;
         const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
-        afterWeightedCAGR += (targetPct / 100) * nominalRate;
+        afterWeightedCAGR += (targetPct * 100) * nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;
         afterWeightedRisk += (targetPct / 100) * riskWeight;

[Survived] ArithmeticOperator
services/portfolioEngine.js:564:30
         const riskLevel = params.riskLevel;
         const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
-        afterWeightedCAGR += (targetPct / 100) * nominalRate;
+        afterWeightedCAGR += targetPct / 100 / nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;
         afterWeightedRisk += (targetPct / 100) * riskWeight;
