[Killed] ArithmeticOperator
services/portfolioEngine.js:565:31
         const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
-        beforeWeightedRisk += (currentPct / 100) * riskWeight;
+        beforeWeightedRisk += currentPct / 100 / riskWeight;
         afterWeightedRisk += (targetPct / 100) * riskWeight;
         const isSell = rawCorrection < 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (270.0088ms)

[Killed] AssignmentOperator
services/portfolioEngine.js:565:9
         const riskWeight = RISK_SCORE_MAP[riskLevel] || 50;
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
-        beforeWeightedRisk += (currentPct / 100) * riskWeight;
+        beforeWeightedRisk -= currentPct / 100 * riskWeight;
         afterWeightedRisk += (targetPct / 100) * riskWeight;
         const isSell = rawCorrection < 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (287.4486ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:566:31
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;
-        afterWeightedRisk += (targetPct / 100) * riskWeight;
+        afterWeightedRisk += (targetPct * 100) * riskWeight;
         const isSell = rawCorrection < 0;
         const absCorrection = Math.abs(rawCorrection);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.1082ms)

[Survived] AssignmentOperator
services/portfolioEngine.js:566:9
         beforeWeightedCAGR += (currentPct / 100) * nominalRate;
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;
-        afterWeightedRisk += (targetPct / 100) * riskWeight;
+        afterWeightedRisk -= targetPct / 100 * riskWeight;
         const isSell = rawCorrection < 0;
         const absCorrection = Math.abs(rawCorrection);

[Killed] EqualityOperator
services/portfolioEngine.js:567:24
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;
         afterWeightedRisk += (targetPct / 100) * riskWeight;
-        const isSell = rawCorrection < 0;
+        const isSell = rawCorrection >= 0;
         const absCorrection = Math.abs(rawCorrection);
         const txCostRate = getTransactionCostRate(key, isSell, holdingMonths);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (282.0528ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:567:24
         afterWeightedCAGR += (targetPct / 100) * nominalRate;
         beforeWeightedRisk += (currentPct / 100) * riskWeight;
         afterWeightedRisk += (targetPct / 100) * riskWeight;
-        const isSell = rawCorrection < 0;
+        const isSell = false;
         const absCorrection = Math.abs(rawCorrection);
         const txCostRate = getTransactionCostRate(key, isSell, holdingMonths);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (277.2144ms)
✔ reverseSIP handles zero rate, reachable targets,

[Survived] ArithmeticOperator
services/portfolioEngine.js:570:33
         const isSell = rawCorrection < 0;
         const absCorrection = Math.abs(rawCorrection);
         const txCostRate = getTransactionCostRate(key, isSell, holdingMonths);
-        const estimatedTxCost = absCorrection * txCostRate;
+        const estimatedTxCost = absCorrection / txCostRate;
         totalEstimatedTransactionCost += estimatedTxCost;
         assets.push({

[Killed] AssignmentOperator
services/portfolioEngine.js:571:9
         const absCorrection = Math.abs(rawCorrection);
         const txCostRate = getTransactionCostRate(key, isSell, holdingMonths);
         const estimatedTxCost = absCorrection * txCostRate;
-        totalEstimatedTransactionCost += estimatedTxCost;
+        totalEstimatedTransactionCost -= estimatedTxCost;
         assets.push({
             asset_class: key,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (255.7741ms)

[Killed] EqualityOperator
services/portfolioEngine.js:584:26
             drift_pct: _round4(driftPct),
             raw_correction: _round4(rawCorrection),
             suggested_correction: _round4(suggestedCorrection),
-            action_type: Math.abs(rawCorrection) < 1.0 ? 'hold' : rawCorrection > 0 ? 'buy' : 'sell',
+            action_type: Math.abs(rawCorrection) >= 1.0 ? 'hold' : rawCorrection > 0 ? 'buy' : 'sell',
             rebalance_recommended: driftExceedsThreshold,
             estimated_transaction_cost: _round4(estimatedTxCost),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (303.4801ms)

[Killed] EqualityOperator
services/portfolioEngine.js:584:67
             drift_pct: _round4(driftPct),
             raw_correction: _round4(rawCorrection),
             suggested_correction: _round4(suggestedCorrection),
-            action_type: Math.abs(rawCorrection) < 1.0 ? 'hold' : rawCorrection > 0 ? 'buy' : 'sell',
+            action_type: Math.abs(rawCorrection) < 1.0 ? 'hold' : rawCorrection <= 0 ? 'buy' : 'sell',
             rebalance_recommended: driftExceedsThreshold,
             estimated_transaction_cost: _round4(estimatedTxCost),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (266.591ms)

[Killed] ArithmeticOperator
services/portfolioEngine.js:590:24
             transaction_cost_rate: txCostRate,
         });
     }
-    const driftIndex = sumDiff / 2;
+    const driftIndex = sumDiff * 2;
     const driftSeverity = driftIndex > 12 ? 'High' : driftIndex > 5 ? 'Moderate' : 'Low';
     const rebalanceRecommended = assets.some(a => a.rebalance_recommended);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (321.8605ms)

[Killed] EqualityOperator
services/portfolioEngine.js:591:54
         });
     }
     const driftIndex = sumDiff / 2;
-    const driftSeverity = driftIndex > 12 ? 'High' : driftIndex > 5 ? 'Moderate' : 'Low';
+    const driftSeverity = driftIndex > 12 ? 'High' : driftIndex <= 5 ? 'Moderate' : 'Low';
     const rebalanceRecommended = assets.some(a => a.rebalance_recommended);
     let portfolioTrackingError = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (291.9465ms)

[Killed] ConditionalExpression
services/portfolioEngine.js:591:54
         });
     }
     const driftIndex = sumDiff / 2;
-    const driftSeverity = driftIndex > 12 ? 'High' : driftIndex > 5 ? 'Moderate' : 'Low';
+    const driftSeverity = driftIndex > 12 ? 'High' : false ? 'Moderate' : 'Low';
     const rebalanceRecommended = assets.some(a => a.rebalance_recommended);
     let portfolioTrackingError = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (289.4354ms)

[Killed] ArrowFunction
services/portfolioEngine.js:592:46
     }
     const driftIndex = sumDiff / 2;
     const driftSeverity = driftIndex > 12 ? 'High' : driftIndex > 5 ? 'Moderate' : 'Low';
-    const rebalanceRecommended = assets.some(a => a.rebalance_recommended);
+    const rebalanceRecommended = assets.some(() => undefined);
     let portfolioTrackingError = 0;
     try {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (313.5922ms)

[Survived] MethodExpression
services/portfolioEngine.js:592:34
     }
     const driftIndex = sumDiff / 2;
     const driftSeverity = driftIndex > 12 ? 'High' : driftIndex > 5 ? 'Moderate' : 'Low';
-    const rebalanceRecommended = assets.some(a => a.rebalance_recommended);
+    const rebalanceRecommended = assets.every(a => a.rebalance_recommended);
     let portfolioTrackingError = 0;
     try {

[Survived] BlockStatement
services/portfolioEngine.js:594:9
     const driftSeverity = driftIndex > 12 ? 'High' : driftIndex > 5 ? 'Moderate' : 'Low';
     const rebalanceRecommended = assets.some(a => a.rebalance_recommended);
     let portfolioTrackingError = 0;
-    try {
-        const { matrix: covActive } = buildCovarianceMatrix(allKeys);
-        const wDiff = new Float64Array(allKeys.length);
-        for (let i = 0; i < allKeys.length; i++) {
-            const key = allKeys[i];
-            const currentPct = (resolvedCurrent[key] || 0) / totalValue;
-            const targetPct = (resolvedTarget[key] || 0) / 100;
-            wDiff[i] = currentPct - targetPct;
-        }
-        const diffVar = portfolioVariance(covActive, wDiff);
-        portfolioTrackingError = Math.sqrt(Math.max(0, diffVar));
-    }
+    try {}
     catch (e) {
         console.error('[portfolioEngine] Tracking error calculation failed:', e);

[Survived] BlockStatement
services/portfolioEngine.js:597:50
     try {
         const { matrix: covActive } = buildCovarianceMatrix(allKeys);
         const wDiff = new Float64Array(allKeys.length);
-        for (let i = 0; i < allKeys.length; i++) {
-            const key = allKeys[i];
-            const currentPct = (resolvedCurrent[key] || 0) / totalValue;
-            const targetPct = (resolvedTarget[key] || 0) / 100;
-            wDiff[i] = currentPct - targetPct;
-        }
+        for (let i = 0; i < allKeys.length; i++) {}
         const diffVar = portfolioVariance(covActive, wDiff);
         portfolioTrackingError = Math.sqrt(Math.max(0, diffVar));

[Survived] EqualityOperator
services/portfolioEngine.js:597:25
     try {
         const { matrix: covActive } = buildCovarianceMatrix(allKeys);
         const wDiff = new Float64Array(allKeys.length);
-        for (let i = 0; i < allKeys.length; i++) {
+        for (let i = 0; i <= allKeys.length; i++) {
             const key = allKeys[i];
             const currentPct = (resolvedCurrent[key] || 0) / totalValue;

[Survived] LogicalOperator
services/portfolioEngine.js:599:33
         const wDiff = new Float64Array(allKeys.length);
         for (let i = 0; i < allKeys.length; i++) {
             const key = allKeys[i];
-            const currentPct = (resolvedCurrent[key] || 0) / totalValue;
+            const currentPct = (resolvedCurrent[key] && 0) / totalValue;
             const targetPct = (resolvedTarget[key] || 0) / 100;
             wDiff[i] = currentPct - targetPct;

[Survived] ConditionalExpression
services/portfolioEngine.js:599:33
         const wDiff = new Float64Array(allKeys.length);
         for (let i = 0; i < allKeys.length; i++) {
             const key = allKeys[i];
-            const currentPct = (resolvedCurrent[key] || 0) / totalValue;
+            const currentPct = (false) / totalValue;
             const targetPct = (resolvedTarget[key] || 0) / 100;
             wDiff[i] = currentPct - targetPct;

[Survived] ConditionalExpression
services/portfolioEngine.js:600:32
         for (let i = 0; i < allKeys.length; i++) {
             const key = allKeys[i];
             const currentPct = (resolvedCurrent[key] || 0) / totalValue;
-            const targetPct = (resolvedTarget[key] || 0) / 100;
+            const targetPct = (true) / 100;
             wDiff[i] = currentPct - targetPct;
         }

[Survived] LogicalOperator
services/portfolioEngine.js:600:32
         for (let i = 0; i < allKeys.length; i++) {
             const key = allKeys[i];
             const currentPct = (resolvedCurrent[key] || 0) / totalValue;
-            const targetPct = (resolvedTarget[key] || 0) / 100;
+            const targetPct = (resolvedTarget[key] && 0) / 100;
             wDiff[i] = currentPct - targetPct;
         }

[Survived] ArithmeticOperator
services/portfolioEngine.js:601:24
             const key = allKeys[i];
             const currentPct = (resolvedCurrent[key] || 0) / totalValue;
             const targetPct = (resolvedTarget[key] || 0) / 100;
-            wDiff[i] = currentPct - targetPct;
+            wDiff[i] = currentPct + targetPct;
         }
         const diffVar = portfolioVariance(covActive, wDiff);

[Survived] MethodExpression
services/portfolioEngine.js:604:44
             wDiff[i] = currentPct - targetPct;
         }
         const diffVar = portfolioVariance(covActive, wDiff);
-        portfolioTrackingError = Math.sqrt(Math.max(0, diffVar));
+        portfolioTrackingError = Math.sqrt(Math.min(0, diffVar));
     }
     catch (e) {

[Survived] BlockStatement
services/portfolioEngine.js:606:15
         const diffVar = portfolioVariance(covActive, wDiff);
         portfolioTrackingError = Math.sqrt(Math.max(0, diffVar));
     }
-    catch (e) {
-        console.error('[portfolioEngine] Tracking error calculation failed:', e);
-    }
+    catch (e) {}
     return {
         total_portfolio_value: _round4(totalValue),

[Killed] ObjectLiteral
services/portfolioEngine.js:620:22
             cagr: _round4(beforeWeightedCAGR),
             risk_score: _round4(beforeWeightedRisk),
         },
-        after_stats: {
-            cagr: _round4(afterWeightedCAGR),
-            risk_score: _round4(afterWeightedRisk),
-        },
+        after_stats: {},
         assets: assets.sort((a, b) => b.drift_pct - a.drift_pct),
     };
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (265.9041ms)

[Survived] ArrowFunction
services/portfolioEngine.js:624:29
             cagr: _round4(afterWeightedCAGR),
             risk_score: _round4(afterWeightedRisk),
         },
-        assets: assets.sort((a, b) => b.drift_pct - a.drift_pct),
+        assets: assets.sort(() => undefined),
     };
 }

[Survived] MethodExpression
services/portfolioEngine.js:624:17
             cagr: _round4(afterWeightedCAGR),
             risk_score: _round4(afterWeightedRisk),
         },
-        assets: assets.sort((a, b) => b.drift_pct - a.drift_pct),
+        assets: assets,
     };
 }
