[Killed] BlockStatement
services/RecommendationPipeline.js:90:54
  * @param {Object} profile - User's financial profile
  * @returns {Array} Eligible instruments
  */
-export function filterEligible(instruments, profile) {
-  const age = Number(profile.age) || 30;
-  const annualIncome = Number(profile.annualIncome) || 0;
-  const monthlySavings = Number(profile.savings) || 0;
-
-  return instruments.filter(inv => {
-    const elig = inv.eligibility;
-    if (!elig) return true; // No eligibility rules = universally eligible
-
-    // Age gate
-    if (elig.minAge && age < elig.minAge) return false;
-    if (elig.maxAge && age > elig.maxAge) return false;
-
-    // Income gate
-    if (elig.minAnnualIncome && annualIncome < elig.minAnnualIncome) return false;
-
-    // Savings gate
-    if (elig.minMonthlySavings && monthlySavings < elig.minMonthlySavings) return false;
-
-    // Special: girl child requirement (skip if user doesn't have one)
-    if (elig.hasGirlChild && !profile.hasGirlChild) return false;
-
-    return true;
-  });
-}
+export function filterEligible(instruments, profile) {}
 
 // ═══════════════════════════════════════════════════════════════════
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (279.4947ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:91:15
  * @returns {Array} Eligible instruments
  */
 export function filterEligible(instruments, profile) {
-  const age = Number(profile.age) || 30;
+  const age = Number(profile.age) && 30;
   const annualIncome = Number(profile.annualIncome) || 0;
   const monthlySavings = Number(profile.savings) || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (318.8343ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:91:15
  * @returns {Array} Eligible instruments
  */
 export function filterEligible(instruments, profile) {
-  const age = Number(profile.age) || 30;
+  const age = false;
   const annualIncome = Number(profile.annualIncome) || 0;
   const monthlySavings = Number(profile.savings) || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (304.6051ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:92:24
  */
 export function filterEligible(instruments, profile) {
   const age = Number(profile.age) || 30;
-  const annualIncome = Number(profile.annualIncome) || 0;
+  const annualIncome = true;
   const monthlySavings = Number(profile.savings) || 0;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (296.6555ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:92:24
  */
 export function filterEligible(instruments, profile) {
   const age = Number(profile.age) || 30;
-  const annualIncome = Number(profile.annualIncome) || 0;
+  const annualIncome = Number(profile.annualIncome) && 0;
   const monthlySavings = Number(profile.savings) || 0;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (294.486ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:93:26
 export function filterEligible(instruments, profile) {
   const age = Number(profile.age) || 30;
   const annualIncome = Number(profile.annualIncome) || 0;
-  const monthlySavings = Number(profile.savings) || 0;
+  const monthlySavings = false;
 
   return instruments.filter(inv => {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (330.9722ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:93:26
 export function filterEligible(instruments, profile) {
   const age = Number(profile.age) || 30;
   const annualIncome = Number(profile.annualIncome) || 0;
-  const monthlySavings = Number(profile.savings) || 0;
+  const monthlySavings = true;
 
   return instruments.filter(inv => {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (280.26ms)

[Killed] MethodExpression
services/RecommendationPipeline.js:95:10
   const annualIncome = Number(profile.annualIncome) || 0;
   const monthlySavings = Number(profile.savings) || 0;
 
-  return instruments.filter(inv => {
-    const elig = inv.eligibility;
-    if (!elig) return true; // No eligibility rules = universally eligible
-
-    // Age gate
-    if (elig.minAge && age < elig.minAge) return false;
-    if (elig.maxAge && age > elig.maxAge) return false;
-
-    // Income gate
-    if (elig.minAnnualIncome && annualIncome < elig.minAnnualIncome) return false;
-
-    // Savings gate
-    if (elig.minMonthlySavings && monthlySavings < elig.minMonthlySavings) return false;
-
-    // Special: girl child requirement (skip if user doesn't have one)
-    if (elig.hasGirlChild && !profile.hasGirlChild) return false;
-
-    return true;
-  });
+  return instruments;
 }
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (293.4571ms)

[Killed] BlockStatement
services/RecommendationPipeline.js:95:36
   const annualIncome = Number(profile.annualIncome) || 0;
   const monthlySavings = Number(profile.savings) || 0;
 
-  return instruments.filter(inv => {
-    const elig = inv.eligibility;
-    if (!elig) return true; // No eligibility rules = universally eligible
-
-    // Age gate
-    if (elig.minAge && age < elig.minAge) return false;
-    if (elig.maxAge && age > elig.maxAge) return false;
-
-    // Income gate
-    if (elig.minAnnualIncome && annualIncome < elig.minAnnualIncome) return false;
-
-    // Savings gate
-    if (elig.minMonthlySavings && monthlySavings < elig.minMonthlySavings) return false;
-
-    // Special: girl child requirement (skip if user doesn't have one)
-    if (elig.hasGirlChild && !profile.hasGirlChild) return false;
-
-    return true;
-  });
+  return instruments.filter(inv => {});
 }
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (276.1223ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:97:9
 
   return instruments.filter(inv => {
     const elig = inv.eligibility;
-    if (!elig) return true; // No eligibility rules = universally eligible
+    if (false) return true; // No eligibility rules = universally eligible
 
     // Age gate
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (330.7199ms)

[Killed] BooleanLiteral
services/RecommendationPipeline.js:97:9
 
   return instruments.filter(inv => {
     const elig = inv.eligibility;
-    if (!elig) return true; // No eligibility rules = universally eligible
+    if (elig) return true; // No eligibility rules = universally eligible
 
     // Age gate
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (279.1184ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:100:9
     if (!elig) return true; // No eligibility rules = universally eligible
 
     // Age gate
-    if (elig.minAge && age < elig.minAge) return false;
+    if (true) return false;
     if (elig.maxAge && age > elig.maxAge) return false;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (266.8253ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:100:24
     if (!elig) return true; // No eligibility rules = universally eligible
 
     // Age gate
-    if (elig.minAge && age < elig.minAge) return false;
+    if (elig.minAge && true) return false;
     if (elig.maxAge && age > elig.maxAge) return false;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (261.2072ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:101:24
 
     // Age gate
     if (elig.minAge && age < elig.minAge) return false;
-    if (elig.maxAge && age > elig.maxAge) return false;
+    if (elig.maxAge && age >= elig.maxAge) return false;
 
     // Income gate
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (274.989ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:101:9
 
     // Age gate
     if (elig.minAge && age < elig.minAge) return false;
-    if (elig.maxAge && age > elig.maxAge) return false;
+    if (true) return false;
 
     // Income gate
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (274.797ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:104:33
     if (elig.maxAge && age > elig.maxAge) return false;
 
     // Income gate
-    if (elig.minAnnualIncome && annualIncome < elig.minAnnualIncome) return false;
+    if (elig.minAnnualIncome && annualIncome >= elig.minAnnualIncome) return false;
 
     // Savings gate
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (314.2136ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:104:9
     if (elig.maxAge && age > elig.maxAge) return false;
 
     // Income gate
-    if (elig.minAnnualIncome && annualIncome < elig.minAnnualIncome) return false;
+    if (true) return false;
 
     // Savings gate
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (314.7371ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:107:9
     if (elig.minAnnualIncome && annualIncome < elig.minAnnualIncome) return false;
 
     // Savings gate
-    if (elig.minMonthlySavings && monthlySavings < elig.minMonthlySavings) return false;
+    if (elig.minMonthlySavings || monthlySavings < elig.minMonthlySavings) return false;
 
     // Special: girl child requirement (skip if user doesn't have one)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (326.9671ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:107:9
     if (elig.minAnnualIncome && annualIncome < elig.minAnnualIncome) return false;
 
     // Savings gate
-    if (elig.minMonthlySavings && monthlySavings < elig.minMonthlySavings) return false;
+    if (true) return false;
 
     // Special: girl child requirement (skip if user doesn't have one)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (338.0645ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:110:9
     if (elig.minMonthlySavings && monthlySavings < elig.minMonthlySavings) return false;
 
     // Special: girl child requirement (skip if user doesn't have one)
-    if (elig.hasGirlChild && !profile.hasGirlChild) return false;
+    if (true) return false;
 
     return true;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (307.4729ms)

[Killed] BooleanLiteral
services/RecommendationPipeline.js:110:30
     if (elig.minMonthlySavings && monthlySavings < elig.minMonthlySavings) return false;
 
     // Special: girl child requirement (skip if user doesn't have one)
-    if (elig.hasGirlChild && !profile.hasGirlChild) return false;
+    if (elig.hasGirlChild && profile.hasGirlChild) return false;
 
     return true;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (378.1985ms)

[Killed] BlockStatement
services/RecommendationPipeline.js:124:32
  * Parse profile into normalized scoring parameters.
  * Reuses backend's getTaxSlab for marginal rate computation.
  */
-function parseProfile(profile) {
-  const age = Number(profile.age) || 30;
-  const annualIncome = Number(profile.annualIncome) || 600000;
-  const savings = Number(profile.savings) || 10000;
-  const risk = (profile.riskCategory || 'Moderate').toLowerCase();
-  const horizon = Number(profile.investmentHorizon) || 10;
-  const goals = profile.goal_type ? [profile.goal_type] : [];
-  const taxRegime = profile.taxRegime || 'new';
-  const mr = getTaxSlab(annualIncome, taxRegime);
-
-  return { age, annualIncome, savings, risk, horizon, goals, taxRegime, mr };
-}
+function parseProfile(profile) {}
 
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (275.3225ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:125:15
  * Reuses backend's getTaxSlab for marginal rate computation.
  */
 function parseProfile(profile) {
-  const age = Number(profile.age) || 30;
+  const age = Number(profile.age) && 30;
   const annualIncome = Number(profile.annualIncome) || 600000;
   const savings = Number(profile.savings) || 10000;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (243.6032ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:125:15
  * Reuses backend's getTaxSlab for marginal rate computation.
  */
 function parseProfile(profile) {
-  const age = Number(profile.age) || 30;
+  const age = true;
   const annualIncome = Number(profile.annualIncome) || 600000;
   const savings = Number(profile.savings) || 10000;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.4221ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:126:24
  */
 function parseProfile(profile) {
   const age = Number(profile.age) || 30;
-  const annualIncome = Number(profile.annualIncome) || 600000;
+  const annualIncome = Number(profile.annualIncome) && 600000;
   const savings = Number(profile.savings) || 10000;
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (300.6831ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:126:24
  */
 function parseProfile(profile) {
   const age = Number(profile.age) || 30;
-  const annualIncome = Number(profile.annualIncome) || 600000;
+  const annualIncome = false;
   const savings = Number(profile.savings) || 10000;
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (362.3693ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:127:19
 function parseProfile(profile) {
   const age = Number(profile.age) || 30;
   const annualIncome = Number(profile.annualIncome) || 600000;
-  const savings = Number(profile.savings) || 10000;
+  const savings = Number(profile.savings) && 10000;
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
   const horizon = Number(profile.investmentHorizon) || 10;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (338.5843ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:127:19
 function parseProfile(profile) {
   const age = Number(profile.age) || 30;
   const annualIncome = Number(profile.annualIncome) || 600000;
-  const savings = Number(profile.savings) || 10000;
+  const savings = true;
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
   const horizon = Number(profile.investmentHorizon) || 10;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (272.6344ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:128:17
   const age = Number(profile.age) || 30;
   const annualIncome = Number(profile.annualIncome) || 600000;
   const savings = Number(profile.savings) || 10000;
-  const risk = (profile.riskCategory || 'Moderate').toLowerCase();
+  const risk = (false).toLowerCase();
   const horizon = Number(profile.investmentHorizon) || 10;
   const goals = profile.goal_type ? [profile.goal_type] : [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (260.5256ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:128:17
   const age = Number(profile.age) || 30;
   const annualIncome = Number(profile.annualIncome) || 600000;
   const savings = Number(profile.savings) || 10000;
-  const risk = (profile.riskCategory || 'Moderate').toLowerCase();
+  const risk = (true).toLowerCase();
   const horizon = Number(profile.investmentHorizon) || 10;
   const goals = profile.goal_type ? [profile.goal_type] : [];
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (315.8316ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:129:19
   const annualIncome = Number(profile.annualIncome) || 600000;
   const savings = Number(profile.savings) || 10000;
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
-  const horizon = Number(profile.investmentHorizon) || 10;
+  const horizon = true;
   const goals = profile.goal_type ? [profile.goal_type] : [];
   const taxRegime = profile.taxRegime || 'new';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (312.3936ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:129:19
   const annualIncome = Number(profile.annualIncome) || 600000;
   const savings = Number(profile.savings) || 10000;
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
-  const horizon = Number(profile.investmentHorizon) || 10;
+  const horizon = false;
   const goals = profile.goal_type ? [profile.goal_type] : [];
   const taxRegime = profile.taxRegime || 'new';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.142ms)

✔ reverseSIP handles zero rate, reachable targets, an

[Killed] ArrayDeclaration
services/RecommendationPipeline.js:130:59
   const savings = Number(profile.savings) || 10000;
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
   const horizon = Number(profile.investmentHorizon) || 10;
-  const goals = profile.goal_type ? [profile.goal_type] : [];
+  const goals = profile.goal_type ? [profile.goal_type] : ["Stryker was here"];
   const taxRegime = profile.taxRegime || 'new';
   const mr = getTaxSlab(annualIncome, taxRegime);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (332.0763ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:131:21
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
   const horizon = Number(profile.investmentHorizon) || 10;
   const goals = profile.goal_type ? [profile.goal_type] : [];
-  const taxRegime = profile.taxRegime || 'new';
+  const taxRegime = true;
   const mr = getTaxSlab(annualIncome, taxRegime);
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (347.9157ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:131:21
   const risk = (profile.riskCategory || 'Moderate').toLowerCase();
   const horizon = Number(profile.investmentHorizon) || 10;
   const goals = profile.goal_type ? [profile.goal_type] : [];
-  const taxRegime = profile.taxRegime || 'new';
+  const taxRegime = false;
   const mr = getTaxSlab(annualIncome, taxRegime);
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.7339ms)

[Killed] ObjectLiteral
services/RecommendationPipeline.js:134:10
   const taxRegime = profile.taxRegime || 'new';
   const mr = getTaxSlab(annualIncome, taxRegime);
 
-  return { age, annualIncome, savings, risk, horizon, goals, taxRegime, mr };
+  return {};
 }
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.646ms)
