[Killed] MethodExpression
services/RecommendationPipeline.js:142:24
  * Mirrors the frontend's weight derivation logic.
  */
 function deriveWeights(p) {
-  const clamp = (v) => Math.max(PIPELINE_CONFIG.WEIGHT_FLOOR, Math.min(PIPELINE_CONFIG.WEIGHT_CEIL, v));
+  const clamp = (v) => Math.min(PIPELINE_CONFIG.WEIGHT_FLOOR, Math.min(PIPELINE_CONFIG.WEIGHT_CEIL, v));
 
   // α — Return: long horizon + high risk → prioritize growth
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (385.9682ms)

[Killed] MethodExpression
services/RecommendationPipeline.js:142:63
  * Mirrors the frontend's weight derivation logic.
  */
 function deriveWeights(p) {
-  const clamp = (v) => Math.max(PIPELINE_CONFIG.WEIGHT_FLOOR, Math.min(PIPELINE_CONFIG.WEIGHT_CEIL, v));
+  const clamp = (v) => Math.max(PIPELINE_CONFIG.WEIGHT_FLOOR, Math.max(PIPELINE_CONFIG.WEIGHT_CEIL, v));
 
   // α — Return: long horizon + high risk → prioritize growth
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (300.1123ms)

[Killed] AssignmentOperator
services/RecommendationPipeline.js:146:24
 
   // α — Return: long horizon + high risk → prioritize growth
   let alpha = 1.0;
-  if (p.horizon >= 15) alpha += 0.5;
+  if (p.horizon >= 15) alpha -= 0.5;
   if (p.horizon >= 20) alpha += 0.3;
   if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (304.874ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:146:7
 
   // α — Return: long horizon + high risk → prioritize growth
   let alpha = 1.0;
-  if (p.horizon >= 15) alpha += 0.5;
+  if (p.horizon > 15) alpha += 0.5;
   if (p.horizon >= 20) alpha += 0.3;
   if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (347.3691ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:147:7
   // α — Return: long horizon + high risk → prioritize growth
   let alpha = 1.0;
   if (p.horizon >= 15) alpha += 0.5;
-  if (p.horizon >= 20) alpha += 0.3;
+  if (true) alpha += 0.3;
   if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
   else if (p.risk === 'conservative') alpha -= 0.3;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (329.2955ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:147:7
   // α — Return: long horizon + high risk → prioritize growth
   let alpha = 1.0;
   if (p.horizon >= 15) alpha += 0.5;
-  if (p.horizon >= 20) alpha += 0.3;
+  if (false) alpha += 0.3;
   if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
   else if (p.risk === 'conservative') alpha -= 0.3;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.7412ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:148:7
   let alpha = 1.0;
   if (p.horizon >= 15) alpha += 0.5;
   if (p.horizon >= 20) alpha += 0.3;
-  if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
+  if (false) alpha += 0.5;
   else if (p.risk === 'conservative') alpha -= 0.3;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (285.7345ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:148:7
   let alpha = 1.0;
   if (p.horizon >= 15) alpha += 0.5;
   if (p.horizon >= 20) alpha += 0.3;
-  if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
+  if (false || p.risk === 'moderate-aggressive') alpha += 0.5;
   else if (p.risk === 'conservative') alpha -= 0.3;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.9852ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:149:12
   if (p.horizon >= 15) alpha += 0.5;
   if (p.horizon >= 20) alpha += 0.3;
   if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
-  else if (p.risk === 'conservative') alpha -= 0.3;
+  else if (true) alpha -= 0.3;
 
   // β — Risk: older age + low risk → penalize risky instruments
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.1437ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:149:12
   if (p.horizon >= 15) alpha += 0.5;
   if (p.horizon >= 20) alpha += 0.3;
   if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') alpha += 0.5;
-  else if (p.risk === 'conservative') alpha -= 0.3;
+  else if (p.risk !== 'conservative') alpha -= 0.3;
 
   // β — Risk: older age + low risk → penalize risky instruments
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (349.9305ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:153:7
 
   // β — Risk: older age + low risk → penalize risky instruments
   let beta = 1.0;
-  if (p.age >= 50) beta += 0.8;
+  if (p.age < 50) beta += 0.8;
   else if (p.age >= 40) beta += 0.4;
   if (p.risk === 'conservative') beta += 0.8;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (309.1486ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:153:7
 
   // β — Risk: older age + low risk → penalize risky instruments
   let beta = 1.0;
-  if (p.age >= 50) beta += 0.8;
+  if (false) beta += 0.8;
   else if (p.age >= 40) beta += 0.4;
   if (p.risk === 'conservative') beta += 0.8;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (405.8705ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:154:12
   // β — Risk: older age + low risk → penalize risky instruments
   let beta = 1.0;
   if (p.age >= 50) beta += 0.8;
-  else if (p.age >= 40) beta += 0.4;
+  else if (false) beta += 0.4;
   if (p.risk === 'conservative') beta += 0.8;
   else if (p.risk === 'aggressive') beta -= 0.4;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (291.456ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:154:12
   // β — Risk: older age + low risk → penalize risky instruments
   let beta = 1.0;
   if (p.age >= 50) beta += 0.8;
-  else if (p.age >= 40) beta += 0.4;
+  else if (p.age < 40) beta += 0.4;
   if (p.risk === 'conservative') beta += 0.8;
   else if (p.risk === 'aggressive') beta -= 0.4;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (327.4794ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:155:7
   let beta = 1.0;
   if (p.age >= 50) beta += 0.8;
   else if (p.age >= 40) beta += 0.4;
-  if (p.risk === 'conservative') beta += 0.8;
+  if (true) beta += 0.8;
   else if (p.risk === 'aggressive') beta -= 0.4;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.5542ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:155:7
   let beta = 1.0;
   if (p.age >= 50) beta += 0.8;
   else if (p.age >= 40) beta += 0.4;
-  if (p.risk === 'conservative') beta += 0.8;
+  if (p.risk !== 'conservative') beta += 0.8;
   else if (p.risk === 'aggressive') beta -= 0.4;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.7918ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:156:12
   if (p.age >= 50) beta += 0.8;
   else if (p.age >= 40) beta += 0.4;
   if (p.risk === 'conservative') beta += 0.8;
-  else if (p.risk === 'aggressive') beta -= 0.4;
+  else if (true) beta -= 0.4;
 
   // γ — Tax: high slab → penalize slab-taxed instruments
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (256.594ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:156:12
   if (p.age >= 50) beta += 0.8;
   else if (p.age >= 40) beta += 0.4;
   if (p.risk === 'conservative') beta += 0.8;
-  else if (p.risk === 'aggressive') beta -= 0.4;
+  else if (false) beta -= 0.4;
 
   // γ — Tax: high slab → penalize slab-taxed instruments
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (280.8338ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:159:15
   else if (p.risk === 'aggressive') beta -= 0.4;
 
   // γ — Tax: high slab → penalize slab-taxed instruments
-  let gamma = p.mr > 0 ? (p.mr / 0.312) * 1.5 : 0;
+  let gamma = false ? (p.mr / 0.312) * 1.5 : 0;
 
   // δ — Liquidity
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.278ms)

[Killed] ArithmeticOperator
services/RecommendationPipeline.js:159:26
   else if (p.risk === 'aggressive') beta -= 0.4;
 
   // γ — Tax: high slab → penalize slab-taxed instruments
-  let gamma = p.mr > 0 ? (p.mr / 0.312) * 1.5 : 0;
+  let gamma = p.mr > 0 ? p.mr / 0.312 / 1.5 : 0;
 
   // δ — Liquidity
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (261.424ms)

[Killed] ArithmeticOperator
services/RecommendationPipeline.js:163:48
 
   // δ — Liquidity
   let delta = 0.8;
-  const emergencyCover = p.annualIncome > 0 ? (p.savings * 12 / p.annualIncome) : 0;
+  const emergencyCover = p.annualIncome > 0 ? (p.savings / 12 / p.annualIncome) : 0;
   if (emergencyCover < 0.2) delta += 0.6;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (286.8969ms)

[Killed] ArithmeticOperator
services/RecommendationPipeline.js:163:48
 
   // δ — Liquidity
   let delta = 0.8;
-  const emergencyCover = p.annualIncome > 0 ? (p.savings * 12 / p.annualIncome) : 0;
+  const emergencyCover = p.annualIncome > 0 ? (p.savings * 12 * p.annualIncome) : 0;
   if (emergencyCover < 0.2) delta += 0.6;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (347.8305ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:164:7
   // δ — Liquidity
   let delta = 0.8;
   const emergencyCover = p.annualIncome > 0 ? (p.savings * 12 / p.annualIncome) : 0;
-  if (emergencyCover < 0.2) delta += 0.6;
+  if (true) delta += 0.6;
 
   // ε — Goal alignment
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (326.9666ms)

[Killed] AssignmentOperator
services/RecommendationPipeline.js:164:29
   // δ — Liquidity
   let delta = 0.8;
   const emergencyCover = p.annualIncome > 0 ? (p.savings * 12 / p.annualIncome) : 0;
-  if (emergencyCover < 0.2) delta += 0.6;
+  if (emergencyCover < 0.2) delta -= 0.6;
 
   // ε — Goal alignment
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (279.2323ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:167:17
   if (emergencyCover < 0.2) delta += 0.6;
 
   // ε — Goal alignment
-  let epsilon = p.goals.length > 0 ? 1.2 : 0.5;
+  let epsilon = false ? 1.2 : 0.5;
 
   // ζ — Horizon match
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.5583ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:167:17
   if (emergencyCover < 0.2) delta += 0.6;
 
   // ε — Goal alignment
-  let epsilon = p.goals.length > 0 ? 1.2 : 0.5;
+  let epsilon = p.goals.length <= 0 ? 1.2 : 0.5;
 
   // ζ — Horizon match
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (315.2709ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:171:7
 
   // ζ — Horizon match
   let zeta = 1.0;
-  if (p.horizon <= 3) zeta += 0.5;
+  if (p.horizon > 3) zeta += 0.5;
   if (p.horizon >= 20) zeta += 0.3;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (388.261ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:171:7
 
   // ζ — Horizon match
   let zeta = 1.0;
-  if (p.horizon <= 3) zeta += 0.5;
+  if (false) zeta += 0.5;
   if (p.horizon >= 20) zeta += 0.3;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (297.1366ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:172:7
   // ζ — Horizon match
   let zeta = 1.0;
   if (p.horizon <= 3) zeta += 0.5;
-  if (p.horizon >= 20) zeta += 0.3;
+  if (true) zeta += 0.3;
 
   // η — Cost
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.5022ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:172:7
   // ζ — Horizon match
   let zeta = 1.0;
   if (p.horizon <= 3) zeta += 0.5;
-  if (p.horizon >= 20) zeta += 0.3;
+  if (p.horizon < 20) zeta += 0.3;
 
   // η — Cost
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (272.1944ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:176:7
 
   // η — Cost
   let eta = 0.5;
-  if (p.horizon >= 10) eta += 0.3;
+  if (p.horizon > 10) eta += 0.3;
   if (p.horizon >= 20) eta += 0.4;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (273.4765ms)

[Killed] AssignmentOperator
services/RecommendationPipeline.js:176:24
 
   // η — Cost
   let eta = 0.5;
-  if (p.horizon >= 10) eta += 0.3;
+  if (p.horizon >= 10) eta -= 0.3;
   if (p.horizon >= 20) eta += 0.4;
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (286.9211ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:177:7
   // η — Cost
   let eta = 0.5;
   if (p.horizon >= 10) eta += 0.3;
-  if (p.horizon >= 20) eta += 0.4;
+  if (false) eta += 0.4;
 
   return {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (272.6453ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:177:7
   // η — Cost
   let eta = 0.5;
   if (p.horizon >= 10) eta += 0.3;
-  if (p.horizon >= 20) eta += 0.4;
+  if (true) eta += 0.4;
 
   return {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.2957ms)

[Killed] BlockStatement
services/RecommendationPipeline.js:187:35
 
 // ── Individual scoring sub-functions ────────────────────────────────
 
-function scoreReturn(postTaxRate) {
-  return postTaxRate * PIPELINE_CONFIG.RETURN_MULTIPLIER;
-}
+function scoreReturn(postTaxRate) {}
 
 function scoreRisk(inv, p) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.4974ms)

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:188:10
 // ── Individual scoring sub-functions ────────────────────────────────
 
 function scoreReturn(postTaxRate) {
-  return postTaxRate * PIPELINE_CONFIG.RETURN_MULTIPLIER;
+  return postTaxRate / PIPELINE_CONFIG.RETURN_MULTIPLIER;
 }
 

[Killed] BlockStatement
services/RecommendationPipeline.js:191:28
   return postTaxRate * PIPELINE_CONFIG.RETURN_MULTIPLIER;
 }
 
-function scoreRisk(inv, p) {
-  const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk || 3);
-  let idealMin, idealMax;
-  if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
-  else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
-  else { idealMin = 2; idealMax = 4; }
-
-  if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
-  const dist = invRisk < idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
-  if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
-
-  let penalty = PIPELINE_CONFIG.RISK_SEVERE_PENALTY;
-  const vol = inv.volatility;
-  if (vol !== undefined && vol !== null) {
-    const volExcess = Math.max(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
-    if (p.risk === 'conservative') penalty += volExcess * 40;
-  }
-  return penalty;
-}
+function scoreRisk(inv, p) {}
 
 function scoreTax(inv, p) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.3894ms)

[Survived] LogicalOperator
services/RecommendationPipeline.js:192:72
 }
 
 function scoreRisk(inv, p) {
-  const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk || 3);
+  const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk && 3);
   let idealMin, idealMax;
   if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }

[Survived] ConditionalExpression
services/RecommendationPipeline.js:192:19
 }
 
 function scoreRisk(inv, p) {
-  const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk || 3);
+  const invRisk = true ? inv.riskLevel : (inv.risk || 3);
   let idealMin, idealMax;
   if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }

[Killed] EqualityOperator
services/RecommendationPipeline.js:194:7
 function scoreRisk(inv, p) {
   const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk || 3);
   let idealMin, idealMax;
-  if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
+  if (p.risk !== 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
   else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
   else { idealMin = 2; idealMax = 4; }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (288.0953ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:194:7
 function scoreRisk(inv, p) {
   const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk || 3);
   let idealMin, idealMax;
-  if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
+  if (p.risk === 'conservative' && p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
   else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
   else { idealMin = 2; idealMax = 4; }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (292.8339ms)

[Survived] EqualityOperator
services/RecommendationPipeline.js:195:12
   const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk || 3);
   let idealMin, idealMax;
   if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
-  else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
+  else if (p.risk !== 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
   else { idealMin = 2; idealMax = 4; }
 

[Survived] ConditionalExpression
services/RecommendationPipeline.js:195:12
   const invRisk = typeof inv.riskLevel === 'number' ? inv.riskLevel : (inv.risk || 3);
   let idealMin, idealMax;
   if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
-  else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
+  else if (false) { idealMin = 3; idealMax = 5; }
   else { idealMin = 2; idealMax = 4; }
 
