[Survived] BlockStatement
services/RecommendationPipeline.js:196:8
   let idealMin, idealMax;
   if (p.risk === 'conservative' || p.risk === 'conservative-moderate') { idealMin = 1; idealMax = 2; }
   else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
-  else { idealMin = 2; idealMax = 4; }
+  else {}
 
   if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;

[Killed] ConditionalExpression
services/RecommendationPipeline.js:198:7
   else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
   else { idealMin = 2; idealMax = 4; }
 
-  if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
+  if (false) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
   const dist = invRisk < idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
   if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (352.8338ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:198:7
   else if (p.risk === 'aggressive' || p.risk === 'moderate-aggressive') { idealMin = 3; idealMax = 5; }
   else { idealMin = 2; idealMax = 4; }
 
-  if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
+  if (invRisk >= idealMin || invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
   const dist = invRisk < idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
   if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (339.9404ms)

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:199:38
   else { idealMin = 2; idealMax = 4; }
 
   if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
-  const dist = invRisk < idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
+  const dist = invRisk < idealMin ? (idealMin + invRisk) : (invRisk - idealMax);
   if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
 

[Survived] EqualityOperator
services/RecommendationPipeline.js:199:16
   else { idealMin = 2; idealMax = 4; }
 
   if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
-  const dist = invRisk < idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
+  const dist = invRisk <= idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
   if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
 

[Killed] ArithmeticOperator
services/RecommendationPipeline.js:200:26
 
   if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
   const dist = invRisk < idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
-  if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
+  if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS - PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
 
   let penalty = PIPELINE_CONFIG.RISK_SEVERE_PENALTY;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (311.6562ms)

[Survived] ConditionalExpression
services/RecommendationPipeline.js:200:7
 
   if (invRisk >= idealMin && invRisk <= idealMax) return -PIPELINE_CONFIG.RISK_PERFECT_BONUS;
   const dist = invRisk < idealMin ? (idealMin - invRisk) : (invRisk - idealMax);
-  if (dist === 1) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
+  if (false) return -PIPELINE_CONFIG.RISK_CLOSE_BONUS + PIPELINE_CONFIG.RISK_MISMATCH_PENALTY;
 
   let penalty = PIPELINE_CONFIG.RISK_SEVERE_PENALTY;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:204:7
 
   let penalty = PIPELINE_CONFIG.RISK_SEVERE_PENALTY;
   const vol = inv.volatility;
-  if (vol !== undefined && vol !== null) {
+  if (false) {
     const volExcess = Math.max(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
     if (p.risk === 'conservative') penalty += volExcess * 40;

[Survived] LogicalOperator
services/RecommendationPipeline.js:204:7
 
   let penalty = PIPELINE_CONFIG.RISK_SEVERE_PENALTY;
   const vol = inv.volatility;
-  if (vol !== undefined && vol !== null) {
+  if (vol !== undefined || vol !== null) {
     const volExcess = Math.max(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
     if (p.risk === 'conservative') penalty += volExcess * 40;

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:205:35
   let penalty = PIPELINE_CONFIG.RISK_SEVERE_PENALTY;
   const vol = inv.volatility;
   if (vol !== undefined && vol !== null) {
-    const volExcess = Math.max(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
+    const volExcess = Math.max(0, vol + PIPELINE_CONFIG.VOLATILITY_BASELINE);
     if (p.risk === 'conservative') penalty += volExcess * 40;
   }

[Survived] MethodExpression
services/RecommendationPipeline.js:205:23
   let penalty = PIPELINE_CONFIG.RISK_SEVERE_PENALTY;
   const vol = inv.volatility;
   if (vol !== undefined && vol !== null) {
-    const volExcess = Math.max(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
+    const volExcess = Math.min(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
     if (p.risk === 'conservative') penalty += volExcess * 40;
   }

[Survived] ConditionalExpression
services/RecommendationPipeline.js:206:9
   const vol = inv.volatility;
   if (vol !== undefined && vol !== null) {
     const volExcess = Math.max(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
-    if (p.risk === 'conservative') penalty += volExcess * 40;
+    if (true) penalty += volExcess * 40;
   }
   return penalty;

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:206:47
   const vol = inv.volatility;
   if (vol !== undefined && vol !== null) {
     const volExcess = Math.max(0, vol - PIPELINE_CONFIG.VOLATILITY_BASELINE);
-    if (p.risk === 'conservative') penalty += volExcess * 40;
+    if (p.risk === 'conservative') penalty += volExcess / 40;
   }
   return penalty;

[Killed] BlockStatement
services/RecommendationPipeline.js:211:27
   return penalty;
 }
 
-function scoreTax(inv, p) {
-  const taxEff = inv.taxEfficiencyScore;
-  if (taxEff !== undefined && taxEff !== null) {
-    return (5 - taxEff) * p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
-  }
-  // Fallback: use taxType
-  if (inv.taxType === 'eee') return -12;
-  if (inv.taxType === 'slab') return p.mr * 20;
-  return 0;
-}
+function scoreTax(inv, p) {}
 
 function scoreLiquidity(inv) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (406.9182ms)

[Survived] LogicalOperator
services/RecommendationPipeline.js:213:7
 
 function scoreTax(inv, p) {
   const taxEff = inv.taxEfficiencyScore;
-  if (taxEff !== undefined && taxEff !== null) {
+  if (taxEff !== undefined || taxEff !== null) {
     return (5 - taxEff) * p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
   }

[Survived] ConditionalExpression
services/RecommendationPipeline.js:213:31
 
 function scoreTax(inv, p) {
   const taxEff = inv.taxEfficiencyScore;
-  if (taxEff !== undefined && taxEff !== null) {
+  if (taxEff !== undefined && true) {
     return (5 - taxEff) * p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
   }

[Killed] ArithmeticOperator
services/RecommendationPipeline.js:214:12
 function scoreTax(inv, p) {
   const taxEff = inv.taxEfficiencyScore;
   if (taxEff !== undefined && taxEff !== null) {
-    return (5 - taxEff) * p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
+    return (5 - taxEff) / p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
   }
   // Fallback: use taxType
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (325.5695ms)

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:214:12
 function scoreTax(inv, p) {
   const taxEff = inv.taxEfficiencyScore;
   if (taxEff !== undefined && taxEff !== null) {
-    return (5 - taxEff) * p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
+    return (5 - taxEff) * p.mr / PIPELINE_CONFIG.TAX_PENALTY_SCALE;
   }
   // Fallback: use taxType

[Survived] UnaryOperator
services/RecommendationPipeline.js:217:37
     return (5 - taxEff) * p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
   }
   // Fallback: use taxType
-  if (inv.taxType === 'eee') return -12;
+  if (inv.taxType === 'eee') return +12;
   if (inv.taxType === 'slab') return p.mr * 20;
   return 0;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:217:7
     return (5 - taxEff) * p.mr * PIPELINE_CONFIG.TAX_PENALTY_SCALE;
   }
   // Fallback: use taxType
-  if (inv.taxType === 'eee') return -12;
+  if (true) return -12;
   if (inv.taxType === 'slab') return p.mr * 20;
   return 0;

[Survived] EqualityOperator
services/RecommendationPipeline.js:218:7
   }
   // Fallback: use taxType
   if (inv.taxType === 'eee') return -12;
-  if (inv.taxType === 'slab') return p.mr * 20;
+  if (inv.taxType !== 'slab') return p.mr * 20;
   return 0;
 }

[Survived] ConditionalExpression
services/RecommendationPipeline.js:218:7
   }
   // Fallback: use taxType
   if (inv.taxType === 'eee') return -12;
-  if (inv.taxType === 'slab') return p.mr * 20;
+  if (true) return p.mr * 20;
   return 0;
 }

[Killed] BlockStatement
services/RecommendationPipeline.js:222:30
   return 0;
 }
 
-function scoreLiquidity(inv) {
-  const liq = inv.liquidityScore;
-  if (liq !== undefined && liq !== null) {
-    return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
-  }
-  if (inv.lockIn === 0) return 5;
-  if (inv.lockIn <= 3) return 2;
-  return 0;
-}
+function scoreLiquidity(inv) {}
 
 function scoreGoal(inv, p) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (292.8187ms)

[Survived] ConditionalExpression
services/RecommendationPipeline.js:224:28
 
 function scoreLiquidity(inv) {
   const liq = inv.liquidityScore;
-  if (liq !== undefined && liq !== null) {
+  if (liq !== undefined && true) {
     return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }

[Survived] LogicalOperator
services/RecommendationPipeline.js:224:7
 
 function scoreLiquidity(inv) {
   const liq = inv.liquidityScore;
-  if (liq !== undefined && liq !== null) {
+  if (liq !== undefined || liq !== null) {
     return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:225:24
 function scoreLiquidity(inv) {
   const liq = inv.liquidityScore;
   if (liq !== undefined && liq !== null) {
-    return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
+    return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) / PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }
   if (inv.lockIn === 0) return 5;

[Survived] MethodExpression
services/RecommendationPipeline.js:225:12
 function scoreLiquidity(inv) {
   const liq = inv.liquidityScore;
   if (liq !== undefined && liq !== null) {
-    return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
+    return Math.min(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }
   if (inv.lockIn === 0) return 5;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:227:7
   if (liq !== undefined && liq !== null) {
     return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }
-  if (inv.lockIn === 0) return 5;
+  if (true) return 5;
   if (inv.lockIn <= 3) return 2;
   return 0;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:227:7
   if (liq !== undefined && liq !== null) {
     return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }
-  if (inv.lockIn === 0) return 5;
+  if (false) return 5;
   if (inv.lockIn <= 3) return 2;
   return 0;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:228:7
     return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }
   if (inv.lockIn === 0) return 5;
-  if (inv.lockIn <= 3) return 2;
+  if (false) return 2;
   return 0;
 }

[Survived] EqualityOperator
services/RecommendationPipeline.js:228:7
     return Math.max(0, (liq - PIPELINE_CONFIG.LIQUIDITY_CENTER) * PIPELINE_CONFIG.LIQUIDITY_SCALE);
   }
   if (inv.lockIn === 0) return 5;
-  if (inv.lockIn <= 3) return 2;
+  if (inv.lockIn < 3) return 2;
   return 0;
 }

[Killed] BlockStatement
services/RecommendationPipeline.js:232:28
   return 0;
 }
 
-function scoreGoal(inv, p) {
-  const tags = inv.goalTags;
-  if (tags && Array.isArray(tags) && tags.length > 0) {
-    const matchCount = p.goals.filter(g => tags.includes(g)).length;
-    return Math.min(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);
-  }
-  return 0;
-}
+function scoreGoal(inv, p) {}
 
 function scoreHorizon(inv, p) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (295.2565ms)

[Survived] ConditionalExpression
services/RecommendationPipeline.js:234:38
 
 function scoreGoal(inv, p) {
   const tags = inv.goalTags;
-  if (tags && Array.isArray(tags) && tags.length > 0) {
+  if (tags && Array.isArray(tags) && true) {
     const matchCount = p.goals.filter(g => tags.includes(g)).length;
     return Math.min(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);

[Survived] LogicalOperator
services/RecommendationPipeline.js:234:7
 
 function scoreGoal(inv, p) {
   const tags = inv.goalTags;
-  if (tags && Array.isArray(tags) && tags.length > 0) {
+  if (tags && Array.isArray(tags) || tags.length > 0) {
     const matchCount = p.goals.filter(g => tags.includes(g)).length;
     return Math.min(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);

[Survived] ArrowFunction
services/RecommendationPipeline.js:235:39
 function scoreGoal(inv, p) {
   const tags = inv.goalTags;
   if (tags && Array.isArray(tags) && tags.length > 0) {
-    const matchCount = p.goals.filter(g => tags.includes(g)).length;
+    const matchCount = p.goals.filter(() => undefined).length;
     return Math.min(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);
   }

[Survived] MethodExpression
services/RecommendationPipeline.js:235:24
 function scoreGoal(inv, p) {
   const tags = inv.goalTags;
   if (tags && Array.isArray(tags) && tags.length > 0) {
-    const matchCount = p.goals.filter(g => tags.includes(g)).length;
+    const matchCount = p.goals.length;
     return Math.min(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);
   }

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:236:21
   const tags = inv.goalTags;
   if (tags && Array.isArray(tags) && tags.length > 0) {
     const matchCount = p.goals.filter(g => tags.includes(g)).length;
-    return Math.min(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);
+    return Math.min(matchCount / PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);
   }
   return 0;

[Survived] MethodExpression
services/RecommendationPipeline.js:236:12
   const tags = inv.goalTags;
   if (tags && Array.isArray(tags) && tags.length > 0) {
     const matchCount = p.goals.filter(g => tags.includes(g)).length;
-    return Math.min(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);
+    return Math.max(matchCount * PIPELINE_CONFIG.GOAL_TAG_POINTS, PIPELINE_CONFIG.GOAL_TAG_CAP);
   }
   return 0;

[Killed] BlockStatement
services/RecommendationPipeline.js:241:31
   return 0;
 }
 
-function scoreHorizon(inv, p) {
-  let score = 0;
-  const lockIn = inv.lockIn || 0;
-  if (lockIn <= p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
-  if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
-
-  const ideal = inv.idealHorizon;
-  if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
-    if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
-      score += PIPELINE_CONFIG.HORIZON_PERFECT;
-    } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
-      score += PIPELINE_CONFIG.HORIZON_GOOD;
-    } else if (p.horizon >= ideal.min - 5) {
-      score += PIPELINE_CONFIG.HORIZON_PARTIAL;
-    }
-    if (p.horizon < ideal.min - 5) {
-      score -= PIPELINE_CONFIG.HORIZON_SEVERE_MISMATCH_PENALTY;
-    }
-  }
-  return score;
-}
+function scoreHorizon(inv, p) {}
 
 function scoreCost(inv) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (266.6988ms)

[Survived] ConditionalExpression
services/RecommendationPipeline.js:243:18
 
 function scoreHorizon(inv, p) {
   let score = 0;
-  const lockIn = inv.lockIn || 0;
+  const lockIn = true;
   if (lockIn <= p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
   if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:243:18
 
 function scoreHorizon(inv, p) {
   let score = 0;
-  const lockIn = inv.lockIn || 0;
+  const lockIn = false;
   if (lockIn <= p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
   if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:244:7
 function scoreHorizon(inv, p) {
   let score = 0;
   const lockIn = inv.lockIn || 0;
-  if (lockIn <= p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
+  if (false) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
   if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
 

[Survived] EqualityOperator
services/RecommendationPipeline.js:244:7
 function scoreHorizon(inv, p) {
   let score = 0;
   const lockIn = inv.lockIn || 0;
-  if (lockIn <= p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
+  if (lockIn > p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
   if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
 

[Survived] AssignmentOperator
services/RecommendationPipeline.js:245:21
   let score = 0;
   const lockIn = inv.lockIn || 0;
   if (lockIn <= p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
-  if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
+  if (lockIn === 0) score -= PIPELINE_CONFIG.HORIZON_NO_LOCK;
 
   const ideal = inv.idealHorizon;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:245:7
   let score = 0;
   const lockIn = inv.lockIn || 0;
   if (lockIn <= p.horizon) score += PIPELINE_CONFIG.HORIZON_LOCK_FIT;
-  if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
+  if (false) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
 
   const ideal = inv.idealHorizon;

[Killed] EqualityOperator
services/RecommendationPipeline.js:248:43
   if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
 
   const ideal = inv.idealHorizon;
-  if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
+  if (ideal && ideal.min !== undefined && ideal.max === undefined) {
     if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (333.7558ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:248:7
   if (lockIn === 0) score += PIPELINE_CONFIG.HORIZON_NO_LOCK;
 
   const ideal = inv.idealHorizon;
-  if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
+  if (false) {
     if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (291.5832ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:249:35
 
   const ideal = inv.idealHorizon;
   if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
-    if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
+    if (p.horizon >= ideal.min && p.horizon < ideal.max) {
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
     } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (374.0277ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:249:35
 
   const ideal = inv.idealHorizon;
   if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
-    if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
+    if (p.horizon >= ideal.min && true) {
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
     } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (291.4647ms)

[Killed] AssignmentOperator
services/RecommendationPipeline.js:250:7
   const ideal = inv.idealHorizon;
   if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
     if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
-      score += PIPELINE_CONFIG.HORIZON_PERFECT;
+      score -= PIPELINE_CONFIG.HORIZON_PERFECT;
     } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
       score += PIPELINE_CONFIG.HORIZON_GOOD;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.0191ms)

[Survived] EqualityOperator
services/RecommendationPipeline.js:251:16
   if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
     if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
-    } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
+    } else if (p.horizon < ideal.min - 2 && p.horizon <= ideal.max + 5) {
       score += PIPELINE_CONFIG.HORIZON_GOOD;
     } else if (p.horizon >= ideal.min - 5) {

[Survived] ConditionalExpression
services/RecommendationPipeline.js:251:16
   if (ideal && ideal.min !== undefined && ideal.max !== undefined) {
     if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
-    } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
+    } else if (true) {
       score += PIPELINE_CONFIG.HORIZON_GOOD;
     } else if (p.horizon >= ideal.min - 5) {

[Survived] AssignmentOperator
services/RecommendationPipeline.js:252:7
     if (p.horizon >= ideal.min && p.horizon <= ideal.max) {
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
     } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
-      score += PIPELINE_CONFIG.HORIZON_GOOD;
+      score -= PIPELINE_CONFIG.HORIZON_GOOD;
     } else if (p.horizon >= ideal.min - 5) {
       score += PIPELINE_CONFIG.HORIZON_PARTIAL;

[Survived] BlockStatement
services/RecommendationPipeline.js:253:44
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
     } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
       score += PIPELINE_CONFIG.HORIZON_GOOD;
-    } else if (p.horizon >= ideal.min - 5) {
-      score += PIPELINE_CONFIG.HORIZON_PARTIAL;
-    }
+    } else if (p.horizon >= ideal.min - 5) {}
     if (p.horizon < ideal.min - 5) {
       score -= PIPELINE_CONFIG.HORIZON_SEVERE_MISMATCH_PENALTY;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:253:16
       score += PIPELINE_CONFIG.HORIZON_PERFECT;
     } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
       score += PIPELINE_CONFIG.HORIZON_GOOD;
-    } else if (p.horizon >= ideal.min - 5) {
+    } else if (true) {
       score += PIPELINE_CONFIG.HORIZON_PARTIAL;
     }

[Survived] AssignmentOperator
services/RecommendationPipeline.js:254:7
     } else if (p.horizon >= ideal.min - 2 && p.horizon <= ideal.max + 5) {
       score += PIPELINE_CONFIG.HORIZON_GOOD;
     } else if (p.horizon >= ideal.min - 5) {
-      score += PIPELINE_CONFIG.HORIZON_PARTIAL;
+      score -= PIPELINE_CONFIG.HORIZON_PARTIAL;
     }
     if (p.horizon < ideal.min - 5) {

[Survived] EqualityOperator
services/RecommendationPipeline.js:256:9
     } else if (p.horizon >= ideal.min - 5) {
       score += PIPELINE_CONFIG.HORIZON_PARTIAL;
     }
-    if (p.horizon < ideal.min - 5) {
+    if (p.horizon >= ideal.min - 5) {
       score -= PIPELINE_CONFIG.HORIZON_SEVERE_MISMATCH_PENALTY;
     }

[Survived] ArithmeticOperator
services/RecommendationPipeline.js:256:21
     } else if (p.horizon >= ideal.min - 5) {
       score += PIPELINE_CONFIG.HORIZON_PARTIAL;
     }
-    if (p.horizon < ideal.min - 5) {
+    if (p.horizon < ideal.min + 5) {
       score -= PIPELINE_CONFIG.HORIZON_SEVERE_MISMATCH_PENALTY;
     }

[Survived] AssignmentOperator
services/RecommendationPipeline.js:257:7
       score += PIPELINE_CONFIG.HORIZON_PARTIAL;
     }
     if (p.horizon < ideal.min - 5) {
-      score -= PIPELINE_CONFIG.HORIZON_SEVERE_MISMATCH_PENALTY;
+      score += PIPELINE_CONFIG.HORIZON_SEVERE_MISMATCH_PENALTY;
     }
   }

[Killed] BlockStatement
services/RecommendationPipeline.js:263:25
   return score;
 }
 
-function scoreCost(inv) {
-  const er = inv.expenseRatio;
-  if (er !== undefined && er !== null) {
-    if (er === 0) return -PIPELINE_CONFIG.COST_FREE_BONUS;
-    return er * PIPELINE_CONFIG.COST_PENALTY_SCALE;
-  }
-  return 0;
-}
+function scoreCost(inv) {}
 
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (273.2032ms)
