[Killed] LogicalOperator
services/RecommendationPipeline.js:367:19
   if (usedClasses.size < minClasses && ranked.length > topN) {
     const remaining = ranked.filter(inv => !usedIds.has(inv.id));
     for (const candidate of remaining) {
-      const cls = candidate.assetClass || candidate.category || candidate.type;
+      const cls = candidate.assetClass && candidate.category || candidate.type;
       if (!usedClasses.has(cls)) {
         // Replace the lowest-scored item in result
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (281.3269ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:368:11
     const remaining = ranked.filter(inv => !usedIds.has(inv.id));
     for (const candidate of remaining) {
       const cls = candidate.assetClass || candidate.category || candidate.type;
-      if (!usedClasses.has(cls)) {
+      if (false) {
         // Replace the lowest-scored item in result
         const lowestIdx = result.length - 1;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (284.7956ms)

[Killed] BooleanLiteral
services/RecommendationPipeline.js:368:11
     const remaining = ranked.filter(inv => !usedIds.has(inv.id));
     for (const candidate of remaining) {
       const cls = candidate.assetClass || candidate.category || candidate.type;
-      if (!usedClasses.has(cls)) {
+      if (usedClasses.has(cls)) {
         // Replace the lowest-scored item in result
         const lowestIdx = result.length - 1;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.1334ms)

[Killed] ArithmeticOperator
services/RecommendationPipeline.js:370:27
       const cls = candidate.assetClass || candidate.category || candidate.type;
       if (!usedClasses.has(cls)) {
         // Replace the lowest-scored item in result
-        const lowestIdx = result.length - 1;
+        const lowestIdx = result.length + 1;
         const removed = result[lowestIdx];
         usedClasses.delete(removed.assetClass || removed.category || removed.type);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (350.886ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:372:28
         // Replace the lowest-scored item in result
         const lowestIdx = result.length - 1;
         const removed = result[lowestIdx];
-        usedClasses.delete(removed.assetClass || removed.category || removed.type);
+        usedClasses.delete(false);
         result[lowestIdx] = candidate;
         usedIds.delete(removed.id);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (300.8274ms)
✔ reverseSIP handles zero rate, reachable targets,

[Killed] ConditionalExpression
services/RecommendationPipeline.js:372:28
         // Replace the lowest-scored item in result
         const lowestIdx = result.length - 1;
         const removed = result[lowestIdx];
-        usedClasses.delete(removed.assetClass || removed.category || removed.type);
+        usedClasses.delete(false || removed.type);
         result[lowestIdx] = candidate;
         usedIds.delete(removed.id);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (281.5234ms)

[Killed] EqualityOperator
services/RecommendationPipeline.js:377:13
         usedIds.delete(removed.id);
         usedIds.add(candidate.id);
         usedClasses.add(cls);
-        if (usedClasses.size >= minClasses) break;
+        if (usedClasses.size < minClasses) break;
       }
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (329.2355ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:377:13
         usedIds.delete(removed.id);
         usedIds.add(candidate.id);
         usedClasses.add(cls);
-        if (usedClasses.size >= minClasses) break;
+        if (true) break;
       }
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.407ms)
✔ reverseSIP handles zero rate, reachable targets,

[Killed] StringLiteral
services/RecommendationPipeline.js:395:38
  * Used for tax computation and Monte Carlo parameter lookup.
  */
 const CATALOG_TO_BACKEND = {
-  ppf: 'PPF', scss: 'SCSS', sukanya: 'SSY',
+  ppf: 'PPF', scss: 'SCSS', sukanya: "",
   rbi_bonds: 'RBI_Bond', sgb: 'SGB', nps: 'NPS',
   fd: 'FD', liquid_mf: 'Liquid_MF', debt_mf: 'Debt_MF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (306.0587ms)

[Killed] StringLiteral
services/RecommendationPipeline.js:395:8
  * Used for tax computation and Monte Carlo parameter lookup.
  */
 const CATALOG_TO_BACKEND = {
-  ppf: 'PPF', scss: 'SCSS', sukanya: 'SSY',
+  ppf: "", scss: 'SCSS', sukanya: 'SSY',
   rbi_bonds: 'RBI_Bond', sgb: 'SGB', nps: 'NPS',
   fd: 'FD', liquid_mf: 'Liquid_MF', debt_mf: 'Debt_MF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (317.7532ms)

[Survived] StringLiteral
services/RecommendationPipeline.js:399:46
   rbi_bonds: 'RBI_Bond', sgb: 'SGB', nps: 'NPS',
   fd: 'FD', liquid_mf: 'Liquid_MF', debt_mf: 'Debt_MF',
   hybrid_mf: 'Hybrid_MF', index_mf: 'Index_MF',
-  elss: 'ELSS', equity_mf: 'Equity_MF', etf: 'ETF',
+  elss: 'ELSS', equity_mf: 'Equity_MF', etf: "",
   gold_etf: 'Gold', nifty_etf: 'ETF',
   midcap_mf: 'Midcap_MF', smallcap_mf: 'Smallcap_MF',

[Survived] StringLiteral
services/RecommendationPipeline.js:399:28
   rbi_bonds: 'RBI_Bond', sgb: 'SGB', nps: 'NPS',
   fd: 'FD', liquid_mf: 'Liquid_MF', debt_mf: 'Debt_MF',
   hybrid_mf: 'Hybrid_MF', index_mf: 'Index_MF',
-  elss: 'ELSS', equity_mf: 'Equity_MF', etf: 'ETF',
+  elss: 'ELSS', equity_mf: "", etf: 'ETF',
   gold_etf: 'Gold', nifty_etf: 'ETF',
   midcap_mf: 'Midcap_MF', smallcap_mf: 'Smallcap_MF',

[Survived] StringLiteral
services/RecommendationPipeline.js:400:32
   fd: 'FD', liquid_mf: 'Liquid_MF', debt_mf: 'Debt_MF',
   hybrid_mf: 'Hybrid_MF', index_mf: 'Index_MF',
   elss: 'ELSS', equity_mf: 'Equity_MF', etf: 'ETF',
-  gold_etf: 'Gold', nifty_etf: 'ETF',
+  gold_etf: 'Gold', nifty_etf: "",
   midcap_mf: 'Midcap_MF', smallcap_mf: 'Smallcap_MF',
   arbitrage_mf: 'Arbitrage_MF', direct_equity: 'Equity_MF',

[Survived] StringLiteral
services/RecommendationPipeline.js:402:48
   elss: 'ELSS', equity_mf: 'Equity_MF', etf: 'ETF',
   gold_etf: 'Gold', nifty_etf: 'ETF',
   midcap_mf: 'Midcap_MF', smallcap_mf: 'Smallcap_MF',
-  arbitrage_mf: 'Arbitrage_MF', direct_equity: 'Equity_MF',
+  arbitrage_mf: 'Arbitrage_MF', direct_equity: "",
 };
 

[Killed] StringLiteral
services/RecommendationPipeline.js:407:17
 
 // Extended mappings for instruments that share a core type
 const CATEGORY_TO_BACKEND = {
-  'Government': 'RBI_Bond',
+  'Government': "",
   'Gold': 'Gold',
   'Retirement': 'NPS',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (289.299ms)

[Killed] StringLiteral
services/RecommendationPipeline.js:410:20
   'Government': 'RBI_Bond',
   'Gold': 'Gold',
   'Retirement': 'NPS',
-  'Bank Deposits': 'FD',
+  'Bank Deposits': "",
   'Debt Mutual Funds': 'Debt_MF',
   'Equity Mutual Funds': 'Equity_MF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (339.5611ms)

[Killed] StringLiteral
services/RecommendationPipeline.js:412:26
   'Retirement': 'NPS',
   'Bank Deposits': 'FD',
   'Debt Mutual Funds': 'Debt_MF',
-  'Equity Mutual Funds': 'Equity_MF',
+  'Equity Mutual Funds': "",
   'ETFs': 'ETF',
   'REITs & InvITs': 'ETF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (416.5998ms)

[Killed] StringLiteral
services/RecommendationPipeline.js:413:11
   'Bank Deposits': 'FD',
   'Debt Mutual Funds': 'Debt_MF',
   'Equity Mutual Funds': 'Equity_MF',
-  'ETFs': 'ETF',
+  'ETFs': "",
   'REITs & InvITs': 'ETF',
   'Bonds & Debentures': 'Debt_MF',
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.2919ms)

[Survived] StringLiteral
services/RecommendationPipeline.js:415:25
   'Equity Mutual Funds': 'Equity_MF',
   'ETFs': 'ETF',
   'REITs & InvITs': 'ETF',
-  'Bonds & Debentures': 'Debt_MF',
+  'Bonds & Debentures': "",
   'Insurance-linked': 'Debt_MF',
   'Direct Equity': 'Equity_MF',

[Killed] BlockStatement
services/RecommendationPipeline.js:420:34
   'Direct Equity': 'Equity_MF',
 };
 
-function resolveBackendType(inv) {
-  // Direct ID mapping takes priority
-  if (inv.id && CATALOG_TO_BACKEND[inv.id]) return CATALOG_TO_BACKEND[inv.id];
-
-  // For specific fund variants, match by common prefix
-  const id = (inv.id || '').toLowerCase();
-  if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
-  if (id.includes('elss')) return 'ELSS';
-  if (id.includes('liquid')) return 'Liquid_MF';
-  if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
-  if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
-  if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
-  if (id.includes('midcap')) return 'Midcap_MF';
-  if (id.includes('smallcap')) return 'Smallcap_MF';
-  if (id.includes('gold')) return 'Gold';
-  if (id.includes('arbitrage')) return 'Arbitrage_MF';
-  if (id.includes('etf')) return 'ETF';
-  if (id.includes('equity') || id.includes('flexi') || id.includes('bluechip') || id.includes('largecap')) return 'Equity_MF';
-
-  // Category fallback
-  if (inv.category && CATEGORY_TO_BACKEND[inv.category]) return CATEGORY_TO_BACKEND[inv.category];
-
-  return 'Debt_MF'; // Safe default
-}
+function resolveBackendType(inv) {}
 
 function computeSharpe(postTaxReturn, backendType) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (309.2003ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:422:7
 
 function resolveBackendType(inv) {
   // Direct ID mapping takes priority
-  if (inv.id && CATALOG_TO_BACKEND[inv.id]) return CATALOG_TO_BACKEND[inv.id];
+  if (false) return CATALOG_TO_BACKEND[inv.id];
 
   // For specific fund variants, match by common prefix
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (299.9098ms)

[Killed] LogicalOperator
services/RecommendationPipeline.js:422:7
 
 function resolveBackendType(inv) {
   // Direct ID mapping takes priority
-  if (inv.id && CATALOG_TO_BACKEND[inv.id]) return CATALOG_TO_BACKEND[inv.id];
+  if (inv.id || CATALOG_TO_BACKEND[inv.id]) return CATALOG_TO_BACKEND[inv.id];
 
   // For specific fund variants, match by common prefix
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (294.4189ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:425:15
   if (inv.id && CATALOG_TO_BACKEND[inv.id]) return CATALOG_TO_BACKEND[inv.id];
 
   // For specific fund variants, match by common prefix
-  const id = (inv.id || '').toLowerCase();
+  const id = (true).toLowerCase();
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
   if (id.includes('elss')) return 'ELSS';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (305.9071ms)

[Killed] MethodExpression
services/RecommendationPipeline.js:425:14
   if (inv.id && CATALOG_TO_BACKEND[inv.id]) return CATALOG_TO_BACKEND[inv.id];
 
   // For specific fund variants, match by common prefix
-  const id = (inv.id || '').toLowerCase();
+  const id = (inv.id || '').toUpperCase();
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
   if (id.includes('elss')) return 'ELSS';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.8523ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:426:7
 
   // For specific fund variants, match by common prefix
   const id = (inv.id || '').toLowerCase();
-  if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
+  if (true) return 'FD';
   if (id.includes('elss')) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (313.9637ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:426:7
 
   // For specific fund variants, match by common prefix
   const id = (inv.id || '').toLowerCase();
-  if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
+  if (false) return 'FD';
   if (id.includes('elss')) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (366.6017ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:427:7
   // For specific fund variants, match by common prefix
   const id = (inv.id || '').toLowerCase();
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
-  if (id.includes('elss')) return 'ELSS';
+  if (true) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.3289ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:427:7
   // For specific fund variants, match by common prefix
   const id = (inv.id || '').toLowerCase();
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
-  if (id.includes('elss')) return 'ELSS';
+  if (false) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (339.7633ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:428:7
   const id = (inv.id || '').toLowerCase();
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
   if (id.includes('elss')) return 'ELSS';
-  if (id.includes('liquid')) return 'Liquid_MF';
+  if (true) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.8572ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:428:7
   const id = (inv.id || '').toLowerCase();
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
   if (id.includes('elss')) return 'ELSS';
-  if (id.includes('liquid')) return 'Liquid_MF';
+  if (false) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (307.0611ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:429:7
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
   if (id.includes('elss')) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
-  if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
+  if (true) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
   if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (290.1595ms)

[Survived] ConditionalExpression
services/RecommendationPipeline.js:429:7
   if (id.includes('fd') || id.includes('fixed_deposit')) return 'FD';
   if (id.includes('elss')) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
-  if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
+  if (false) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
   if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';

[Killed] LogicalOperator
services/RecommendationPipeline.js:430:7
   if (id.includes('elss')) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
-  if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
+  if (id.includes('hybrid') && id.includes('balanced')) return 'Hybrid_MF';
   if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
   if (id.includes('midcap')) return 'Midcap_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (317.8068ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:430:7
   if (id.includes('elss')) return 'ELSS';
   if (id.includes('liquid')) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
-  if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
+  if (false) return 'Hybrid_MF';
   if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
   if (id.includes('midcap')) return 'Midcap_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (365.0108ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:431:7
   if (id.includes('liquid')) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
-  if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
+  if (true) return 'Index_MF';
   if (id.includes('midcap')) return 'Midcap_MF';
   if (id.includes('smallcap')) return 'Smallcap_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (336.3566ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:431:7
   if (id.includes('liquid')) return 'Liquid_MF';
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
-  if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
+  if (false) return 'Index_MF';
   if (id.includes('midcap')) return 'Midcap_MF';
   if (id.includes('smallcap')) return 'Smallcap_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.7382ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:432:7
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
   if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
-  if (id.includes('midcap')) return 'Midcap_MF';
+  if (false) return 'Midcap_MF';
   if (id.includes('smallcap')) return 'Smallcap_MF';
   if (id.includes('gold')) return 'Gold';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (345.0905ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:432:7
   if (id.includes('debt') || id.includes('corporate_bond') || id.includes('short_duration')) return 'Debt_MF';
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
   if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
-  if (id.includes('midcap')) return 'Midcap_MF';
+  if (true) return 'Midcap_MF';
   if (id.includes('smallcap')) return 'Smallcap_MF';
   if (id.includes('gold')) return 'Gold';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (362.4705ms)

[Killed] ConditionalExpression
services/RecommendationPipeline.js:433:7
   if (id.includes('hybrid') || id.includes('balanced')) return 'Hybrid_MF';
   if (id.includes('index') || id.includes('nifty_index')) return 'Index_MF';
   if (id.includes('midcap')) return 'Midcap_MF';
-  if (id.includes('smallcap')) return 'Smallcap_MF';
+  if (false) return 'Smallcap_MF';
   if (id.includes('gold')) return 'Gold';
   if (id.includes('arbitrage')) return 'Arbitrage_MF';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (308.1108ms)
