[Killed] BlockStatement
services/taxEngine.js:6:40
  * Dynamically computes India's current fiscal year (April 1st to March 31st).
  * @returns {string} e.g. "FY2026-27"
  */
-export function getCurrentFiscalYear() {
-    const now = new Date();
-    const year = now.getFullYear();
-    // India's fiscal year starts in April (month index 3)
-    const isAprilOrLater = now.getMonth() >= 3;
-    const startYear = isAprilOrLater ? year : year - 1;
-    const endYear = startYear + 1;
-    return `FY${startYear}-${endYear.toString().slice(-2)}`;
-}
+export function getCurrentFiscalYear() {}
 export const CURRENT_FY = getCurrentFiscalYear();
 const defineSlabs = (slabs) => Object.freeze(slabs.map(slab => Object.freeze({ ...slab })));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (274.8825ms)

[Survived] ConditionalExpression
services/taxEngine.js:10:28
     const now = new Date();
     const year = now.getFullYear();
     // India's fiscal year starts in April (month index 3)
-    const isAprilOrLater = now.getMonth() >= 3;
+    const isAprilOrLater = true;
     const startYear = isAprilOrLater ? year : year - 1;
     const endYear = startYear + 1;

[Survived] EqualityOperator
services/taxEngine.js:10:28
     const now = new Date();
     const year = now.getFullYear();
     // India's fiscal year starts in April (month index 3)
-    const isAprilOrLater = now.getMonth() >= 3;
+    const isAprilOrLater = now.getMonth() < 3;
     const startYear = isAprilOrLater ? year : year - 1;
     const endYear = startYear + 1;

[Survived] ArithmeticOperator
services/taxEngine.js:11:47
     const year = now.getFullYear();
     // India's fiscal year starts in April (month index 3)
     const isAprilOrLater = now.getMonth() >= 3;
-    const startYear = isAprilOrLater ? year : year - 1;
+    const startYear = isAprilOrLater ? year : year + 1;
     const endYear = startYear + 1;
     return `FY${startYear}-${endYear.toString().slice(-2)}`;

[Killed] ArithmeticOperator
services/taxEngine.js:12:21
     // India's fiscal year starts in April (month index 3)
     const isAprilOrLater = now.getMonth() >= 3;
     const startYear = isAprilOrLater ? year : year - 1;
-    const endYear = startYear + 1;
+    const endYear = startYear - 1;
     return `FY${startYear}-${endYear.toString().slice(-2)}`;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (325.927ms)

[Killed] MethodExpression
services/taxEngine.js:13:30
     const isAprilOrLater = now.getMonth() >= 3;
     const startYear = isAprilOrLater ? year : year - 1;
     const endYear = startYear + 1;
-    return `FY${startYear}-${endYear.toString().slice(-2)}`;
+    return `FY${startYear}-${endYear.toString()}`;
 }
 export const CURRENT_FY = getCurrentFiscalYear();
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (278.8914ms)

[Survived] UnaryOperator
services/taxEngine.js:13:55
     const isAprilOrLater = now.getMonth() >= 3;
     const startYear = isAprilOrLater ? year : year - 1;
     const endYear = startYear + 1;
-    return `FY${startYear}-${endYear.toString().slice(-2)}`;
+    return `FY${startYear}-${endYear.toString().slice(+2)}`;
 }
 export const CURRENT_FY = getCurrentFiscalYear();

[Killed] ArrowFunction
services/taxEngine.js:16:21
     return `FY${startYear}-${endYear.toString().slice(-2)}`;
 }
 export const CURRENT_FY = getCurrentFiscalYear();
-const defineSlabs = (slabs) => Object.freeze(slabs.map(slab => Object.freeze({ ...slab })));
+const defineSlabs = () => undefined;
 const STANDARD_NEW_SLABS = defineSlabs([
     { min: 0, max: 400000, rate: 0 },
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (333.0694ms)

[Killed] ArrowFunction
services/taxEngine.js:16:56
     return `FY${startYear}-${endYear.toString().slice(-2)}`;
 }
 export const CURRENT_FY = getCurrentFiscalYear();
-const defineSlabs = (slabs) => Object.freeze(slabs.map(slab => Object.freeze({ ...slab })));
+const defineSlabs = (slabs) => Object.freeze(slabs.map(() => undefined));
 const STANDARD_NEW_SLABS = defineSlabs([
     { min: 0, max: 400000, rate: 0 },
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (337.2976ms)

[Killed] ObjectLiteral
services/taxEngine.js:18:5
 export const CURRENT_FY = getCurrentFiscalYear();
 const defineSlabs = (slabs) => Object.freeze(slabs.map(slab => Object.freeze({ ...slab })));
 const STANDARD_NEW_SLABS = defineSlabs([
-    { min: 0, max: 400000, rate: 0 },
+    {},
     { min: 400000, max: 800000, rate: 0.05 },
     { min: 800000, max: 1200000, rate: 0.10 },
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (330.5095ms)

[Killed] ObjectLiteral
services/taxEngine.js:20:5
 const STANDARD_NEW_SLABS = defineSlabs([
     { min: 0, max: 400000, rate: 0 },
     { min: 400000, max: 800000, rate: 0.05 },
-    { min: 800000, max: 1200000, rate: 0.10 },
+    {},
     { min: 1200000, max: 1600000, rate: 0.15 },
     { min: 1600000, max: 2000000, rate: 0.20 },
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (315.4173ms)

[Killed] ArrayDeclaration
services/taxEngine.js:26:40
     { min: 2000000, max: 2400000, rate: 0.25 },
     { min: 2400000, max: Infinity, rate: 0.30 },
 ]);
-const STANDARD_OLD_SLABS = defineSlabs([
-    { min: 0, max: 250000, rate: 0 },
-    { min: 250000, max: 500000, rate: 0.05 },
-    { min: 500000, max: 1000000, rate: 0.20 },
-    { min: 1000000, max: Infinity, rate: 0.30 },
-]);
+const STANDARD_OLD_SLABS = defineSlabs([]);
 
 export const TAX_SLABS_BY_FY = Object.freeze({
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (326.5857ms)

[Killed] ObjectLiteral
services/taxEngine.js:29:5
 const STANDARD_OLD_SLABS = defineSlabs([
     { min: 0, max: 250000, rate: 0 },
     { min: 250000, max: 500000, rate: 0.05 },
-    { min: 500000, max: 1000000, rate: 0.20 },
+    {},
     { min: 1000000, max: Infinity, rate: 0.30 },
 ]);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.7049ms)

[Killed] ObjectLiteral
services/taxEngine.js:30:5
     { min: 0, max: 250000, rate: 0 },
     { min: 250000, max: 500000, rate: 0.05 },
     { min: 500000, max: 1000000, rate: 0.20 },
-    { min: 1000000, max: Infinity, rate: 0.30 },
+    {},
 ]);
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.0016ms)

[Killed] ObjectLiteral
services/taxEngine.js:34:32
 ]);
 
 export const TAX_SLABS_BY_FY = Object.freeze({
-    'FY2025-26': Object.freeze({
-        verified: true, // Confirmed against Finance Act 2023 / Union Budget 2024.
-        new: STANDARD_NEW_SLABS,
-        old: STANDARD_OLD_SLABS,
-    }),
+    'FY2025-26': Object.freeze({}),
     'FY2026-27': Object.freeze({
         // FY2026-27: Union Budget 2025 confirmed same slab rates as FY2025-26. verified=true.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (433.7966ms)

[Killed] BooleanLiteral
services/taxEngine.js:35:19
 
 export const TAX_SLABS_BY_FY = Object.freeze({
     'FY2025-26': Object.freeze({
-        verified: true, // Confirmed against Finance Act 2023 / Union Budget 2024.
+        verified: false, // Confirmed against Finance Act 2023 / Union Budget 2024.
         new: STANDARD_NEW_SLABS,
         old: STANDARD_OLD_SLABS,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.4037ms)

[Killed] BooleanLiteral
services/taxEngine.js:41:19
     }),
     'FY2026-27': Object.freeze({
         // FY2026-27: Union Budget 2025 confirmed same slab rates as FY2025-26. verified=true.
-        verified: true,
+        verified: false,
         new: STANDARD_NEW_SLABS,
         old: STANDARD_OLD_SLABS,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (303.4618ms)

[Killed] BlockStatement
services/taxEngine.js:46:59
         old: STANDARD_OLD_SLABS,
     }),
 });
-export function getTaxSlabsForFY(fiscalYear = CURRENT_FY) {
-    return TAX_SLABS_BY_FY[fiscalYear] || TAX_SLABS_BY_FY[CURRENT_FY];
-}
+export function getTaxSlabsForFY(fiscalYear = CURRENT_FY) {}
 /**
  * Check whether the tax slabs for a given fiscal year have been verified
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (312.7944ms)

[Killed] LogicalOperator
services/taxEngine.js:47:12
     }),
 });
 export function getTaxSlabsForFY(fiscalYear = CURRENT_FY) {
-    return TAX_SLABS_BY_FY[fiscalYear] || TAX_SLABS_BY_FY[CURRENT_FY];
+    return TAX_SLABS_BY_FY[fiscalYear] && TAX_SLABS_BY_FY[CURRENT_FY];
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.6158ms)

[Killed] ConditionalExpression
services/taxEngine.js:47:12
     }),
 });
 export function getTaxSlabsForFY(fiscalYear = CURRENT_FY) {
-    return TAX_SLABS_BY_FY[fiscalYear] || TAX_SLABS_BY_FY[CURRENT_FY];
+    return false;
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (303.7147ms)

[Killed] BlockStatement
services/taxEngine.js:53:55
  * Check whether the tax slabs for a given fiscal year have been verified
  * against an official gazette/Union Budget source.
  */
-export function isFYVerified(fiscalYear = CURRENT_FY) {
-    const entry = TAX_SLABS_BY_FY[fiscalYear];
-    return entry ? entry.verified === true : false;
-}
+export function isFYVerified(fiscalYear = CURRENT_FY) {}
 function getRegimeSlabs(regime, fiscalYear = CURRENT_FY) {
     const slabs = getTaxSlabsForFY(fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (477.8895ms)

[Killed] BooleanLiteral
services/taxEngine.js:55:39
  */
 export function isFYVerified(fiscalYear = CURRENT_FY) {
     const entry = TAX_SLABS_BY_FY[fiscalYear];
-    return entry ? entry.verified === true : false;
+    return entry ? entry.verified === false : false;
 }
 function getRegimeSlabs(regime, fiscalYear = CURRENT_FY) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (330.4684ms)

[Killed] ConditionalExpression
services/taxEngine.js:55:20
  */
 export function isFYVerified(fiscalYear = CURRENT_FY) {
     const entry = TAX_SLABS_BY_FY[fiscalYear];
-    return entry ? entry.verified === true : false;
+    return entry ? false : false;
 }
 function getRegimeSlabs(regime, fiscalYear = CURRENT_FY) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (286.0058ms)

[Killed] BlockStatement
services/taxEngine.js:57:58
     const entry = TAX_SLABS_BY_FY[fiscalYear];
     return entry ? entry.verified === true : false;
 }
-function getRegimeSlabs(regime, fiscalYear = CURRENT_FY) {
-    const slabs = getTaxSlabsForFY(fiscalYear);
-    return regime === 'old' ? slabs.old : slabs.new;
-}
+function getRegimeSlabs(regime, fiscalYear = CURRENT_FY) {}
 /**
  * Calculate tax from slab structure.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.6916ms)

[Killed] ConditionalExpression
services/taxEngine.js:59:12
 }
 function getRegimeSlabs(regime, fiscalYear = CURRENT_FY) {
     const slabs = getTaxSlabsForFY(fiscalYear);
-    return regime === 'old' ? slabs.old : slabs.new;
+    return false ? slabs.old : slabs.new;
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (392.5857ms)

[Killed] ConditionalExpression
services/taxEngine.js:59:12
 }
 function getRegimeSlabs(regime, fiscalYear = CURRENT_FY) {
     const slabs = getTaxSlabsForFY(fiscalYear);
-    return regime === 'old' ? slabs.old : slabs.new;
+    return true ? slabs.old : slabs.new;
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (368.6922ms)

[Killed] BlockStatement
services/taxEngine.js:64:51
 /**
  * Calculate tax from slab structure.
  */
-function calculateFromSlabs(taxableIncome, slabs) {
-    let tax = 0;
-    for (const slab of slabs) {
-        if (taxableIncome <= slab.min)
-            break;
-        const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
-        tax += taxableInSlab * slab.rate;
-    }
-    return tax;
-}
+function calculateFromSlabs(taxableIncome, slabs) {}
 /**
  * Compute surcharge on base tax for high-income individuals.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.9795ms)

[Killed] BlockStatement
services/taxEngine.js:66:31
  */
 function calculateFromSlabs(taxableIncome, slabs) {
     let tax = 0;
-    for (const slab of slabs) {
-        if (taxableIncome <= slab.min)
-            break;
-        const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
-        tax += taxableInSlab * slab.rate;
-    }
+    for (const slab of slabs) {}
     return tax;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (321.1103ms)

[Killed] ConditionalExpression
services/taxEngine.js:67:13
 function calculateFromSlabs(taxableIncome, slabs) {
     let tax = 0;
     for (const slab of slabs) {
-        if (taxableIncome <= slab.min)
+        if (false)
             break;
         const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (295.6151ms)

[Killed] EqualityOperator
services/taxEngine.js:67:13
 function calculateFromSlabs(taxableIncome, slabs) {
     let tax = 0;
     for (const slab of slabs) {
-        if (taxableIncome <= slab.min)
+        if (taxableIncome > slab.min)
             break;
         const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (356.2747ms)

[Killed] ArithmeticOperator
services/taxEngine.js:69:31
     for (const slab of slabs) {
         if (taxableIncome <= slab.min)
             break;
-        const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
+        const taxableInSlab = Math.min(taxableIncome, slab.max) + slab.min;
         tax += taxableInSlab * slab.rate;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (348.1306ms)

[Killed] MethodExpression
services/taxEngine.js:69:31
     for (const slab of slabs) {
         if (taxableIncome <= slab.min)
             break;
-        const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
+        const taxableInSlab = Math.max(taxableIncome, slab.max) - slab.min;
         tax += taxableInSlab * slab.rate;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (293.3162ms)

[Killed] ArithmeticOperator
services/taxEngine.js:70:16
         if (taxableIncome <= slab.min)
             break;
         const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
-        tax += taxableInSlab * slab.rate;
+        tax += taxableInSlab / slab.rate;
     }
     return tax;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (300.9715ms)

[Killed] AssignmentOperator
services/taxEngine.js:70:9
         if (taxableIncome <= slab.min)
             break;
         const taxableInSlab = Math.min(taxableIncome, slab.max) - slab.min;
-        tax += taxableInSlab * slab.rate;
+        tax -= taxableInSlab * slab.rate;
     }
     return tax;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (328.3911ms)

[Killed] BlockStatement
services/taxEngine.js:77:70
 /**
  * Compute surcharge on base tax for high-income individuals.
  */
-function computeSurcharge(taxBeforeSurcharge, taxableIncome, regime) {
-    if (taxableIncome <= 5000000)
-        return 0; // Below ₹50L: no surcharge
-    let surchargeRate = 0;
-    if (regime === 'new') {
-        if (taxableIncome <= 10000000)
-            surchargeRate = 0.10;
-        else if (taxableIncome <= 20000000)
-            surchargeRate = 0.15;
-        else
-            surchargeRate = 0.25;
-    }
-    else {
-        // Old regime
-        if (taxableIncome <= 10000000)
-            surchargeRate = 0.10;
-        else if (taxableIncome <= 20000000)
-            surchargeRate = 0.15;
-        else if (taxableIncome <= 50000000)
-            surchargeRate = 0.25;
-        else
-            surchargeRate = 0.37;
-    }
-    return taxBeforeSurcharge * surchargeRate;
-}
+function computeSurcharge(taxBeforeSurcharge, taxableIncome, regime) {}
 /**
  * Compute surcharge WITH marginal relief.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (382.135ms)

[Killed] ConditionalExpression
services/taxEngine.js:78:9
  * Compute surcharge on base tax for high-income individuals.
  */
 function computeSurcharge(taxBeforeSurcharge, taxableIncome, regime) {
-    if (taxableIncome <= 5000000)
+    if (false)
         return 0; // Below ₹50L: no surcharge
     let surchargeRate = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (384.9527ms)

[Killed] EqualityOperator
services/taxEngine.js:78:9
  * Compute surcharge on base tax for high-income individuals.
  */
 function computeSurcharge(taxBeforeSurcharge, taxableIncome, regime) {
-    if (taxableIncome <= 5000000)
+    if (taxableIncome > 5000000)
         return 0; // Below ₹50L: no surcharge
     let surchargeRate = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (345.212ms)

[Killed] EqualityOperator
services/taxEngine.js:81:9
     if (taxableIncome <= 5000000)
         return 0; // Below ₹50L: no surcharge
     let surchargeRate = 0;
-    if (regime === 'new') {
+    if (regime !== 'new') {
         if (taxableIncome <= 10000000)
             surchargeRate = 0.10;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.4994ms)

[Killed] BlockStatement
services/taxEngine.js:81:27
     if (taxableIncome <= 5000000)
         return 0; // Below ₹50L: no surcharge
     let surchargeRate = 0;
-    if (regime === 'new') {
-        if (taxableIncome <= 10000000)
-            surchargeRate = 0.10;
-        else if (taxableIncome <= 20000000)
-            surchargeRate = 0.15;
-        else
-            surchargeRate = 0.25;
-    }
+    if (regime === 'new') {}
     else {
         // Old regime
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (304.5676ms)

[Killed] ConditionalExpression
services/taxEngine.js:82:13
         return 0; // Below ₹50L: no surcharge
     let surchargeRate = 0;
     if (regime === 'new') {
-        if (taxableIncome <= 10000000)
+        if (false)
             surchargeRate = 0.10;
         else if (taxableIncome <= 20000000)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (349.3482ms)

[Killed] ConditionalExpression
services/taxEngine.js:82:13
         return 0; // Below ₹50L: no surcharge
     let surchargeRate = 0;
     if (regime === 'new') {
-        if (taxableIncome <= 10000000)
+        if (true)
             surchargeRate = 0.10;
         else if (taxableIncome <= 20000000)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (357.7588ms)
