[Killed] EqualityOperator
services/taxEngine.js:154:28
     }
     // Section 80CCD(2) - Employer NPS Contribution (available under both regimes)
     const basicSalary = deductions.basicSalary || (annualIncome * 0.5);
-    const isGovtEmployee = deductions.isGovtEmployee === true;
+    const isGovtEmployee = deductions.isGovtEmployee !== true;
     const nps80CCD2LimitPercent = isGovtEmployee ? 0.14 : 0.10;
     const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (307.9608ms)

[Killed] ArithmeticOperator
services/taxEngine.js:156:23
     const basicSalary = deductions.basicSalary || (annualIncome * 0.5);
     const isGovtEmployee = deductions.isGovtEmployee === true;
     const nps80CCD2LimitPercent = isGovtEmployee ? 0.14 : 0.10;
-    const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
+    const max80CCD2 = basicSalary / nps80CCD2LimitPercent;
     const nps80CCD2 = Math.min(deductions.nps80CCD2 || 0, max80CCD2);
     const section80C = Math.min(deductions.section80C || 0, 150000);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (454.5373ms)

[Killed] ConditionalExpression
services/taxEngine.js:157:32
     const isGovtEmployee = deductions.isGovtEmployee === true;
     const nps80CCD2LimitPercent = isGovtEmployee ? 0.14 : 0.10;
     const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
-    const nps80CCD2 = Math.min(deductions.nps80CCD2 || 0, max80CCD2);
+    const nps80CCD2 = Math.min(true, max80CCD2);
     const section80C = Math.min(deductions.section80C || 0, 150000);
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (387.1876ms)

[Killed] ConditionalExpression
services/taxEngine.js:157:32
     const isGovtEmployee = deductions.isGovtEmployee === true;
     const nps80CCD2LimitPercent = isGovtEmployee ? 0.14 : 0.10;
     const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
-    const nps80CCD2 = Math.min(deductions.nps80CCD2 || 0, max80CCD2);
+    const nps80CCD2 = Math.min(false, max80CCD2);
     const section80C = Math.min(deductions.section80C || 0, 150000);
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.4502ms)

[Killed] ConditionalExpression
services/taxEngine.js:158:33
     const nps80CCD2LimitPercent = isGovtEmployee ? 0.14 : 0.10;
     const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
     const nps80CCD2 = Math.min(deductions.nps80CCD2 || 0, max80CCD2);
-    const section80C = Math.min(deductions.section80C || 0, 150000);
+    const section80C = Math.min(true, 150000);
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (423.3944ms)

[Killed] ConditionalExpression
services/taxEngine.js:158:33
     const nps80CCD2LimitPercent = isGovtEmployee ? 0.14 : 0.10;
     const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
     const nps80CCD2 = Math.min(deductions.nps80CCD2 || 0, max80CCD2);
-    const section80C = Math.min(deductions.section80C || 0, 150000);
+    const section80C = Math.min(false, 150000);
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (300.8569ms)

✔ reverseSIP handles zero rate, reachable targets, a

[Killed] ConditionalExpression
services/taxEngine.js:159:33
     const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
     const nps80CCD2 = Math.min(deductions.nps80CCD2 || 0, max80CCD2);
     const section80C = Math.min(deductions.section80C || 0, 150000);
-    const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
+    const nps80CCD1B = Math.min(true, 50000);
     // Section 80D Granular Self vs. Parents
     const age = deductions.age || 30;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.8102ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] MethodExpression
services/taxEngine.js:159:24
     const max80CCD2 = basicSalary * nps80CCD2LimitPercent;
     const nps80CCD2 = Math.min(deductions.nps80CCD2 || 0, max80CCD2);
     const section80C = Math.min(deductions.section80C || 0, 150000);
-    const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
+    const nps80CCD1B = Math.max(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
     const age = deductions.age || 30;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (380.6097ms)

[Killed] ConditionalExpression
services/taxEngine.js:161:17
     const section80C = Math.min(deductions.section80C || 0, 150000);
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
-    const age = deductions.age || 30;
+    const age = true;
     const selfSenior = age >= 60 || deductions.self_senior === true;
     const parentsSenior = deductions.parents_senior === true;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (320.8262ms)

[Killed] LogicalOperator
services/taxEngine.js:161:17
     const section80C = Math.min(deductions.section80C || 0, 150000);
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
-    const age = deductions.age || 30;
+    const age = deductions.age && 30;
     const selfSenior = age >= 60 || deductions.self_senior === true;
     const parentsSenior = deductions.parents_senior === true;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (348.394ms)

[Killed] ConditionalExpression
services/taxEngine.js:162:24
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
     const age = deductions.age || 30;
-    const selfSenior = age >= 60 || deductions.self_senior === true;
+    const selfSenior = true;
     const parentsSenior = deductions.parents_senior === true;
     const max80D_self = selfSenior ? 50000 : 25000;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (417.8301ms)

[Killed] ConditionalExpression
services/taxEngine.js:162:37
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
     const age = deductions.age || 30;
-    const selfSenior = age >= 60 || deductions.self_senior === true;
+    const selfSenior = age >= 60 || false;
     const parentsSenior = deductions.parents_senior === true;
     const max80D_self = selfSenior ? 50000 : 25000;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (322.7935ms)

[Killed] ConditionalExpression
services/taxEngine.js:163:27
     // Section 80D Granular Self vs. Parents
     const age = deductions.age || 30;
     const selfSenior = age >= 60 || deductions.self_senior === true;
-    const parentsSenior = deductions.parents_senior === true;
+    const parentsSenior = false;
     const max80D_self = selfSenior ? 50000 : 25000;
     const max80D_parents = parentsSenior ? 50000 : 25000;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (334.5684ms)

[Killed] BooleanLiteral
services/taxEngine.js:163:57
     // Section 80D Granular Self vs. Parents
     const age = deductions.age || 30;
     const selfSenior = age >= 60 || deductions.self_senior === true;
-    const parentsSenior = deductions.parents_senior === true;
+    const parentsSenior = deductions.parents_senior === false;
     const max80D_self = selfSenior ? 50000 : 25000;
     const max80D_parents = parentsSenior ? 50000 : 25000;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (392.5425ms)

[Killed] ConditionalExpression
services/taxEngine.js:167:9
     const max80D_self = selfSenior ? 50000 : 25000;
     const max80D_parents = parentsSenior ? 50000 : 25000;
     let allowed80D = 0;
-    if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
+    if (true) {
         const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
         const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (405.931ms)

[Killed] EqualityOperator
services/taxEngine.js:167:9
     const max80D_self = selfSenior ? 50000 : 25000;
     const max80D_parents = parentsSenior ? 50000 : 25000;
     let allowed80D = 0;
-    if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
+    if (deductions.section80D_self === undefined || deductions.section80D_parents !== undefined) {
         const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
         const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (428.1449ms)

[Killed] ConditionalExpression
services/taxEngine.js:168:42
     const max80D_parents = parentsSenior ? 50000 : 25000;
     let allowed80D = 0;
     if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
-        const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
+        const allowed80D_self = Math.min(false, max80D_self);
         const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
         allowed80D = allowed80D_self + allowed80D_parents;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (369.2467ms)

[Killed] ConditionalExpression
services/taxEngine.js:168:42
     const max80D_parents = parentsSenior ? 50000 : 25000;
     let allowed80D = 0;
     if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
-        const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
+        const allowed80D_self = Math.min(true, max80D_self);
         const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
         allowed80D = allowed80D_self + allowed80D_parents;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (333.0709ms)

[Killed] ConditionalExpression
services/taxEngine.js:169:45
     let allowed80D = 0;
     if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
         const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
-        const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
+        const allowed80D_parents = Math.min(true, max80D_parents);
         allowed80D = allowed80D_self + allowed80D_parents;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (305.8964ms)

[Killed] LogicalOperator
services/taxEngine.js:169:45
     let allowed80D = 0;
     if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
         const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
-        const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
+        const allowed80D_parents = Math.min(deductions.section80D_parents && 0, max80D_parents);
         allowed80D = allowed80D_self + allowed80D_parents;
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (439.9133ms)

[Killed] ArithmeticOperator
services/taxEngine.js:170:22
     if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
         const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
         const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
-        allowed80D = allowed80D_self + allowed80D_parents;
+        allowed80D = allowed80D_self - allowed80D_parents;
     }
     else {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (340.7407ms)

[Killed] BlockStatement
services/taxEngine.js:172:10
         const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
         allowed80D = allowed80D_self + allowed80D_parents;
     }
-    else {
-        allowed80D = Math.min(deductions.section80D || 0, 100000);
-    }
+    else {}
     const hra = deductions.hra || 0;
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (322.0017ms)

[Killed] ConditionalExpression
services/taxEngine.js:173:31
         allowed80D = allowed80D_self + allowed80D_parents;
     }
     else {
-        allowed80D = Math.min(deductions.section80D || 0, 100000);
+        allowed80D = Math.min(false, 100000);
     }
     const hra = deductions.hra || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (388.6592ms)

[Killed] LogicalOperator
services/taxEngine.js:173:31
         allowed80D = allowed80D_self + allowed80D_parents;
     }
     else {
-        allowed80D = Math.min(deductions.section80D || 0, 100000);
+        allowed80D = Math.min(deductions.section80D && 0, 100000);
     }
     const hra = deductions.hra || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (351.5683ms)

[Killed] ConditionalExpression
services/taxEngine.js:175:17
     else {
         allowed80D = Math.min(deductions.section80D || 0, 100000);
     }
-    const hra = deductions.hra || 0;
+    const hra = true;
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.4047ms)

[Killed] LogicalOperator
services/taxEngine.js:175:17
     else {
         allowed80D = Math.min(deductions.section80D || 0, 100000);
     }
-    const hra = deductions.hra || 0;
+    const hra = deductions.hra && 0;
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (384.9921ms)

[Killed] ConditionalExpression
services/taxEngine.js:176:39
         allowed80D = Math.min(deductions.section80D || 0, 100000);
     }
     const hra = deductions.hra || 0;
-    const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
+    const homeLoanInterest = Math.min(false, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
     const otherDeductions = deductions.other || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (327.3749ms)

[Killed] ConditionalExpression
services/taxEngine.js:176:39
         allowed80D = Math.min(deductions.section80D || 0, 100000);
     }
     const hra = deductions.hra || 0;
-    const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
+    const homeLoanInterest = Math.min(true, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
     const otherDeductions = deductions.other || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (362.2145ms)

[Killed] ConditionalExpression
services/taxEngine.js:177:35
     }
     const hra = deductions.hra || 0;
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
-    const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
+    const section80EEA = Math.min(false, 150000);
     const otherDeductions = deductions.other || 0;
     const savingsInterest = deductions.savingsInterest || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (393.8461ms)

[Killed] LogicalOperator
services/taxEngine.js:177:35
     }
     const hra = deductions.hra || 0;
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
-    const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
+    const section80EEA = Math.min(deductions.section80EEA && 0, 150000);
     const otherDeductions = deductions.other || 0;
     const savingsInterest = deductions.savingsInterest || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (432.8279ms)

[Killed] ConditionalExpression
services/taxEngine.js:178:29
     const hra = deductions.hra || 0;
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
-    const otherDeductions = deductions.other || 0;
+    const otherDeductions = false;
     const savingsInterest = deductions.savingsInterest || 0;
     let section80TTA = deductions.section80TTA || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (395.2938ms)

[Killed] LogicalOperator
services/taxEngine.js:178:29
     const hra = deductions.hra || 0;
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
-    const otherDeductions = deductions.other || 0;
+    const otherDeductions = deductions.other && 0;
     const savingsInterest = deductions.savingsInterest || 0;
     let section80TTA = deductions.section80TTA || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (375.4055ms)

[Killed] ConditionalExpression
services/taxEngine.js:179:29
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
     const otherDeductions = deductions.other || 0;
-    const savingsInterest = deductions.savingsInterest || 0;
+    const savingsInterest = true;
     let section80TTA = deductions.section80TTA || 0;
     let section80TTB = deductions.section80TTB || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (382.6486ms)

[Killed] ConditionalExpression
services/taxEngine.js:179:29
     const homeLoanInterest = Math.min(deductions.homeLoanInterest || 0, 200000);
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
     const otherDeductions = deductions.other || 0;
-    const savingsInterest = deductions.savingsInterest || 0;
+    const savingsInterest = false;
     let section80TTA = deductions.section80TTA || 0;
     let section80TTB = deductions.section80TTB || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (370.2088ms)

[Killed] ConditionalExpression
services/taxEngine.js:180:24
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
     const otherDeductions = deductions.other || 0;
     const savingsInterest = deductions.savingsInterest || 0;
-    let section80TTA = deductions.section80TTA || 0;
+    let section80TTA = true;
     let section80TTB = deductions.section80TTB || 0;
     if (savingsInterest > 0) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (321.3952ms)
