[Killed] LogicalOperator
services/taxEngine.js:180:24
     const section80EEA = Math.min(deductions.section80EEA || 0, 150000);
     const otherDeductions = deductions.other || 0;
     const savingsInterest = deductions.savingsInterest || 0;
-    let section80TTA = deductions.section80TTA || 0;
+    let section80TTA = deductions.section80TTA && 0;
     let section80TTB = deductions.section80TTB || 0;
     if (savingsInterest > 0) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (365.3796ms)

[Killed] LogicalOperator
services/taxEngine.js:181:24
     const otherDeductions = deductions.other || 0;
     const savingsInterest = deductions.savingsInterest || 0;
     let section80TTA = deductions.section80TTA || 0;
-    let section80TTB = deductions.section80TTB || 0;
+    let section80TTB = deductions.section80TTB && 0;
     if (savingsInterest > 0) {
         if (age >= 60) {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (372.8509ms)

[Survived] ConditionalExpression
services/taxEngine.js:181:24
     const otherDeductions = deductions.other || 0;
     const savingsInterest = deductions.savingsInterest || 0;
     let section80TTA = deductions.section80TTA || 0;
-    let section80TTB = deductions.section80TTB || 0;
+    let section80TTB = true;
     if (savingsInterest > 0) {
         if (age >= 60) {

[Killed] BlockStatement
services/taxEngine.js:182:30
     const savingsInterest = deductions.savingsInterest || 0;
     let section80TTA = deductions.section80TTA || 0;
     let section80TTB = deductions.section80TTB || 0;
-    if (savingsInterest > 0) {
-        if (age >= 60) {
-            section80TTB = Math.max(section80TTB, savingsInterest);
-        }
-        else {
-            section80TTA = Math.max(section80TTA, savingsInterest);
-        }
-    }
+    if (savingsInterest > 0) {}
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
     const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.8095ms)

[Killed] EqualityOperator
services/taxEngine.js:182:9
     const savingsInterest = deductions.savingsInterest || 0;
     let section80TTA = deductions.section80TTA || 0;
     let section80TTB = deductions.section80TTB || 0;
-    if (savingsInterest > 0) {
+    if (savingsInterest <= 0) {
         if (age >= 60) {
             section80TTB = Math.max(section80TTB, savingsInterest);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (331.9707ms)

[Killed] EqualityOperator
services/taxEngine.js:183:13
     let section80TTA = deductions.section80TTA || 0;
     let section80TTB = deductions.section80TTB || 0;
     if (savingsInterest > 0) {
-        if (age >= 60) {
+        if (age < 60) {
             section80TTB = Math.max(section80TTB, savingsInterest);
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (307.0538ms)

[Killed] ConditionalExpression
services/taxEngine.js:183:13
     let section80TTA = deductions.section80TTA || 0;
     let section80TTB = deductions.section80TTB || 0;
     if (savingsInterest > 0) {
-        if (age >= 60) {
+        if (false) {
             section80TTB = Math.max(section80TTB, savingsInterest);
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (381.2766ms)

[Killed] MethodExpression
services/taxEngine.js:184:28
     let section80TTB = deductions.section80TTB || 0;
     if (savingsInterest > 0) {
         if (age >= 60) {
-            section80TTB = Math.max(section80TTB, savingsInterest);
+            section80TTB = Math.min(section80TTB, savingsInterest);
         }
         else {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (387.8661ms)

[Killed] BlockStatement
services/taxEngine.js:186:14
         if (age >= 60) {
             section80TTB = Math.max(section80TTB, savingsInterest);
         }
-        else {
-            section80TTA = Math.max(section80TTA, savingsInterest);
-        }
+        else {}
     }
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (278.5086ms)

[Killed] MethodExpression
services/taxEngine.js:187:28
             section80TTB = Math.max(section80TTB, savingsInterest);
         }
         else {
-            section80TTA = Math.max(section80TTA, savingsInterest);
+            section80TTA = Math.min(section80TTA, savingsInterest);
         }
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (334.831ms)

[Killed] ConditionalExpression
services/taxEngine.js:190:26
             section80TTA = Math.max(section80TTA, savingsInterest);
         }
     }
-    const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
+    const allowed80TTA = false ? Math.min(section80TTA, 10000) : 0;
     const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
     const oldRegimeDeductions = regime === 'old'
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (322.7665ms)

[Killed] EqualityOperator
services/taxEngine.js:190:26
             section80TTA = Math.max(section80TTA, savingsInterest);
         }
     }
-    const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
+    const allowed80TTA = age >= 60 ? Math.min(section80TTA, 10000) : 0;
     const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
     const oldRegimeDeductions = regime === 'old'
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (450.9028ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ConditionalExpression
services/taxEngine.js:191:26
         }
     }
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
-    const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
+    const allowed80TTB = false ? Math.min(section80TTB, 50000) : 0;
     const oldRegimeDeductions = regime === 'old'
         ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (313.6139ms)

[Killed] EqualityOperator
services/taxEngine.js:191:26
         }
     }
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
-    const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
+    const allowed80TTB = age < 60 ? Math.min(section80TTB, 50000) : 0;
     const oldRegimeDeductions = regime === 'old'
         ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (299.0242ms)

[Killed] EqualityOperator
services/taxEngine.js:192:33
     }
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
     const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
-    const oldRegimeDeductions = regime === 'old'
+    const oldRegimeDeductions = regime !== 'old'
         ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
         : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (279.4934ms)

[Killed] ConditionalExpression
services/taxEngine.js:192:33
     }
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
     const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
-    const oldRegimeDeductions = regime === 'old'
+    const oldRegimeDeductions = false
         ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
         : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (298.3352ms)

[Killed] ArithmeticOperator
services/taxEngine.js:193:12
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
     const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
     const oldRegimeDeductions = regime === 'old'
-        ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
+        ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA - allowed80TTB + otherDeductions)
         : 0;
     const taxableIncome = Math.max(0, annualIncome - standardDeduction - nps80CCD2 - oldRegimeDeductions);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (289.36ms)

[Killed] ArithmeticOperator
services/taxEngine.js:193:12
     const allowed80TTA = age < 60 ? Math.min(section80TTA, 10000) : 0;
     const allowed80TTB = age >= 60 ? Math.min(section80TTB, 50000) : 0;
     const oldRegimeDeductions = regime === 'old'
-        ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
+        ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest - section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
         : 0;
     const taxableIncome = Math.max(0, annualIncome - standardDeduction - nps80CCD2 - oldRegimeDeductions);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (397.054ms)

[Killed] MethodExpression
services/taxEngine.js:195:27
     const oldRegimeDeductions = regime === 'old'
         ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
         : 0;
-    const taxableIncome = Math.max(0, annualIncome - standardDeduction - nps80CCD2 - oldRegimeDeductions);
+    const taxableIncome = Math.min(0, annualIncome - standardDeduction - nps80CCD2 - oldRegimeDeductions);
     return { standardDeduction, oldRegimeDeductions, taxableIncome, nps80CCD2, allowed80D };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (335.7565ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] ArithmeticOperator
services/taxEngine.js:195:39
     const oldRegimeDeductions = regime === 'old'
         ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
         : 0;
-    const taxableIncome = Math.max(0, annualIncome - standardDeduction - nps80CCD2 - oldRegimeDeductions);
+    const taxableIncome = Math.max(0, annualIncome - standardDeduction - nps80CCD2 + oldRegimeDeductions);
     return { standardDeduction, oldRegimeDeductions, taxableIncome, nps80CCD2, allowed80D };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.9683ms)

✔ reverseSIP handles zero rate, reachable targets,

[Killed] BooleanLiteral
services/taxEngine.js:204:9
 export function computeTax(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     // Input guard: reject non-finite or negative income using local variable
     let safeIncome = annualIncome;
-    if (!Number.isFinite(safeIncome) || safeIncome < 0) {
+    if (Number.isFinite(safeIncome) || safeIncome < 0) {
         console.warn(`[TaxEngine] Invalid annualIncome: ${safeIncome}. Treating as 0.`);
         safeIncome = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (292.0576ms)

[Killed] LogicalOperator
services/taxEngine.js:204:9
 export function computeTax(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     // Input guard: reject non-finite or negative income using local variable
     let safeIncome = annualIncome;
-    if (!Number.isFinite(safeIncome) || safeIncome < 0) {
+    if (!Number.isFinite(safeIncome) && safeIncome < 0) {
         console.warn(`[TaxEngine] Invalid annualIncome: ${safeIncome}. Treating as 0.`);
         safeIncome = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (306.6386ms)

[Killed] ConditionalExpression
services/taxEngine.js:208:23
         console.warn(`[TaxEngine] Invalid annualIncome: ${safeIncome}. Treating as 0.`);
         safeIncome = 0;
     }
-    let safeRegime = (regime === 'new' || regime === 'old') ? regime : 'new';
+    let safeRegime = (false) ? regime : 'new';
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
     const { standardDeduction, oldRegimeDeductions, taxableIncome, nps80CCD2, allowed80D } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (314.6933ms)

[Killed] ConditionalExpression
services/taxEngine.js:208:23
         console.warn(`[TaxEngine] Invalid annualIncome: ${safeIncome}. Treating as 0.`);
         safeIncome = 0;
     }
-    let safeRegime = (regime === 'new' || regime === 'old') ? regime : 'new';
+    let safeRegime = (true) ? regime : 'new';
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
     const { standardDeduction, oldRegimeDeductions, taxableIncome, nps80CCD2, allowed80D } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (320.1909ms)

[Survived] BooleanLiteral
services/taxEngine.js:212:25
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
     const { standardDeduction, oldRegimeDeductions, taxableIncome, nps80CCD2, allowed80D } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
     let taxBeforeCess = calculateFromSlabs(taxableIncome, slabs);
-    let rebateApplied = false;
+    let rebateApplied = true;
     let marginalReliefApplied = false;
     let marginalReliefAmount87A = 0;

[Survived] BooleanLiteral
services/taxEngine.js:213:33
     const { standardDeduction, oldRegimeDeductions, taxableIncome, nps80CCD2, allowed80D } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
     let taxBeforeCess = calculateFromSlabs(taxableIncome, slabs);
     let rebateApplied = false;
-    let marginalReliefApplied = false;
+    let marginalReliefApplied = true;
     let marginalReliefAmount87A = 0;
     const rebateLimit = safeRegime === 'new' ? 1200000 : 500000;

[Killed] ConditionalExpression
services/taxEngine.js:215:25
     let rebateApplied = false;
     let marginalReliefApplied = false;
     let marginalReliefAmount87A = 0;
-    const rebateLimit = safeRegime === 'new' ? 1200000 : 500000;
+    const rebateLimit = false ? 1200000 : 500000;
     if (taxableIncome <= rebateLimit) {
         taxBeforeCess = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (349.5865ms)

[Killed] EqualityOperator
services/taxEngine.js:215:25
     let rebateApplied = false;
     let marginalReliefApplied = false;
     let marginalReliefAmount87A = 0;
-    const rebateLimit = safeRegime === 'new' ? 1200000 : 500000;
+    const rebateLimit = safeRegime !== 'new' ? 1200000 : 500000;
     if (taxableIncome <= rebateLimit) {
         taxBeforeCess = 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (325.1121ms)

[Killed] EqualityOperator
services/taxEngine.js:216:9
     let marginalReliefApplied = false;
     let marginalReliefAmount87A = 0;
     const rebateLimit = safeRegime === 'new' ? 1200000 : 500000;
-    if (taxableIncome <= rebateLimit) {
+    if (taxableIncome < rebateLimit) {
         taxBeforeCess = 0;
         rebateApplied = true;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.5036ms)

[Killed] EqualityOperator
services/taxEngine.js:216:9
     let marginalReliefApplied = false;
     let marginalReliefAmount87A = 0;
     const rebateLimit = safeRegime === 'new' ? 1200000 : 500000;
-    if (taxableIncome <= rebateLimit) {
+    if (taxableIncome > rebateLimit) {
         taxBeforeCess = 0;
         rebateApplied = true;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (313.922ms)

[Killed] BooleanLiteral
services/taxEngine.js:218:25
     const rebateLimit = safeRegime === 'new' ? 1200000 : 500000;
     if (taxableIncome <= rebateLimit) {
         taxBeforeCess = 0;
-        rebateApplied = true;
+        rebateApplied = false;
     }
     else {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (367.933ms)

[Killed] BlockStatement
services/taxEngine.js:220:10
         taxBeforeCess = 0;
         rebateApplied = true;
     }
-    else {
-        // Marginal relief for 87A: tax cannot exceed the excess over rebate limit
-        const excessOverLimit = taxableIncome - rebateLimit;
-        if (taxBeforeCess > excessOverLimit) {
-            marginalReliefAmount87A = taxBeforeCess - excessOverLimit;
-            taxBeforeCess = excessOverLimit;
-            marginalReliefApplied = true;
-        }
-    }
+    else {}
     const surcharge = computeSurcharge(taxBeforeCess, taxableIncome, safeRegime);
     const relief = computeMarginalRelief(taxBeforeCess, surcharge, taxableIncome, safeRegime, fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (371.7123ms)

[Killed] ArithmeticOperator
services/taxEngine.js:222:33
     }
     else {
         // Marginal relief for 87A: tax cannot exceed the excess over rebate limit
-        const excessOverLimit = taxableIncome - rebateLimit;
+        const excessOverLimit = taxableIncome + rebateLimit;
         if (taxBeforeCess > excessOverLimit) {
             marginalReliefAmount87A = taxBeforeCess - excessOverLimit;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.7408ms)

[Killed] EqualityOperator
services/taxEngine.js:223:13
     else {
         // Marginal relief for 87A: tax cannot exceed the excess over rebate limit
         const excessOverLimit = taxableIncome - rebateLimit;
-        if (taxBeforeCess > excessOverLimit) {
+        if (taxBeforeCess <= excessOverLimit) {
             marginalReliefAmount87A = taxBeforeCess - excessOverLimit;
             taxBeforeCess = excessOverLimit;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (339.9602ms)

[Killed] BlockStatement
services/taxEngine.js:223:46
     else {
         // Marginal relief for 87A: tax cannot exceed the excess over rebate limit
         const excessOverLimit = taxableIncome - rebateLimit;
-        if (taxBeforeCess > excessOverLimit) {
-            marginalReliefAmount87A = taxBeforeCess - excessOverLimit;
-            taxBeforeCess = excessOverLimit;
-            marginalReliefApplied = true;
-        }
+        if (taxBeforeCess > excessOverLimit) {}
     }
     const surcharge = computeSurcharge(taxBeforeCess, taxableIncome, safeRegime);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.4217ms)

[Survived] ArithmeticOperator
services/taxEngine.js:224:39
         // Marginal relief for 87A: tax cannot exceed the excess over rebate limit
         const excessOverLimit = taxableIncome - rebateLimit;
         if (taxBeforeCess > excessOverLimit) {
-            marginalReliefAmount87A = taxBeforeCess - excessOverLimit;
+            marginalReliefAmount87A = taxBeforeCess + excessOverLimit;
             taxBeforeCess = excessOverLimit;
             marginalReliefApplied = true;

[Killed] BooleanLiteral
services/taxEngine.js:226:37
         if (taxBeforeCess > excessOverLimit) {
             marginalReliefAmount87A = taxBeforeCess - excessOverLimit;
             taxBeforeCess = excessOverLimit;
-            marginalReliefApplied = true;
+            marginalReliefApplied = false;
         }
     }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.
[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (324.7129ms)

✔ reverseSIP handles zero rate, reachable targets,
