[Survived] ArithmeticOperator
services/taxEngine.js:231:31
     }
     const surcharge = computeSurcharge(taxBeforeCess, taxableIncome, safeRegime);
     const relief = computeMarginalRelief(taxBeforeCess, surcharge, taxableIncome, safeRegime, fiscalYear);
-    const taxAfterSurcharge = taxBeforeCess + surcharge - relief;
+    const taxAfterSurcharge = taxBeforeCess - surcharge - relief;
     // 4% Health & Education Cess (applied on tax + surcharge)
     const cess = taxAfterSurcharge * CESS_RATE;

[Survived] ArithmeticOperator
services/taxEngine.js:231:31
     }
     const surcharge = computeSurcharge(taxBeforeCess, taxableIncome, safeRegime);
     const relief = computeMarginalRelief(taxBeforeCess, surcharge, taxableIncome, safeRegime, fiscalYear);
-    const taxAfterSurcharge = taxBeforeCess + surcharge - relief;
+    const taxAfterSurcharge = taxBeforeCess + surcharge + relief;
     // 4% Health & Education Cess (applied on tax + surcharge)
     const cess = taxAfterSurcharge * CESS_RATE;

[Killed] ArithmeticOperator
services/taxEngine.js:233:18
     const relief = computeMarginalRelief(taxBeforeCess, surcharge, taxableIncome, safeRegime, fiscalYear);
     const taxAfterSurcharge = taxBeforeCess + surcharge - relief;
     // 4% Health & Education Cess (applied on tax + surcharge)
-    const cess = taxAfterSurcharge * CESS_RATE;
+    const cess = taxAfterSurcharge / CESS_RATE;
     const taxAmount = taxAfterSurcharge + cess;
     const effectiveRate = annualIncome > 0
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (299.4003ms)

[Killed] ArithmeticOperator
services/taxEngine.js:234:23
     const taxAfterSurcharge = taxBeforeCess + surcharge - relief;
     // 4% Health & Education Cess (applied on tax + surcharge)
     const cess = taxAfterSurcharge * CESS_RATE;
-    const taxAmount = taxAfterSurcharge + cess;
+    const taxAmount = taxAfterSurcharge - cess;
     const effectiveRate = annualIncome > 0
         ? parseFloat(((taxAmount / annualIncome) * 100).toFixed(2))
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (283.1764ms)

[Killed] ConditionalExpression
services/taxEngine.js:235:27
     // 4% Health & Education Cess (applied on tax + surcharge)
     const cess = taxAfterSurcharge * CESS_RATE;
     const taxAmount = taxAfterSurcharge + cess;
-    const effectiveRate = annualIncome > 0
+    const effectiveRate = false
         ? parseFloat(((taxAmount / annualIncome) * 100).toFixed(2))
         : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (288.7778ms)

[Killed] EqualityOperator
services/taxEngine.js:235:27
     // 4% Health & Education Cess (applied on tax + surcharge)
     const cess = taxAfterSurcharge * CESS_RATE;
     const taxAmount = taxAfterSurcharge + cess;
-    const effectiveRate = annualIncome > 0
+    const effectiveRate = annualIncome >= 0
         ? parseFloat(((taxAmount / annualIncome) * 100).toFixed(2))
         : 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (454.1619ms)

[Killed] ArithmeticOperator
services/taxEngine.js:236:23
     const cess = taxAfterSurcharge * CESS_RATE;
     const taxAmount = taxAfterSurcharge + cess;
     const effectiveRate = annualIncome > 0
-        ? parseFloat(((taxAmount / annualIncome) * 100).toFixed(2))
+        ? parseFloat((taxAmount / annualIncome / 100).toFixed(2))
         : 0;
     return {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (327.4228ms)

[Killed] ArithmeticOperator
services/taxEngine.js:236:24
     const cess = taxAfterSurcharge * CESS_RATE;
     const taxAmount = taxAfterSurcharge + cess;
     const effectiveRate = annualIncome > 0
-        ? parseFloat(((taxAmount / annualIncome) * 100).toFixed(2))
+        ? parseFloat(((taxAmount * annualIncome) * 100).toFixed(2))
         : 0;
     return {
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (277.6252ms)

[Killed] LogicalOperator
services/taxEngine.js:243:32
         effectiveRate,
         regime: safeRegime,
         rebateApplied,
-        marginalReliefApplied: marginalReliefApplied || relief > 0,
+        marginalReliefApplied: marginalReliefApplied && relief > 0,
         marginalReliefAmount: Math.round(relief + marginalReliefAmount87A),
         surchargeApplied: surcharge > 0,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (301.9446ms)

[Killed] ConditionalExpression
services/taxEngine.js:243:57
         effectiveRate,
         regime: safeRegime,
         rebateApplied,
-        marginalReliefApplied: marginalReliefApplied || relief > 0,
+        marginalReliefApplied: marginalReliefApplied || false,
         marginalReliefAmount: Math.round(relief + marginalReliefAmount87A),
         surchargeApplied: surcharge > 0,
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (386.1431ms)

[Survived] ArithmeticOperator
services/taxEngine.js:244:42
         regime: safeRegime,
         rebateApplied,
         marginalReliefApplied: marginalReliefApplied || relief > 0,
-        marginalReliefAmount: Math.round(relief + marginalReliefAmount87A),
+        marginalReliefAmount: Math.round(relief - marginalReliefAmount87A),
         surchargeApplied: surcharge > 0,
         surchargeAmount: Math.round(surcharge),

[Killed] EqualityOperator
services/taxEngine.js:245:27
         rebateApplied,
         marginalReliefApplied: marginalReliefApplied || relief > 0,
         marginalReliefAmount: Math.round(relief + marginalReliefAmount87A),
-        surchargeApplied: surcharge > 0,
+        surchargeApplied: surcharge <= 0,
         surchargeAmount: Math.round(surcharge),
         cess: Math.round(cess),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (303.5618ms)

[Killed] EqualityOperator
services/taxEngine.js:245:27
         rebateApplied,
         marginalReliefApplied: marginalReliefApplied || relief > 0,
         marginalReliefAmount: Math.round(relief + marginalReliefAmount87A),
-        surchargeApplied: surcharge > 0,
+        surchargeApplied: surcharge >= 0,
         surchargeAmount: Math.round(surcharge),
         cess: Math.round(cess),
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (323.9963ms)

[Killed] BlockStatement
services/taxEngine.js:261:131
 /**
  * Compute tax with deductions (convenience wrapper/alias).
  */
-export function computeTaxWithDeductions(annualIncome, regime, deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
-    return computeTax(annualIncome, regime, deductions, incomeSource, fiscalYear);
-}
+export function computeTaxWithDeductions(annualIncome, regime, deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {}
 /**
  * Get the marginal (highest applicable) tax slab percentage.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (335.5463ms)

[Killed] BlockStatement
services/taxEngine.js:267:125
 /**
  * Get the marginal (highest applicable) tax slab percentage.
  */
-export function getTaxSlab(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
-    // Input guard
-    let safeIncome = annualIncome;
-    if (!Number.isFinite(safeIncome) || safeIncome < 0)
-        safeIncome = 0;
-    let safeRegime = (regime === 'new' || regime === 'old') ? regime : 'new';
-    const { taxableIncome } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
-    const slabs = getRegimeSlabs(safeRegime, fiscalYear);
-    let marginalRate = 0;
-    for (const slab of slabs) {
-        if (taxableIncome > slab.min) {
-            marginalRate = slab.rate;
-        }
-    }
-    return marginalRate;
-}
+export function getTaxSlab(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {}
 /**
  * Compare both regimes and return the better one.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (304.8199ms)

[Survived] StringLiteral
services/taxEngine.js:267:90
 /**
  * Get the marginal (highest applicable) tax slab percentage.
  */
-export function getTaxSlab(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
+export function getTaxSlab(annualIncome, regime = 'new', deductions = {}, incomeSource = "", fiscalYear = CURRENT_FY) {
     // Input guard
     let safeIncome = annualIncome;

[Killed] BooleanLiteral
services/taxEngine.js:270:9
 export function getTaxSlab(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     // Input guard
     let safeIncome = annualIncome;
-    if (!Number.isFinite(safeIncome) || safeIncome < 0)
+    if (Number.isFinite(safeIncome) || safeIncome < 0)
         safeIncome = 0;
     let safeRegime = (regime === 'new' || regime === 'old') ? regime : 'new';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (279.0051ms)

[Killed] EqualityOperator
services/taxEngine.js:270:41
 export function getTaxSlab(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     // Input guard
     let safeIncome = annualIncome;
-    if (!Number.isFinite(safeIncome) || safeIncome < 0)
+    if (!Number.isFinite(safeIncome) || safeIncome >= 0)
         safeIncome = 0;
     let safeRegime = (regime === 'new' || regime === 'old') ? regime : 'new';
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (325.5912ms)

[Killed] ConditionalExpression
services/taxEngine.js:272:43
     let safeIncome = annualIncome;
     if (!Number.isFinite(safeIncome) || safeIncome < 0)
         safeIncome = 0;
-    let safeRegime = (regime === 'new' || regime === 'old') ? regime : 'new';
+    let safeRegime = (regime === 'new' || false) ? regime : 'new';
     const { taxableIncome } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (314.7959ms)

[Killed] ConditionalExpression
services/taxEngine.js:272:23
     let safeIncome = annualIncome;
     if (!Number.isFinite(safeIncome) || safeIncome < 0)
         safeIncome = 0;
-    let safeRegime = (regime === 'new' || regime === 'old') ? regime : 'new';
+    let safeRegime = (false) ? regime : 'new';
     const { taxableIncome } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (374.627ms)

[Killed] BlockStatement
services/taxEngine.js:276:31
     const { taxableIncome } = calculateTaxableIncome(safeIncome, safeRegime, deductions, incomeSource);
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
     let marginalRate = 0;
-    for (const slab of slabs) {
-        if (taxableIncome > slab.min) {
-            marginalRate = slab.rate;
-        }
-    }
+    for (const slab of slabs) {}
     return marginalRate;
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (359.6847ms)

[Killed] EqualityOperator
services/taxEngine.js:277:13
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
     let marginalRate = 0;
     for (const slab of slabs) {
-        if (taxableIncome > slab.min) {
+        if (taxableIncome >= slab.min) {
             marginalRate = slab.rate;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (291.801ms)

[Killed] EqualityOperator
services/taxEngine.js:277:13
     const slabs = getRegimeSlabs(safeRegime, fiscalYear);
     let marginalRate = 0;
     for (const slab of slabs) {
-        if (taxableIncome > slab.min) {
+        if (taxableIncome <= slab.min) {
             marginalRate = slab.rate;
         }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (454.128ms)

[Killed] BlockStatement
services/taxEngine.js:286:116
 /**
  * Compare both regimes and return the better one.
  */
-export function compareTaxRegimes(annualIncome, deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
-    // Input guard
-    let safeIncome = annualIncome;
-    if (!Number.isFinite(safeIncome) || safeIncome < 0)
-        safeIncome = 0;
-    const newRegime = computeTax(safeIncome, 'new', deductions, incomeSource, fiscalYear);
-    const oldRegime = computeTax(safeIncome, 'old', deductions, incomeSource, fiscalYear);
-    const recommended = newRegime.taxAmount <= oldRegime.taxAmount ? 'new' : 'old';
-    return { newRegime, oldRegime, recommended };
-}
+export function compareTaxRegimes(annualIncome, deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {}
 /**
  * Get the effective marginal tax rate (slab + surcharge + cess) for a given income level.
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (359.5078ms)

[Killed] ConditionalExpression
services/taxEngine.js:289:9
 export function compareTaxRegimes(annualIncome, deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     // Input guard
     let safeIncome = annualIncome;
-    if (!Number.isFinite(safeIncome) || safeIncome < 0)
+    if (true)
         safeIncome = 0;
     const newRegime = computeTax(safeIncome, 'new', deductions, incomeSource, fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (346.3132ms)

[Killed] ConditionalExpression
services/taxEngine.js:293:25
         safeIncome = 0;
     const newRegime = computeTax(safeIncome, 'new', deductions, incomeSource, fiscalYear);
     const oldRegime = computeTax(safeIncome, 'old', deductions, incomeSource, fiscalYear);
-    const recommended = newRegime.taxAmount <= oldRegime.taxAmount ? 'new' : 'old';
+    const recommended = false ? 'new' : 'old';
     return { newRegime, oldRegime, recommended };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (287.4674ms)

[Killed] EqualityOperator
services/taxEngine.js:293:25
         safeIncome = 0;
     const newRegime = computeTax(safeIncome, 'new', deductions, incomeSource, fiscalYear);
     const oldRegime = computeTax(safeIncome, 'old', deductions, incomeSource, fiscalYear);
-    const recommended = newRegime.taxAmount <= oldRegime.taxAmount ? 'new' : 'old';
+    const recommended = newRegime.taxAmount > oldRegime.taxAmount ? 'new' : 'old';
     return { newRegime, oldRegime, recommended };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (380.7018ms)

[Killed] ObjectLiteral
services/taxEngine.js:294:12
     const newRegime = computeTax(safeIncome, 'new', deductions, incomeSource, fiscalYear);
     const oldRegime = computeTax(safeIncome, 'old', deductions, incomeSource, fiscalYear);
     const recommended = newRegime.taxAmount <= oldRegime.taxAmount ? 'new' : 'old';
-    return { newRegime, oldRegime, recommended };
+    return {};
 }
 /**
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (338.3204ms)

[Killed] BlockStatement
services/taxEngine.js:300:139
  * Get the effective marginal tax rate (slab + surcharge + cess) for a given income level.
  * Useful for post-tax drag adjustments on future returns.
  */
-export function getEffectiveMarginalRate(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
-    const delta = 10000;
-    const highIncome = annualIncome + delta;
-    const lowIncome = Math.max(0, annualIncome - delta);
-    const highRes = computeTax(highIncome, regime, deductions, incomeSource, fiscalYear);
-    const lowRes = computeTax(lowIncome, regime, deductions, incomeSource, fiscalYear);
-    const deltaIncome = highIncome - lowIncome;
-    if (deltaIncome <= 0)
-        return 0;
-    const deltaTax = highRes.taxAmount - lowRes.taxAmount;
-    const effectiveMarginal = deltaTax / deltaIncome;
-    return parseFloat(Math.max(0, Math.min(effectiveMarginal, 0.45)).toFixed(4));
-}
+export function getEffectiveMarginalRate(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {}
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (335.9039ms)

[Killed] ArithmeticOperator
services/taxEngine.js:302:24
  */
 export function getEffectiveMarginalRate(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     const delta = 10000;
-    const highIncome = annualIncome + delta;
+    const highIncome = annualIncome - delta;
     const lowIncome = Math.max(0, annualIncome - delta);
     const highRes = computeTax(highIncome, regime, deductions, incomeSource, fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (337.734ms)

[Killed] ArithmeticOperator
services/taxEngine.js:303:35
 export function getEffectiveMarginalRate(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     const delta = 10000;
     const highIncome = annualIncome + delta;
-    const lowIncome = Math.max(0, annualIncome - delta);
+    const lowIncome = Math.max(0, annualIncome + delta);
     const highRes = computeTax(highIncome, regime, deductions, incomeSource, fiscalYear);
     const lowRes = computeTax(lowIncome, regime, deductions, incomeSource, fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (435.4225ms)

[Killed] MethodExpression
services/taxEngine.js:303:23
 export function getEffectiveMarginalRate(annualIncome, regime = 'new', deductions = {}, incomeSource = 'salary', fiscalYear = CURRENT_FY) {
     const delta = 10000;
     const highIncome = annualIncome + delta;
-    const lowIncome = Math.max(0, annualIncome - delta);
+    const lowIncome = Math.min(0, annualIncome - delta);
     const highRes = computeTax(highIncome, regime, deductions, incomeSource, fiscalYear);
     const lowRes = computeTax(lowIncome, regime, deductions, incomeSource, fiscalYear);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (316.5318ms)

[Killed] ArithmeticOperator
services/taxEngine.js:306:25
     const lowIncome = Math.max(0, annualIncome - delta);
     const highRes = computeTax(highIncome, regime, deductions, incomeSource, fiscalYear);
     const lowRes = computeTax(lowIncome, regime, deductions, incomeSource, fiscalYear);
-    const deltaIncome = highIncome - lowIncome;
+    const deltaIncome = highIncome + lowIncome;
     if (deltaIncome <= 0)
         return 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (321.9898ms)

[Killed] ConditionalExpression
services/taxEngine.js:307:9
     const highRes = computeTax(highIncome, regime, deductions, incomeSource, fiscalYear);
     const lowRes = computeTax(lowIncome, regime, deductions, incomeSource, fiscalYear);
     const deltaIncome = highIncome - lowIncome;
-    if (deltaIncome <= 0)
+    if (true)
         return 0;
     const deltaTax = highRes.taxAmount - lowRes.taxAmount;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (289.7702ms)

[Killed] EqualityOperator
services/taxEngine.js:307:9
     const highRes = computeTax(highIncome, regime, deductions, incomeSource, fiscalYear);
     const lowRes = computeTax(lowIncome, regime, deductions, incomeSource, fiscalYear);
     const deltaIncome = highIncome - lowIncome;
-    if (deltaIncome <= 0)
+    if (deltaIncome > 0)
         return 0;
     const deltaTax = highRes.taxAmount - lowRes.taxAmount;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (297.8538ms)

[Killed] ArithmeticOperator
services/taxEngine.js:309:22
     const deltaIncome = highIncome - lowIncome;
     if (deltaIncome <= 0)
         return 0;
-    const deltaTax = highRes.taxAmount - lowRes.taxAmount;
+    const deltaTax = highRes.taxAmount + lowRes.taxAmount;
     const effectiveMarginal = deltaTax / deltaIncome;
     return parseFloat(Math.max(0, Math.min(effectiveMarginal, 0.45)).toFixed(4));
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (387.6702ms)
