[Killed] ArithmeticOperator
services/taxEngine.js:310:31
     if (deltaIncome <= 0)
         return 0;
     const deltaTax = highRes.taxAmount - lowRes.taxAmount;
-    const effectiveMarginal = deltaTax / deltaIncome;
+    const effectiveMarginal = deltaTax * deltaIncome;
     return parseFloat(Math.max(0, Math.min(effectiveMarginal, 0.45)).toFixed(4));
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (319.0652ms)

[Killed] MethodExpression
services/taxEngine.js:311:23
         return 0;
     const deltaTax = highRes.taxAmount - lowRes.taxAmount;
     const effectiveMarginal = deltaTax / deltaIncome;
-    return parseFloat(Math.max(0, Math.min(effectiveMarginal, 0.45)).toFixed(4));
+    return parseFloat(Math.min(0, Math.min(effectiveMarginal, 0.45)).toFixed(4));
 }
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (247.1587ms)

[Killed] MethodExpression
services/taxEngine.js:311:35
         return 0;
     const deltaTax = highRes.taxAmount - lowRes.taxAmount;
     const effectiveMarginal = deltaTax / deltaIncome;
-    return parseFloat(Math.max(0, Math.min(effectiveMarginal, 0.45)).toFixed(4));
+    return parseFloat(Math.max(0, Math.max(effectiveMarginal, 0.45)).toFixed(4));
 }
 
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (178.4581ms)
