[Survived] EqualityOperator
services/RecommendationPipeline.js:364:7
 
   // Second pass: if we lack diversity, swap the lowest-scored pick
   // with the best available from a missing class
-  if (usedClasses.size < minClasses && ranked.length > topN) {
+  if (usedClasses.size <= minClasses && ranked.length > topN) {
     const remaining = ranked.filter(inv => !usedIds.has(inv.id));
     for (const candidate of remaining) {

[Survived] MethodExpression
services/RecommendationPipeline.js:365:23
   // Second pass: if we lack diversity, swap the lowest-scored pick
   // with the best available from a missing class
   if (usedClasses.size < minClasses && ranked.length > topN) {
-    const remaining = ranked.filter(inv => !usedIds.has(inv.id));
+    const remaining = ranked;
     for (const candidate of remaining) {
       const cls = candidate.assetClass || candidate.category || candidate.type;

[Survived] ConditionalExpression
services/RecommendationPipeline.js:377:13
         usedIds.delete(removed.id);
         usedIds.add(candidate.id);
         usedClasses.add(cls);
-        if (usedClasses.size >= minClasses) break;
+        if (false) break;
       }
     }
