[Survived] EqualityOperator
services/taxEngine.js:91:13
     }
     else {
         // Old regime
-        if (taxableIncome <= 10000000)
+        if (taxableIncome < 10000000)
             surchargeRate = 0.10;
         else if (taxableIncome <= 20000000)

[Survived] ConditionalExpression
services/taxEngine.js:108:34
 function computeMarginalRelief(baseTax, surcharge, taxableIncome, regime, fiscalYear = CURRENT_FY) {
     if (taxableIncome <= 5000000)
         return 0;
-    const SURCHARGE_THRESHOLDS = regime === 'new'
+    const SURCHARGE_THRESHOLDS = false
         ? [5000000, 10000000, 20000000]
         : [5000000, 10000000, 20000000, 50000000];

[Survived] EqualityOperator
services/taxEngine.js:114:13
     // Find the highest active threshold strictly below the taxable income
     let threshold = 5000000;
     for (const t of SURCHARGE_THRESHOLDS) {
-        if (taxableIncome > t) {
+        if (taxableIncome >= t) {
             threshold = t;
         }

[Killed] ConditionalExpression
services/taxEngine.js:162:24
     const nps80CCD1B = Math.min(deductions.nps80CCD1B || deductions.section80CCD || 0, 50000);
     // Section 80D Granular Self vs. Parents
     const age = deductions.age || 30;
-    const selfSenior = age >= 60 || deductions.self_senior === true;
+    const selfSenior = false;
     const parentsSenior = deductions.parents_senior === true;
     const max80D_self = selfSenior ? 50000 : 25000;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (310.8961ms)

[Killed] LogicalOperator
services/taxEngine.js:167:9
     const max80D_self = selfSenior ? 50000 : 25000;
     const max80D_parents = parentsSenior ? 50000 : 25000;
     let allowed80D = 0;
-    if (deductions.section80D_self !== undefined || deductions.section80D_parents !== undefined) {
+    if (deductions.section80D_self !== undefined && deductions.section80D_parents !== undefined) {
         const allowed80D_self = Math.min(deductions.section80D_self || 0, max80D_self);
         const allowed80D_parents = Math.min(deductions.section80D_parents || 0, max80D_parents);
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (302.2107ms)

[Killed] ConditionalExpression
services/taxEngine.js:173:31
         allowed80D = allowed80D_self + allowed80D_parents;
     }
     else {
-        allowed80D = Math.min(deductions.section80D || 0, 100000);
+        allowed80D = Math.min(true, 100000);
     }
     const hra = deductions.hra || 0;
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (318.0093ms)

[Killed] ArithmeticOperator
services/taxEngine.js:195:39
     const oldRegimeDeductions = regime === 'old'
         ? (section80C + nps80CCD1B + allowed80D + hra + homeLoanInterest + section80EEA + allowed80TTA + allowed80TTB + otherDeductions)
         : 0;
-    const taxableIncome = Math.max(0, annualIncome - standardDeduction - nps80CCD2 - oldRegimeDeductions);
+    const taxableIncome = Math.max(0, annualIncome - standardDeduction + nps80CCD2 - oldRegimeDeductions);
     return { standardDeduction, oldRegimeDeductions, taxableIncome, nps80CCD2, allowed80D };
 }
killedBy: All tests
statusReason: [MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Unknown instrument type: 'Unknown_Instrument_XYZ'. Using default params {mean: 0.08, stdDev: 0.05}.

[MC] Extreme volatility 150.0% clamped to 60%.

✔ Monte Carlo output has ordered percentiles and bounded goal probability (300.8306ms)
